////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// ВнешнийОтчет.АнализаторПравДоступа.ФормаНастройкиОтбора.Модуль
//
// Автор: Уничкин Р. А. 23 марта 2015 г. 15:04:54
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

//==================================================================================== Уничкин_РА [24.03.2015 19:29:18]=
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СписокЗначенийОтборПравДоступа = Параметры.СписокЗначенийОтборПравДоступа;	
	НаименованиеАнализируемогоОбъекта = Параметры.НаименованиеАнализируемогоОбъекта;
КонецПроцедуры

//==================================================================================== Уничкин_РА [24.03.2015 19:32:36]=
&НаКлиенте
Процедура ПриЗакрытии()
	Оповестить("ЗакрытиеФормыНастройкиСпискаОтбораПравДоступа", СписокЗначенийОтборПравДоступа);	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

//==================================================================================== Уничкин_РА [24.03.2015 18:21:58]=
&НаКлиенте
Процедура СнятьФлажки(Команда)
	сп_УстановитьЗначениеФлажков(Ложь);
КонецПроцедуры

//==================================================================================== Уничкин_РА [24.03.2015 18:22:01]=
&НаКлиенте
Процедура УстановитьФлажки(Команда)
	сп_УстановитьЗначениеФлажков(Истина);
КонецПроцедуры

//==================================================================================== Уничкин_РА [24.03.2015 19:37:04]=
&НаКлиенте
Процедура ЗакрытьФорму(Команда)
	ЭтаФорма.Закрыть();
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

//==================================================================================== Уничкин_РА [24.03.2015 18:22:08]=
&НаКлиенте
Процедура сп_УстановитьЗначениеФлажков(зн)	
	Для каждого Элем Из СписокЗначенийОтборПравДоступа Цикл
		Элем.Пометка = зн;		
	КонецЦикла; 	
КонецПроцедуры

