
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ДокументРезультат.Очистить();
	
	ТаблицаКубатуры = ПрочитатьКубатуру();
	
	ВнешниеНаборыДанных = Новый Структура;
	ВнешниеНаборыДанных.Вставить("Кубатура", ТаблицаКубатуры);
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, КомпоновщикНастроек.ПолучитьНастройки(), ДанныеРасшифровки);
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, ДанныеРасшифровки, Истина);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	
КонецПроцедуры

Функция ПрочитатьКубатуру()
	
	Макет = ПолучитьМакет("Кубатура");
	
	Таблица = Новый ТаблицаЗначений;
	Таблица.Колонки.Добавить("Толщина",          ОбщегоНазначения.ОписаниеТипаЧисло(10, 0));
	Таблица.Колонки.Добавить("КоличествоЛистов", ОбщегоНазначения.ОписаниеТипаЧисло(10, 0));
	Таблица.Колонки.Добавить("ОбъемПачки",       ОбщегоНазначения.ОписаниеТипаЧисло(10, 3));
	
	Для Счетчик = 1 По Макет.ВысотаТаблицы Цикл
		
		НоваяСтрока = Таблица.Добавить();
		НоваяСтрока.Толщина          = Число(Макет.Область(Счетчик, 1, Счетчик, 1).Текст);
		НоваяСтрока.КоличествоЛистов = Число(Макет.Область(Счетчик, 2, Счетчик, 2).Текст);
		НоваяСтрока.ОбъемПачки       = Число(Макет.Область(Счетчик, 3, Счетчик, 3).Текст);
		
	КонецЦикла;	
	
	Возврат Таблица;
	
КонецФункции	