
&НаКлиенте
Процедура Загрузить(Команда)
	ЗагрузитьСервер();
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьСервер()
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	Макет = ОбработкаОбъект.ПолучитьМакет("Макет");
	
	КэшМастеров = Новый Соответствие;
	КэшОборудование = Новый Соответствие;
	
	Для Счетчик = 1 по Макет.ВысотаТаблицы Цикл
		
		Если Счетчик > 10 Тогда
			Возврат;
		КонецЕсли;	
		
		Данные = Новый Структура;
		
		Данные.Вставить("Номер",  Макет.Область(Счетчик, 2, Счетчик, 2).Текст);
		Данные.Вставить("Дата",   Макет.Область(Счетчик, 3, Счетчик, 3).Текст);
		Данные.Вставить("Мастер", Макет.Область(Счетчик, 4, Счетчик, 4).Текст);
		Данные.Вставить("Смена",  Макет.Область(Счетчик, 5, Счетчик, 5).Текст);
		Данные.Вставить("Оборудование", Макет.Область(Счетчик, 6, Счетчик, 6).Текст);
		Данные.Вставить("Причина1",     Макет.Область(Счетчик, 7, Счетчик, 7).Текст);
		Данные.Вставить("Продолжительность", Макет.Область(Счетчик, 8, Счетчик, 8).Текст);
		Данные.Вставить("Классификация", Макет.Область(Счетчик, 9, Счетчик, 9).Текст);
		Данные.Вставить("Причина2",      Макет.Область(Счетчик, 10, Счетчик, 10).Текст);
		Данные.Вставить("ОборудованиеКод", Макет.Область(Счетчик, 11, Счетчик, 11).Текст);
		
		Если ПустаяСтрока(Данные.Дата) Тогда
			Продолжить;
		КонецЕсли;	
		
		ДокументОбъект = НайтиДокумент(Прав("000000000" + Данные.Номер, 11));
		
		Если Ложь Тогда
			ДокументОбъект = Документы._ПростойОборудования.СоздатьДокумент();
 		КонецЕсли;
		
		ДокументОбъект.Дата = вДату(Данные.Дата);
		ДокументОбъект.Мастер = НайтиМастера(Данные.Мастер, КэшМастеров);
		ДокументОбъект.Смена  = СокрЛП(Данные.Смена);
		ДокументОбъект.Продолжительность = ПолучитьПродолжительность(Данные.Продолжительность);
		ДокументОбъект.ОбъектЭксплуатации = НайтиОборудование(СокрЛП(Данные.Оборудование), КэшОборудование, СокрЛП(Данные.ОборудованиеКод));
		ДокументОбъект.КлассификацияПричины = НайтиКлассификацию(СокрЛП(Данные.Классификация));

		Причина = СокрЛП(Данные.Причина1);
		Если НЕ ПустаяСтрока(Данные.Причина2) Тогда
			
			Если НЕ ПустаяСтрока(Причина) Тогда
				Причина = Причина + ", ";
			КонецЕсли;
			
			Причина = Причина + СокрЛП(Данные.Причина2);
			
		КонецЕсли;	
		ДокументОбъект.Комментарий = Причина;
		
		ДокументОбъект.Записать();
		Попытка
			ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
		КонецПопытки;	

	КонецЦикла;	
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция вДату(ДатаСтр)
	//15/02/16
	
	Массив = СтрРазделить(ДатаСтр, "/");
	Возврат Дата(2000 + Число(Массив[2]), Число(Массив[1]), Число(Массив[0]));
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьПродолжительность(Стр)
	//1,45
	
	Массив = СтрРазделить(Стр, ",");
	Возврат '0001-01-01' + 3600 * Число(Массив[0]) + 60 * Число(Массив[1]); 
	
КонецФункции

&НаСервереБезКонтекста
Функция НайтиКлассификацию(Наименование)
	
	Запрос = Новый Запрос;
	Запрос.Параметры.Вставить("Наименование", Наименование);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Спр.Ссылка
	|ИЗ
	|	Справочник._КлассификаторПричинПростоя КАК Спр
	|ГДЕ
	|	Спр.Наименование = &Наименование";
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		
		Объект = Справочники._КлассификаторПричинПростоя.СоздатьЭлемент();
		Объект.Наименование = Наименование;
		Объект.Записать();
		
		Возврат Объект.Ссылка;
		
	Иначе
		
		Ссылка = Результат.Выгрузить()[0][0];
		Возврат Ссылка;
		
	КонецЕсли;
	
КонецФункции	

&НаСервереБезКонтекста
Функция НайтиОборудование(Наименование, Кэш, Код)
	
	Ссылка = Кэш.Получить(Наименование);
	Если Ссылка <> Неопределено Тогда 
		Возврат Ссылка;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Параметры.Вставить("Код", Код);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Спр.Ссылка
	|ИЗ
	|	Справочник.ОбъектыЭксплуатации КАК Спр
	|ГДЕ
	|	Спр.Код = &Код";
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат Справочники.ОбъектыЭксплуатации.ПустаяСсылка();
	Иначе
		
		Ссылка = Результат.Выгрузить()[0][0];
		Кэш.Вставить(Наименование, Ссылка);
		Возврат Ссылка;
		
	КонецЕсли;
	
КонецФункции

&НаСервереБезКонтекста
Функция НайтиМастера(Мастер, Кэш)
	
	Ссылка = Кэш.Получить(Мастер);
	Если Ссылка <> Неопределено Тогда 
		Возврат Ссылка;
	КонецЕсли;
	
	Массив = СтрРазделить(СокрЛП(Мастер), " ");
	ИО = СтрРазделить(Массив[1], ".");
	
	Запрос = Новый Запрос;
	Запрос.Параметры.Вставить("Фамилия",  СокрЛП(Массив[0]));
	Запрос.Параметры.Вставить("Имя",      СокрЛП(ИО[0]) + "%");
	Запрос.Параметры.Вставить("Отчество", СокрЛП(ИО[1]) + "%");
	
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ФИОФизическихЛицСрезПоследних.ФизическоеЛицо
	|ИЗ
	|	РегистрСведений.ФИОФизическихЛиц.СрезПоследних КАК ФИОФизическихЛицСрезПоследних
	|ГДЕ
	|	ФИОФизическихЛицСрезПоследних.Фамилия = &Фамилия
	|	И ФИОФизическихЛицСрезПоследних.Имя ПОДОБНО &Имя
	|	И ФИОФизическихЛицСрезПоследних.Отчество ПОДОБНО &Отчество";
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат Справочники.ФизическиеЛица.ПустаяСсылка();
	Иначе
		
		Ссылка = Результат.Выгрузить()[0][0];
		Кэш.Вставить(Мастер, Ссылка);
		Возврат Ссылка;
		
	КонецЕсли;
	
КонецФункции

&НаСервереБезКонтекста
Функция НайтиДокумент(Номер)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Док.Ссылка
	|ИЗ
	|	Документ._ПростойОборудования КАК Док
	|ГДЕ
	|	Док.Номер = &Номер";
	
	Запрос.Параметры.Вставить("Номер", Номер);
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		
		ДокументОбъект = Документы._ПростойОборудования.СоздатьДокумент();
		ДокументОбъект.Номер = Номер;
		
	Иначе
		
		ДокументОбъект = Результат.Выгрузить()[0][0].ПолучитьОбъект();
		ДокументОбъект.ПометкаУдаления = Ложь;
		
	КонецЕсли;
	
	Возврат ДокументОбъект;
		
	
КонецФункции	

&НаКлиенте
Процедура Док(Команда)
	ОткрытьФорму("Документ._ПростойОборудования.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура Тест(Команда)
	Сообщить(ПолучитьПродолжительность("0,40"));
КонецПроцедуры
