
&НаКлиенте
Процедура Печать(Команда)
	
	ПечатьНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПечатьНаСервере()
	
	МассивОбъектов = Новый Массив;
	МассивОбъектов.Добавить(ДокументСсылка);
	
	ОбъектыПечати = Новый СписокЗначений;
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ТабличныйДокумент = ОбработкаОбъект.СформироватьПечатнуюФорму_ПроверкаТабеля(МассивОбъектов, ОбъектыПечати);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДокументСсылка = Параметры.ОбъектыНазначения[0];
	ПечатьНаСервере();
	
КонецПроцедуры
