НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТолькоПросмотр = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаписать(Команда)
	КомандаЗаписатьНаСервере();
КонецПроцедуры

&НаСервере
Процедура КомандаЗаписатьНаСервере()
	
	НаборЗаписей = РегистрыСведений.РазмерыГосударственныхПособий.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Период.Установить(Запись.Период);
	
	НоваяЗапись = НаборЗаписей.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяЗапись, Запись);
	
	НаборЗаписей.ОбменДанными.Загрузка = Истина;
	НаборЗаписей.Записать();
	
	//НоваяЗапись = РегистрыСведений.РазмерыГосударственныхПособий.СоздатьМенеджерЗаписи();
	//ЗаполнитьЗначенияСвойств(НоваяЗапись, Запись);
	//НоваяЗапись.Записать();
	
	Модифицированность = Ложь;
	
КонецПроцедуры

#КонецОбласти
