
&НаКлиенте
Процедура Рассчитать(Команда)
	
	ДвоичныеДанные = Новый ДвоичныеДанные(ИмяФайла);
	Хэш = РассчитатьХэш(ДвоичныеДанные);
	Сообщить(Хэш);
	
КонецПроцедуры

&НаКлиенте
Процедура ИмяФайлаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыборФайлаЗавершение", ЭтотОбъект);
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Показать(ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборФайлаЗавершение(ВыбранныеФайлы, ДопПараметры) Экспорт
	
	ИмяФайла = ВыбранныеФайлы[0];
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция РассчитатьХэш(ДвоичныеДанные)
	
	ХешированиеДанных = Новый ХешированиеДанных(ХешФункция.SHA1);
	ХешированиеДанных.Добавить(ДвоичныеДанные);
	
	Возврат Base64Строка(ХешированиеДанных.ХешСумма);
	
КонецФункции	