 Цикл
		
		Если ЗначениеЗаполнено(Объект.ФильтрТаблица) Тогда
			
			Если Объект.ТипПоиска = "ИмяБД" Тогда
				
				Если Найти(СтрокаТЗ.ИмяТаблицыХранения, СокрЛП(Объект.ФильтрТаблица)) = 0 Тогда
					Продолжить;
				КонецЕсли;
				
			Иначе
				
				Если Найти(СтрокаТЗ.Метаданные, СокрЛП(Объект.ФильтрТаблица)) = 0 Тогда
					Продолжить;
				КонецЕсли;
				
			КонецЕсли;	
			
		КонецЕсли;
		
		НоваяСтрока = СтруктураХраненияБазы.ПолучитьЭлементы().Добавить();
		НоваяСтрока.ИмяБД      = СтрокаТЗ.ИмяТаблицыХранения;
		НоваяСтрока.Имя1С      = СтрокаТЗ.Метаданные;
		НоваяСтрока.Метаданные = СтрокаТЗ.Метаданные;
		
		Для каждого СтрокаТЗ2 Из СтрокаТЗ.Поля Цикл
			
			Если ЗначениеЗаполнено(Объект.ФильтрПоле)
				И Найти(СтрокаТЗ2.ИмяПоляХранения, СокрЛП(Объект.ФильтрПоле)) = 0 Тогда
				
				Продолжить;
				
			КонецЕсли;
			
			НоваяСтрока2 = НоваяСтрока.ПолучитьЭлементы().Добавить();
			НоваяСтрока2.ИмяБД      = СтрокаТЗ2.ИмяПоляХранения;
			НоваяСтрока2.Имя1С      = СтрокаТЗ2.ИмяПоля;
			НоваяСтрока2.Метаданные = СтрокаТЗ2.Метаданные;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура НайтиТаблицы(Команда)
	НайтиТаблицыНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Объект.ТипПоиска = "ИмяБД";
	
КонецПроцедуры
