
Функция СведенияОВнешнейОбработке() Экспорт
	
	ПараметрыРегистрации = Новый Структура;
	МассивНазначений = Новый Массив;
	МассивНазначений.Добавить("Документ.ЗаказНаПроизводство"); //Указываем документ к которому делаем внешнюю печ. форму
	
	ПараметрыРегистрации = ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке("2.2.2.1");
	ПараметрыРегистрации.Вид          = ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиЗаполнениеОбъекта();
	ПараметрыРегистрации.Наименование = Метаданные().Представление();
	ПараметрыРегистрации.Версия       = Метаданные().Комментарий;
	ПараметрыРегистрации.Назначение   = МассивНазначений;
	ПараметрыРегистрации.БезопасныйРежим = Ложь;
	
	ДобавитьКоманду(ПараметрыРегистрации.Команды, "Закрытие заказа", "Закрытие заказа", ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыОткрытиеФормы(), Ложь);
		
	Возврат ПараметрыРегистрации;	
		
КонецФункции

Процедура ДобавитьКоманду(ТаблицаКоманд, Представление, Идентификатор, Использование, ПоказыватьОповещение = Ложь, Модификатор = "")
	
	НоваяКоманда = ТаблицаКоманд.Добавить();
	НоваяКоманда.Представление = Представление;
	НоваяКоманда.Идентификатор = Идентификатор;
	НоваяКоманда.Использование = Использование;
	НоваяКоманда.ПоказыватьОповещение = ПоказыватьОповещение;
	НоваяКоманда.Модификатор = Модификатор;
	
КонецПроцедуры

Процедура Заполнить() Экспорт
	
	ЗаполнитьВыпуск();
	ЗаполнитьПродукцию();
	ЗаполнитьМатериалы();
	
КонецПроцедуры

Процедура ЗаполнитьВыпуск() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Параметры.Вставить("Заказ",          ЗаказНаПроизводство);
	Запрос.Параметры.Вставить("СтатусВыполнен", Перечисления.СтатусыМаршрутныхЛистовПроизводства.Выполнен);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Выборка.Распоряжение КАК Распоряжение,
	|	Выборка.Номенклатура,
	|	Выборка.Характеристика,
	|	Выборка.Назначение,
	|	СУММА(Выборка.КоличествоМЛ) КАК КоличествоМЛ,
	|	СУММА(Выборка.КоличествоВыпуск) КАК КоличествоВыпуск
	|ИЗ
	|	(ВЫБРАТЬ
	|		ДокВыходныеИзделия.Ссылка КАК Распоряжение,
	|		ДокВыходныеИзделия.Номенклатура КАК Номенклатура,
	|		ДокВыходныеИзделия.Характеристика КАК Характеристика,
	|		ДокВыходныеИзделия.Назначение КАК Назначение,
	|		ДокВыходныеИзделия.КоличествоФакт КАК КоличествоМЛ,
	|		0 КАК КоличествоВыпуск
	|	ИЗ
	|		Документ.МаршрутныйЛистПроизводства.ВыходныеИзделия КАК ДокВыходныеИзделия
	|	ГДЕ
	|		ДокВыходныеИзделия.Ссылка.Распоряжение В(&Заказ)
	|		И ДокВыходныеИзделия.Ссылка.Проведен
	|		И ДокВыходныеИзделия.Ссылка.Статус = &СтатусВыполнен
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ДокВыходныеИзделия.Ссылка,
	|		ДокВыходныеИзделия.Номенклатура,
	|		ДокВыходныеИзделия.Характеристика,
	|		ДокВыходныеИзделия.Назначение,
	|		ДокВыходныеИзделия.КоличествоФакт,
	|		0
	|	ИЗ
	|		Документ.МаршрутныйЛистПроизводства.ВозвратныеОтходы КАК ДокВыходныеИзделия
	|	ГДЕ
	|		ДокВыходныеИзделия.Ссылка.Распоряжение В(&Заказ)
	|		И ДокВыходныеИзделия.Ссылка.Проведен
	|		И ДокВыходныеИзделия.Ссылка.Статус = &СтатусВыполнен
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Док.Распоряжение,
	|		Док.Номенклатура,
	|		Док.Характеристика,
	|		Док.Назначение,
	|		0,
	|		Док.Количество
	|	ИЗ
	|		Документ.ВыпускПродукции.Товары КАК Док
	|	ГДЕ
	|		Док.Ссылка.Проведен
	|		И Док.Распоряжение.Распоряжение В(&Заказ)) КАК Выборка
	|
	|СГРУППИРОВАТЬ ПО
	|	Выборка.Распоряжение,
	|	Выборка.Номенклатура,
	|	Выборка.Характеристика,
	|	Выборка.Назначение
	|
	|ИМЕЮЩИЕ
	|	СУММА(Выборка.КоличествоМЛ) <> СУММА(Выборка.КоличествоВыпуск)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Распоряжение
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	Таблица = Запрос.Выполнить().Выгрузить();
	Выпуск.Загрузить(Таблица);
	
КонецПроцедуры	

Процедура ЗаполнитьПродукцию() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Параметры.Вставить("Заказ", ЗаказНаПроизводство);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДокВыходныеИзделия.Ссылка.Распоряжение,
	|	ДокВыходныеИзделия.Ссылка.КодСтроки,
	|	СУММА(ДокВыходныеИзделия.КоличествоФакт) КАК КоличествоФакт
	|ПОМЕСТИТЬ МаршрутныеЛисты
	|ИЗ
	|	Документ.МаршрутныйЛистПроизводства.ВыходныеИзделия КАК ДокВыходныеИзделия
	|ГДЕ
	|	ДокВыходныеИзделия.Ссылка.Распоряжение В(&Заказ)
	|
	|СГРУППИРОВАТЬ ПО
	|	ДокВыходныеИзделия.Ссылка.Распоряжение,
	|	ДокВыходныеИзделия.Ссылка.КодСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДокПродукция.Ссылка КАК Заказ,
	|	ДокПродукция.Номенклатура,
	|	ДокПродукция.Характеристика,
	|	ДокПродукция.Назначение,
	|	ДокПродукция.КодСтроки,
	|	ДокПродукция.КлючСвязи,
	|	ДокПродукция.Количество КАК КоличествоПлан,
	|	МаршрутныеЛисты.КоличествоФакт,
	|	ВЫБОР
	|		КОГДА РегОбороты.ВыполненоОборот = РегОбороты.ЗапланированоЗаказомОборот
	|			ТОГДА 0
	|		ИНАЧЕ ДокПродукция.Количество - ЕСТЬNULL(МаршрутныеЛисты.КоличествоФакт, 0)
	|	КОНЕЦ КАК КоличествоДефицит,
	|	РегОбороты.ЗапланированоЗаказомОборот КАК ЭтаповЗапланировано,
	|	РегОбороты.ВыполненоОборот КАК ЭтаповВыполнено
	|ИЗ
	|	Документ.ЗаказНаПроизводство.Продукция КАК ДокПродукция
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЭтапыПроизводства.Обороты(, , , Распоряжение = &Заказ) КАК РегОбороты
	|		ПО (РегОбороты.КодСтрокиПродукция = ДокПродукция.КодСтроки)
	|			И (РегОбороты.Распоряжение = ДокПродукция.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ МаршрутныеЛисты КАК МаршрутныеЛисты
	|		ПО ДокПродукция.Ссылка = МаршрутныеЛисты.Распоряжение
	|			И ДокПродукция.КодСтроки = МаршрутныеЛисты.КодСтроки
	|ГДЕ
	|	ДокПродукция.Ссылка В(&Заказ)
	|	И РегОбороты.ЗапланированоЗаказомОборот <> РегОбороты.ВыполненоОборот
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДокПродукция.НомерСтроки";
	
	Таблица = Запрос.Выполнить().Выгрузить();
	Продукция.Загрузить(Таблица);
	
КонецПроцедуры	

Процедура ЗаполнитьМатериалы() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Параметры.Вставить("Заказ", ЗаказНаПроизводство);
	Запрос.Параметры.Вставить("ВариантНеТребуется", Перечисления.ВариантыОбеспечения.НеТребуется);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РегОбороты.Распоряжение КАК Заказ,
	|	РегОбороты.Номенклатура,
	|	РегОбороты.Характеристика,
	|	РегОбороты.Назначение,
	|	РегОбороты.ВариантОбеспечения,
	|	РегОбороты.КодСтрокиРаспоряжения,
	|	РегОбороты.ДатаПотребности,
	|	РегОбороты.Склад,
	|	РегОбороты.КодСтроки,
	|	РегОбороты.Упаковка,
	|	РегОбороты.Подразделение,
	|	РегОбороты.КоличествоОборот КАК Количество
	|ИЗ
	|	РегистрНакопления.ЗаказыМатериаловСУчетомКорректировок.Обороты(, , , Распоряжение В (&Заказ)) КАК РегОбороты
	|ГДЕ
	|	РегОбороты.ВариантОбеспечения <> &ВариантНеТребуется";
	
	
	Таблица = Запрос.Выполнить().Выгрузить();
	Материалы.Загрузить(Таблица);
	
КонецПроцедуры	


Функция ЗакрытьЗаказ() Экспорт
	
	МассивДокументов = Новый Массив;
	
	НачатьТранзакцию();
	ЗаказОбъект = ЗаказНаПроизводство.ПолучитьОбъект();
	ЗаказОбъект.Заблокировать();
	
	Если ЗаказОбъект.Статус = Перечисления.СтатусыЗаказовНаПроизводство.Закрыт Тогда
		Возврат "Уже закрыт";
	КонецЕсли;	
	
	СократитьПроизводство(ЗаказОбъект);
	
	//ДокСсылка = СформироватьКорректировкуМатериалов();
	//Если ДокСсылка <> Неопределено Тогда
	//	МассивДокументов.Добавить(ДокСсылка);
	//КонецЕсли;	
	//
	////// Перезаполним материалы после сокращения
	////ЗаполнитьМатериалы();
	//
	//ЗаказОбъект.Статус = Перечисления.СтатусыЗаказовНаПроизводство.Закрыт;
	//ЗаказОбъект.ДополнительныеСвойства.Вставить("ВерсионированиеОбъектовКомментарийКВерсии", "Закрыт");
	//ЗаказОбъект.Записать(РежимЗаписиДокумента.Проведение);
	
	ДокСсылка = СформироватьНовыйЗаказ();
	Если ДокСсылка <> Неопределено Тогда
		МассивДокументов.Добавить(ДокСсылка);
	КонецЕсли;	
	
	ЗафиксироватьТранзакцию();
	
	Возврат МассивДокументов;
	
КонецФункции	

Функция СформироватьКорректировкуМатериалов()
	
	Если Материалы.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;	
	
	Реквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ЗаказНаПроизводство, "Организация, Подразделение");
	
	ДокументОбъект = Документы.КорректировкаЗаказаМатериаловВПроизводство.СоздатьДокумент();
	ДокументОбъект.Дата          = ТекущаяДатаСеанса();
	ДокументОбъект.Организация   = Реквизиты.Организация;
	ДокументОбъект.Подразделение = Реквизиты.Подразделение;
	ДокументОбъект.Распоряжение  = ЗаказНаПроизводство;
	ДокументОбъект.Ответственный = Пользователи.ТекущийПользователь();
	
	Для каждого СтрокаТЧ из Материалы Цикл
		
		НоваяСтрока = ДокументОбъект.МатериалыИУслуги.Добавить();
		НоваяСтрока.Номенклатура   = СтрокаТЧ.Номенклатура;
		НоваяСтрока.Характеристика = СтрокаТЧ.Характеристика;
		НоваяСтрока.НазначениеИсходный = СтрокаТЧ.Назначение;
		НоваяСтрока.Назначение         = СтрокаТЧ.Назначение;
		НоваяСтрока.СкладИсходный      = СтрокаТЧ.Склад;
		НоваяСтрока.Склад              = Неопределено;
		НоваяСтрока.ВариантОбеспеченияИсходный = СтрокаТЧ.ВариантОбеспечения;
		НоваяСтрока.ВариантОбеспечения         = Перечисления.ВариантыОбеспечения.НеТребуется;
		НоваяСтрока.ДатаПотребностиИсходный    = СтрокаТЧ.ДатаПотребности;
		НоваяСтрока.ДатаПотребности            = СтрокаТЧ.ДатаПотребности;
		НоваяСтрока.КодСтрокиИсходный  = СтрокаТЧ.КодСтроки;
		НоваяСтрока.КодСтроки          = СтрокаТЧ.КодСтроки;
		НоваяСтрока.КодСтрокиРаспоряжения      = СтрокаТЧ.КодСтрокиРаспоряжения;
		НоваяСтрока.КоличествоУпаковок = СтрокаТЧ.Количество;
		НоваяСтрока.Количество         = СтрокаТЧ.Количество;
		
	КонецЦикла;	
	
	ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
	
	Возврат ДокументОбъект.Ссылка;
	
КонецФункции	

Функция СократитьПроизводство(ЗаказОбъект)
	
	Если Продукция.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;	
	
	// Сокращение производства
	Для каждого СтрокаТЧ из Продукция Цикл
		СократитьПроизводствоПоСтроке(ЗаказОбъект, СтрокаТЧ);
	КонецЦикла;	
	
	ЗаказОбъект.СтатусГрафикаПроизводства = Перечисления.СтатусыГрафикаПроизводстваВЗаказеНаПроизводство.ТребуетсяРассчитать;
	ЗаказОбъект.РассчитатьГрафикВыпуска();
	ЗаказОбъект.ДополнительныеСвойства.Вставить("ВерсионированиеОбъектовКомментарийКВерсии", "Сокращение заказа при закрытии");
	ЗаказОбъект.Записать(РежимЗаписиДокумента.Проведение);
	
	
	//// Формирование и обнуление МЛ
	//МассивЗаказов = Новый Массив;
	//МассивЗаказов.Добавить(ЗаказНаПроизводство);
	//Результат = ОперативныйУчетПроизводстваВызовСервера.СформироватьМаршрутныеЛистыПоЗаказам(МассивЗаказов);
	//Если Результат.Выполнено Тогда
	//	
	//	Запрос = Новый Запрос;
	//	Запрос.Параметры.Вставить("Заказ",  ЗаказНаПроизводство);
	//	Запрос.Параметры.Вставить("Статус", Перечисления.СтатусыМаршрутныхЛистовПроизводства.Создан);
	//	Запрос.Текст =
	//	"ВЫБРАТЬ
	//	|	Док.Ссылка
	//	|ИЗ
	//	|	Документ.МаршрутныйЛистПроизводства КАК Док
	//	|ГДЕ
	//	|	Док.Проведен
	//	|	И Док.Статус = &Статус
	//	|	И Док.Распоряжение = &Заказ";
	//	
	//	Таблица = Запрос.Выполнить().Выгрузить();
	//	Для каждого СтрокаТЗ из Таблица Цикл
	//		
	//		ДокументОбъект = СтрокаТЗ.Ссылка.ПолучитьОбъект();
	//		Если Ложь Тогда
	//			ДокументОбъект = Документы.МаршрутныйЛистПроизводства.СоздатьДокумент();
	//		КонецЕсли;	
	//		
	//		ДокументОбъект.ВыходныеИзделия.Очистить();
	//		ДокументОбъект.ВозвратныеОтходы.Очистить();
	//		ДокументОбъект.МатериалыИУслуги.Очистить();
	//		ДокументОбъект.Трудозатраты.Очистить();
	//		
	//		Если Месяц(ТекущаяДатаСеанса()) <> Месяц(ЗаказОбъект.Дата) Тогда
	//			ДатаВыполнения = КонецМесяца(ЗаказОбъект.Дата);
	//		Иначе
	//			ДатаВыполнения = Неопределено;
	//		КонецЕсли;	
	//			
	//		ДокументОбъект.Статус = Перечисления.СтатусыМаршрутныхЛистовПроизводства.Выполнен;
	//		ДокументОбъект.ПриИзмененииСтатуса(Перечисления.СтатусыМаршрутныхЛистовПроизводства.Создан, ДатаВыполнения);
	//		
	//		ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
	//		
	//	КонецЦикла;
	//	
	//КонецЕсли;	
	
КонецФункции

Функция СократитьПроизводствоПоСтроке(ЗаказОбъект, СтрокаТЧ)
	
	// Отменить неначатое
	ПараметрыСокращения = Новый Структура;
	ПараметрыСокращения.Вставить("Заказ",                        ЗаказНаПроизводство);
	ПараметрыСокращения.Вставить("КлючСвязиПродукция",           СтрокаТЧ.КлючСвязи);
	ПараметрыСокращения.Вставить("КлючСвязиПолуфабрикат",        Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"));
	ПараметрыСокращения.Вставить("ДоделатьНачатыеПолуфабрикаты", Истина);
	ПараметрыСокращения.Вставить("НовоеКоличество",              СтрокаТЧ.КоличествоФакт);
	ПараметрыСокращения.Вставить("КоличествоТребуется",          СтрокаТЧ.КоличествоФакт);
	ПараметрыСокращения.Вставить("БезопасноеСокращение",         СтрокаТЧ.КоличествоФакт);
	
	
	// Структура данных
	СписокКодовСтрокПродукции = Новый Массив;
	СписокКодовСтрокПродукции.Добавить(СтрокаТЧ.КодСтроки);
	
	ПараметрыЗадания = Новый Структура;
	
	ПараметрыЗадания.Вставить("СписокЗаказов",             ЗаказНаПроизводство);
	ПараметрыЗадания.Вставить("СписокКодовСтрокПродукции", СписокКодовСтрокПродукции);
	ПараметрыЗадания.Вставить("ТекущаяДатаСеанса",         ТекущаяДатаСеанса());
	
	АдресХранилища = ПоместитьВоВременноеХранилище(Неопределено);
	Обработки.СокращениеПроизводства.СостояниеЗаказовНаПроизводство(ПараметрыЗадания, АдресХранилища);
	
	
	// Параметры команды
	ПараметрыКоманды = Новый Структура;
	
	ПараметрыКоманды.Вставить("АдресХранилища", АдресХранилища);
	ПараметрыКоманды.Вставить("УникальныйИдентификатор", Новый УникальныйИдентификатор);
	
	ПараметрыКоманды.Вставить("ТекущаяДатаСеанса", ТекущаяДатаСеанса());
	ПараметрыКоманды.Вставить("ПоказыватьЭтапы",   Ложь);
	
	ПараметрыКоманды.Вставить("ПараметрыСокращения", ПараметрыСокращения);

	АдресХранилища = Обработки.СокращениеПроизводства.СократитьПроизводство(ПараметрыКоманды);
	
	
	// Изменение заказа
	ПараметрыКоманды = Новый Структура;
	
	ПараметрыКоманды.Вставить("Заказ", ЗаказНаПроизводство);
	ПараметрыКоманды.Вставить("КодСтрокиПродукция", СтрокаТЧ.КодСтроки);
	ПараметрыКоманды.Вставить("КлючСвязиПродукция", СтрокаТЧ.КлючСвязи);
	
	ПараметрыКоманды.Вставить("АдресХранилища", АдресХранилища);
	ПараметрыКоманды.Вставить("АдресСпецификация", ПланированиеПроизводства.ДанныеСпецификацииЗаказаВХранилилище(
		ЗаказОбъект, СтрокаТЧ.КлючСвязи, Новый УникальныйИдентификатор));
	
	ПараметрыКоманды.Вставить("УникальныйИдентификатор", Новый УникальныйИдентификатор);
	
	ПланированиеПроизводства.УдалитьДанныеСпецификацииПоКлючу(ЗаказОбъект, СтрокаТЧ.КлючСвязи);
	
	РезультатРедактирования = Обработки.СокращениеПроизводства.РезультатРедактированияСтрокиСпецификацииЗаказа(ПараметрыКоманды);
	
	 //Запись изменений в табличную часть Продукция.
	ДанныеПродукции = ЗаказОбъект.Продукция.Найти(РезультатРедактирования.СтруктураПродукции.КлючСвязи, "КлючСвязи");
	
	ЗаполнитьЗначенияСвойств(ДанныеПродукции, РезультатРедактирования.СтруктураПродукции, "Упаковка, КоличествоУпаковок, Количество, ДатаПотребности,
		|НачатьНеРанее, РазмещениеВыпуска, Склад, Назначение, ЕстьСоответствиеСтандартнойСпецификации");
	ДанныеПродукции.ГрафикРассчитан = Ложь;
	
	// Запись изменений в табличную часть Этапы.
	Для Каждого Строка Из РезультатРедактирования.Этапы Цикл
		ЗаполнитьЗначенияСвойств(ЗаказОбъект.Этапы.Добавить(), Строка);
	КонецЦикла;
	
	// Запись изменений в табличную часть ВыходныеИзделия.
	Для Каждого Строка Из РезультатРедактирования.ВыходныеИзделия Цикл
		ЗаполнитьЗначенияСвойств(ЗаказОбъект.ВыходныеИзделия.Добавить(), Строка);
	КонецЦикла;
	
	// Запись изменений в табличную часть ВозвратныеОтходы.
	Для Каждого Строка Из РезультатРедактирования.ВозвратныеОтходы Цикл
		ЗаполнитьЗначенияСвойств(ЗаказОбъект.ВозвратныеОтходы.Добавить(), Строка);
	КонецЦикла;
	
	// Запись изменений в табличную часть МатериалыИУслуги.
	Для Каждого Строка Из РезультатРедактирования.МатериалыИУслуги Цикл
		ЗаполнитьЗначенияСвойств(ЗаказОбъект.МатериалыИУслуги.Добавить(), Строка);
	КонецЦикла;
	
	// Запись изменений в табличную часть Трудозатраты.
	Для Каждого Строка Из РезультатРедактирования.Трудозатраты Цикл
		ЗаполнитьЗначенияСвойств(ЗаказОбъект.Трудозатраты.Добавить(), Строка);
	КонецЦикла;
	
	// Запись изменений в табличную часть ВидыРабочихЦентров.
	Для Каждого Строка Из РезультатРедактирования.ВидыРабочихЦентров Цикл
		ЗаполнитьЗначенияСвойств(ЗаказОбъект.ВидыРабочихЦентров.Добавить(), Строка);
	КонецЦикла;
	
	// Запись изменений в табличную часть АльтернативныеВидыРабочихЦентров.
	Для Каждого Строка Из РезультатРедактирования.АльтернативныеВидыРабочихЦентров Цикл
		ЗаполнитьЗначенияСвойств(ЗаказОбъект.АльтернативныеВидыРабочихЦентров.Добавить(), Строка);
	КонецЦикла;
	
	// Запись изменений в табличную часть ЭтапыВосстановленияБрака.
	Для Каждого Строка Из РезультатРедактирования.ЭтапыВосстановленияБрака Цикл
		ЗаполнитьЗначенияСвойств(ЗаказОбъект.ЭтапыВосстановленияБрака.Добавить(), Строка);
	КонецЦикла;
	
КонецФункции

Функция СформироватьНовыйЗаказ()
	
	Если ВариантСократитьПроизводство = "ОтменитьВыполнение" Тогда
		Возврат Неопределено;
	КонецЕсли;	
	
КонецФункции