
&НаКлиенте
Процедура ШаблоныОзнакомления(Команда)
	ШаблоныОзнакомленияНаСервере();
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ШаблоныОзнакомленияНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ШаблоныОзнакомления.Ссылка КАК Ссылка,
	|	ШаблоныОзнакомления.КомплексныйПроцесс
	|ИЗ
	|	Справочник.ШаблоныОзнакомления КАК ШаблоныОзнакомления
	|ГДЕ
	|	ШаблоныОзнакомления.КомплексныйПроцесс.Ссылка ЕСТЬ NULL 
	|	И ШаблоныОзнакомления.КомплексныйПроцесс <> &ПустойПроцесс";
	
	Запрос.Параметры.Вставить("ПустойПроцесс", БизнесПроцессы.КомплексныйПроцесс.ПустаяСсылка());
	Таблица = Запрос.Выполнить().Выгрузить();
	
	Для каждого СтрокаТЗ из Таблица Цикл
		
		СпрОбъект = СтрокаТЗ.Ссылка.ПолучитьОбъект();
		СпрОбъект.КомплексныйПроцесс = БизнесПроцессы.КомплексныйПроцесс.ПустаяСсылка();
		СпрОбъект.ОбменДанными.Загрузка = Истина;
		СпрОбъект.Записать();
		
	КонецЦикла;
	
	
КонецПроцедуры

&НаКлиенте
Процедура КомплексныеПроцессыПоПомеченнымЭтапам(Команда)
	КомплексныеПроцессыПоПомеченнымЭтапамНаСервере();
КонецПроцедуры

&НаСервере
Процедура КомплексныеПроцессыПоПомеченнымЭтапамНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Параметры.Вставить("Дата", '2016-01-01');
	Запрос.Параметры.Вставить("ПустойПроцесс", БизнесПроцессы.КомплексныйПроцесс.ПустаяСсылка());
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КомплексныйПроцесс.Ссылка КАК Ссылка
	|ИЗ
	|	БизнесПроцесс.КомплексныйПроцесс КАК КомплексныйПроцесс
	|ГДЕ
	|	НЕ КомплексныйПроцесс.Стартован
	|	И КомплексныйПроцесс.Дата < &Дата";
	
	Таблица = Запрос.Выполнить().Выгрузить();
	
	Для каждого СтрокаТЗ из Таблица Цикл
		
		СпрОбъект = СтрокаТЗ.Ссылка.ПолучитьОбъект();
		СпрОбъект.ПометкаУдаления = Истина;
		СпрОбъект.ОбменДанными.Загрузка = Истина;
		СпрОбъект.Записать();
		
		ПометитьЗадачиПоПроцессу(СтрокаТЗ.Ссылка);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПометитьЗадачиПоПроцессу(БизнесПроцесс)
	
	Запрос = Новый Запрос;
	Запрос.Параметры.Вставить("БизнесПроцесс", БизнесПроцесс);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗадачаИсполнителя.Ссылка
	|ИЗ
	|	Задача.ЗадачаИсполнителя КАК ЗадачаИсполнителя
	|ГДЕ
	|	ЗадачаИсполнителя.БизнесПроцесс = &БизнесПроцесс";
	
	Таблица = Запрос.Выполнить().Выгрузить();
	
	Для каждого СтрокаТЗ из Таблица Цикл
		
		СпрОбъект = СтрокаТЗ.Ссылка.ПолучитьОбъект();
		СпрОбъект.ПометкаУдаления = Истина;
		СпрОбъект.ОбменДанными.Загрузка = Истина;
		СпрОбъект.Записать();
		
		ПометитьБизнесПроцессыПоЗадаче(СтрокаТЗ.Ссылка);
		
	КонецЦикла;
	
КонецПроцедуры	

Процедура ПометитьБизнесПроцессыПоЗадаче(Задача)
	
	Запрос = Новый Запрос;
	Запрос.Параметры.Вставить("Задача", Задача);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	БП.Ссылка КАК Ссылка
	|ИЗ
	|	БизнесПроцесс.Исполнение КАК БП
	|ГДЕ
	|	БП.ГлавнаяЗадача = &Задача";
	
	Таблица = Запрос.Выполнить().Выгрузить();
	
	Для каждого СтрокаТЗ из Таблица Цикл
		
		СпрОбъект = СтрокаТЗ.Ссылка.ПолучитьОбъект();
		СпрОбъект.ПометкаУдаления = Истина;
		СпрОбъект.ОбменДанными.Загрузка = Истина;
		СпрОбъект.Записать();
		
		ПометитьЗадачиПоПроцессу(СтрокаТЗ.Ссылка);
		
	КонецЦикла;
	
КонецПроцедуры	
