
&НаСервереБезконтекста
Функция ЗначенияРеквизитовОбъекта(Ссылка, Реквизиты)
	
	Возврат ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, Реквизиты);
	
КонецФункции	

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДокументСсылка = Параметры.ОбъектыНазначения[0];
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Реквизиты = ЗначенияРеквизитовОбъекта(ДокументСсылка, "Распоряжение, КодСтроки");
	
	Форма = ПолучитьФорму("Документ.МаршрутныйЛистПроизводства.ФормаСписка",,, Новый УникальныйИдентификатор);
	Форма.Открыть();
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Форма.Список, "Распоряжение", Реквизиты.Распоряжение,,,, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ, "Распоряжение");
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Форма.Список, "КодСтроки",    Реквизиты.КодСтроки,   ,,, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ, "КодСтроки");
	
	Отказ = Истина;
	
КонецПроцедуры

