
// Справочник.ШаблоныЭтикетокИЦенников.Форма
//	ЗаполнитьДоступныеПоля
Процедура ДобавитьДоступныеПоля(Назначение, ИменаПолей) Экспорт
	
	Если Назначение = Перечисления.НазначенияШаблоновЭтикетокИЦенников.ЭтикеткаСерииНоменклатуры Тогда
		
		ИменаПолей.Добавить("ШтрихкодНоменклатуры");
		
		ИменаПолей.Добавить("Назначение.Наименование");
		ИменаПолей.Добавить("Назначение.Заказ");
		ИменаПолей.Добавить("Назначение.Заказ.Дата");
		ИменаПолей.Добавить("Назначение.Заказ.Номер");
		ИменаПолей.Добавить("Назначение.Заказ.Контрагент");
		
		ИменаПолей.Добавить("Номенклатура.Артикул");
		ИменаПолей.Добавить("Номенклатура.ВариантОформленияПродажи");
		ИменаПолей.Добавить("Номенклатура.Вес");
		ИменаПолей.Добавить("Номенклатура.ВестиУчетПоГТД");
		ИменаПолей.Добавить("Номенклатура.ВидНоменклатуры");
		ИменаПолей.Добавить("Номенклатура.Родитель");
		ИменаПолей.Добавить("Номенклатура.ЕдиницаИзмерения");
		ИменаПолей.Добавить("Номенклатура.Код");
		ИменаПолей.Добавить("Номенклатура.КодДляПоиска");
		ИменаПолей.Добавить("Номенклатура.Наименование");
		ИменаПолей.Добавить("Номенклатура.НаименованиеПолное");
		ИменаПолей.Добавить("Номенклатура.Объем");
		ИменаПолей.Добавить("Номенклатура.Производитель");
		ИменаПолей.Добавить("Номенклатура.СтавкаНДС");
		ИменаПолей.Добавить("Номенклатура.Описание");
		ИменаПолей.Добавить("Номенклатура.ТипНоменклатуры");
		ИменаПолей.Добавить("Номенклатура,Свойства");
		
		ИменаПолей.Добавить("Характеристика.Наименование");
		ИменаПолей.Добавить("Характеристика.НаименованиеПолное");
		ИменаПолей.Добавить("Характеристика.Владелец");
		ИменаПолей.Добавить("Характеристика,Свойства");
		
		ИменаПолей.Добавить("Бригада.Наименование");
		ИменаПолей.Добавить("Бригада.Родитель");
		ИменаПолей.Добавить("Бригада,Свойства");
		ИменаПолей.Добавить("Количество");
		ИменаПолей.Добавить("ОбъемПачки");
		
	КонецЕсли;
	
КонецПроцедуры

// Обработка.ПодборСерийВДокументы.МодульМенеджера
//	СформироватьПечатнуюФормуЭтикеткиСерииНоменклатуры
Функция ИмяМакета_ПоляШаблонаСерииНоменклатуры() Экспорт
	
	Возврат "_ПоляШаблонаСерииНоменклатуры";
	
КонецФункции	

// Справочник.ШаблоныЭтикетокИЦенников.Форма
//	ЗаполнитьДоступныеПоля
Функция ПолучитьСКД_ПоляШаблонаСерииНоменклатуры() Экспорт
	
	Возврат Обработки.ПечатьЭтикетокИЦенников.ПолучитьМакет(ИмяМакета_ПоляШаблонаСерииНоменклатуры());
	
КонецФункции	

// Обработка.ПодборСерийВДокументы.Форма.РегистрацияПодборСерийВДокументы
//	ПодготовитьДанныеДляПечати
Процедура ДобавитьКолонкиВТЗСерии(СерииНоменклатуры) Экспорт
	
	СерииНоменклатуры.Колонки.Добавить("ШтрихкодНоменклатуры", Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(13)));
	СерииНоменклатуры.Колонки.Добавить("Номенклатура",   Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	СерииНоменклатуры.Колонки.Добавить("Характеристика", Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
	СерииНоменклатуры.Колонки.Добавить("Назначение",     Новый ОписаниеТипов("СправочникСсылка.Назначения"));
	СерииНоменклатуры.Колонки.Добавить("Бригада",        Новый ОписаниеТипов("СправочникСсылка.Бригады"));
	СерииНоменклатуры.Колонки.Добавить("Количество",     Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 3)));
	СерииНоменклатуры.Колонки.Добавить("ОбъемПачки",     Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 3)));
	
КонецПроцедуры	

// Обработка.ПодборСерийВДокументы.Форма.РегистрацияПодборСерийВДокументы
//	ПодготовитьДанныеДляПечати
Функция СформироватьШтрихкодСерии(Номер, ГоденДо) Экспорт
	
	Возврат СокрЛП(Номер);
	
КонецФункции

// Обработка.ПодборСерийВДокументы.Форма.РегистрацияПодборСерийВДокументы
//	ПодготовитьДанныеДляПечати
Процедура ЗаполнитьПараметрыСтрокиТЗСерии(НоваяСтрока, Номенклатура, Характеристика, Назначение, Количество = 0, Бригада) Экспорт
	
	Упаковка = Справочники.УпаковкиЕдиницыИзмерения.ПустаяСсылка();
	МассивШтрихкодов = РегистрыСведений.ШтрихкодыНоменклатуры.ШтрихкодыНоменклатуры(Номенклатура, Характеристика, Упаковка);
	Если МассивШтрихкодов.Количество() > 0 Тогда
		НоваяСтрока.ШтрихкодНоменклатуры = МассивШтрихкодов[0];
	КонецЕсли;	
	НоваяСтрока.Номенклатура   = Номенклатура;
	НоваяСтрока.Характеристика = Характеристика;
	НоваяСтрока.Назначение     = Назначение;
	НоваяСтрока.Количество     = Количество;
	НоваяСтрока.ОбъемПачки     = _ОбщегоНазначенияДоп.ПолучитьДопРеквизит(Характеристика, "Объем пачки");
	НоваяСтрока.Бригада        = Бригада;
	
КонецПроцедуры

// Обработка.ПодборСерийВДокументы.Форма.РегистрацияПодборСерийВДокументы
//	ДобавитьСтрокиНаСервере
//  СгенерироватьНомер
Функция ПолучитьСрокГодности(Знач Регистратор, Знач ИспользоватьСрокГодностиСерии, Знач Дата) Экспорт
	
	Если ИспользоватьСрокГодностиСерии
		И ТипЗнч(Регистратор) = Тип("ДокументСсылка.МаршрутныйЛистПроизводства") Тогда
		
		Если НЕ ЗначениеЗаполнено(Дата) Тогда
			Дата = ТекущаяДатаСеанса();
		КонецЕсли;
		
		Возврат Дата;
		
	КонецЕсли;	
	
	Возврат '0001-01-01';
	
КонецФункции	

// Обработка.ПодборСерийВДокументы.МодульМенеджера
//	ПодготовитьСтруктуруДанных
Функция ТекстВременнойТаблицыСерии() Экспорт
	
	Возврат
	"	(ВЫБРАТЬ
	|		ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК Серия,
	|		ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) КАК Номенклатура,
	|		ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК Характеристика,
	|		ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка) КАК Назначение,
	|		ЗНАЧЕНИЕ(Справочник.Бригады.ПустаяСсылка) КАК Бригада,
	|		"""" КАК Штрихкод,
	|		"""" КАК ШтрихкодНоменклатуры,
	|		0 КАК Порядок,
	|		0 КАК Количество,
	|		0 КАК ОбъемПачки)";
	
КонецФункции

