
Процедура ПриСозданииНаСервере_ФормаСписка(Форма, Отказ, СтандартнаяОбработка) Экспорт
	
	Если НЕ Пользователи.РолиДоступны("_ОтображатьБюджетыПоВсемПользователям") Тогда
		
		КлючОбъекта = Форма.Имяформы + "/ТекущиеДанные";
		Настройки = ХранилищеСистемныхНастроек.Загрузить(КлючОбъекта);
		Если Настройки = Неопределено Тогда
			
			Форма.Ответственный = Пользователи.ТекущийПользователь();
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
				Форма.Список, "Ответственный",  Форма.Ответственный, ВидСравненияКомпоновкиДанных.Равно, , ЗначениеЗаполнено(Форма.Ответственный));
				
		Иначе
			
			Если Настройки["Ответственный"] <> Пользователи.ТекущийПользователь() Тогда
				
				Настройки["Ответственный"] = Пользователи.ТекущийПользователь();
				ХранилищеСистемныхНастроек.Сохранить(КлючОбъекта,, Настройки);
				
			КонецЕсли;	
			
		КонецЕсли;	
		
		Форма.Элементы.ОтборОтветственный.ТолькоПросмотр = Истина;
		
	КонецЕсли;	
	
КонецПроцедуры

