
Функция СведенияОВнешнейОбработке() Экспорт
	
	РегистрационныеДанные = Новый Структура;
	РегистрационныеДанные.Вставить("Наименование", "Заполнение корректировки регистров через СКД");
	РегистрационныеДанные.Вставить("БезопасныйРежим", Истина);
	РегистрационныеДанные.Вставить("Версия", "1.0");
	РегистрационныеДанные.Вставить("Вид", "ЗаполнениеОбъекта");	
	РегистрационныеДанные.Вставить("Информация", "Предназначена для заполнения документа ""Корректировка регистров"" одним из двух способов:
	|1. Остатками на дату / оборотами за период в зависимости от вида регистра накопления.
	|2. Произвольными данными на основе схемы компоновки данных (доступно только в толстом клиенте).");
	
	тзКоманд = Новый ТаблицаЗначений;
	тзКоманд.Колонки.Добавить("Идентификатор");
	тзКоманд.Колонки.Добавить("Представление");
	тзКоманд.Колонки.Добавить("Модификатор");
	тзКоманд.Колонки.Добавить("ПоказыватьОповещение");
	тзКоманд.Колонки.Добавить("Использование");
	
	строкаКоманды = тзКоманд.Добавить();
	строкаКоманды.Идентификатор = "ЗаполнениеПроизвольнымиДанными";
	строкаКоманды.Представление = "Произвольными данными (СКД)";
	строкаКоманды.ПоказыватьОповещение = Истина;
	строкаКоманды.Использование = "ОткрытиеФормы";
			
	РегистрационныеДанные.Вставить("Команды", тзКоманд);
	
	МассивНазначений = Новый Массив;
	МассивНазначений.Добавить("Документ.КорректировкаРегистров");
	
	РегистрационныеДанные.Вставить("Назначение", МассивНазначений);
	
	Возврат РегистрационныеДанные;
	
КонецФункции

