
&НаКлиенте
Процедура Очистить(Команда)
	
	ПоказатьВопрос(Новый ОписаниеОповещения("ОчиститьОтвет", ЭтотОбъект), "Очистить движения", РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьОтвет(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ОчиститьСервер(Объект.Ссылка);
		Состояние("Движения очищены");
	КонецЕсли;	
	
КонецПроцедуры

&НаСерверебезКонтекста
Процедура ОчиститьСервер(Ссылка)
	
	ДокументОбъект = Ссылка.ПолучитьОбъект();
	
	Для каждого НаборЗаписей из ДокументОбъект.Движения Цикл
		
		НаборЗаписей.Очистить();
		НаборЗаписей.Записать();
		
	КонецЦикла;	
	
КонецПроцедуры
