#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение Тогда
Перем COMConnector, Connection, ConnectionМетаданные;
Перем СтрокаРавно;
Перем RegExp;

////////////////////////////////////////////////////////////////////////////////
// 27.02.2016. НАСТРОЙКИ ОБРАБОТКИ. РЕФРАКТОРИНГ.
// 

// 27.02.2016.
Функция ЭтоПлатформа82() Экспорт
	Перем ИнформацияСистемная;
	ИнформацияСистемная = Новый СистемнаяИнформация;
	Возврат Найти(ИнформацияСистемная.ВерсияПриложения, "8.2") = 1;
КонецФункции

// 27.02.2016.
Функция ЭтоПлатформа83() Экспорт
	Перем ИнформацияСистемная;
	ИнформацияСистемная = Новый СистемнаяИнформация;
	Возврат Найти(ИнформацияСистемная.ВерсияПриложения, "8.3") = 1;
КонецФункции

// 27.02.2016. Функция, позволяющая встроить ВнешнююОбработку в Справочник типа "Внешние Отчеты и Обработки".
//
// БЕЗОПАСНЫЙ РЕЖИМ:
// В безопасном режиме:
// - игнорируется привилегированный режим;
// - запрещены внешние по отношению к платформе 1С:Предприятия действия: 
// 		- COM;
//		- Загрузка внешних компонент;
//		- Запуск внешних приложений и команд операционной системы;
//		- Доступ к файловой системе, кроме временных файлов;
//		- Доступ к интернет.
// Платформа обеспечивает равенство значений счетчика безопасного режима при вызове 
// произвольного метода встроенного языка и после возврата из него.
//
// КОМАНДЫ:
//Для ВызовКлиентскогоМетода требуется в модуле формы типа:
//
////&НаКлиенте
////Процедура ВыполнитьКоманду(ИдентификаторКоманды) Экспорт
////
////Если ИдентификаторКоманды = "Алминистратор1С" Тогда
////	ОткрытьМодально();
////КонецЕсли;	
////
////КонецПроцедуры
//
Функция СведенияОВнешнейОбработке() Экспорт
	Перем СведенияОВнешнейОбработке, ВерсияБСП, ФайлОбработки;
	Перем ОбъектМетаданных, КонстантыОбработки;
	
	ВерсияБСП = _ПолучитьВерсиюБСП();
	
	СведенияОВнешнейОбработке = Новый Структура;
	
	//++ Основное.
	СведенияОВнешнейОбработке.Вставить("ВерсияБСП"					, ВерсияБСП);
	СведенияОВнешнейОбработке.Вставить("Наименование"				, НСтр1С(МетаДанные().Синоним));
	СведенияОВнешнейОбработке.Вставить("Информация"					, НСтр1С(МетаДанные().Комментарий));
	СведенияОВнешнейОбработке.Вставить("БезопасныйРежим"			, Ложь);
	
	//++ Основное. "Администратор 1С".
	СведенияОВнешнейОбработке.Вставить("Версия"						, "9.2");
	СведенияОВнешнейОбработке.Вставить("Вид"						, "ЗаполнениеОбъекта");
	
	//++ Дополнительно.
	СведенияОВнешнейОбработке.Вставить("ИмяОбработки"				, НСтр1С(МетаДанные().Имя));
	СведенияОВнешнейОбработке.Вставить("АвторскиеПраваНаОбработку"	, "Copyright © StepByStep, 2011-2016.");
	СведенияОВнешнейОбработке.Вставить("ДомашняяСтраницаОбработки"	, "http://www.infostart.ru/public/100967/");
	СведенияОВнешнейОбработке.Вставить("ОбработкаКонфигурации"		, _ЭтоОбработкаКонфигурации(ФайлОбработки));
	СведенияОВнешнейОбработке.Вставить("ФайлОбработки"				, ФайлОбработки);
	//++.
	
	Команды = Новый ТаблицаЗначений;
	Команды.Колонки.Добавить("Идентификатор");
	Команды.Колонки.Добавить("Представление");
	Команды.Колонки.Добавить("Модификатор");
	Команды.Колонки.Добавить("ПоказыватьОповещение");
	Команды.Колонки.Добавить("Использование");
	
	Команда = Команды.Добавить();
	Команда.Идентификатор			= "Администратор1С-ОткрытьФорму";
	Команда.Представление			= "Открыть обработку "+МетаДанные().Синоним;
	Команда.ПоказыватьОповещение 	= Истина;
	Команда.Использование 			= "ОткрытиеФормы";
	
	Команда = Команды.Добавить();
	Команда.Идентификатор			= "Администратор1С-ОткрытьОбъектВ";
	Команда.Представление			= "Открыть объект в "+МетаДанные().Синоним;
	Команда.ПоказыватьОповещение 	= Истина;
	Команда.Использование 			= "ВызовКлиентскогоМетода";
	
	СведенияОВнешнейОбработке.Вставить("Команды", Команды);
	
	//+yuraos, 10.09.2015 - хорошо бы это вставить в Справочную информацию
	// Список назначений дополнительно "фильтруется" составным типом параметра общей команды "ЗаполнениеОбъекта"
	// Если в командных панелях форм объектов интересуемых ссылочных типов нет кнопки "Заполнение..." 
	// или в списке команд заполнения нет команд обработки Администратор1С, то для их включения 
	// необходимо отметить соответствющие ссылочные типы в составном типе параметра указанной выше общей команды.  
	//+yuraos, 10.09.2015
	МассивНазначений = Новый Массив;
	МассивНазначений.Добавить("Справочник.*");
	МассивНазначений.Добавить("Документ.*");
	МассивНазначений.Добавить("ПланВидовХарактеристик.*");
	
	СведенияОВнешнейОбработке.Вставить("Назначение", МассивНазначений);
	
	//++ НОВАЯ РЕГИСТРАЦИЯ ОБРАБОТКИ В РЕЖИМЕ 1С:ПРЕДПРИЯТИЕ. (МАРТ 2016).
	
	ПараметрыРегистрации = Новый Структура("Вид,ВерсияБСП,Наименование,Информация,Версия,БезопасныйРежим,Назначение,Команды");
	ЗаполнитьЗначенияСвойств(ПараметрыРегистрации, СведенияОВнешнейОбработке);
	
	ПараметрыРегистрации.ВерсияБСП = "2.1.2.1";
	Если СравнитьВерсии(ВерсияБСП, "2.1.2.1") > 0 И НЕ Метаданные.Перечисления.Найти("ВидыДополнительныхОтчетовИОбработок") = Неопределено Тогда
		ПараметрыРегистрации.Вид = Вычислить("Перечисления.ВидыДополнительныхОтчетовИОбработок.ЗаполнениеОбъекта");
	Иначе
		ПараметрыРегистрации.Вид = "ЗаполнениеОбъекта";
	КонецЕсли;
	
	//++//
	
	// Формирование структуры "Настройки".
	_Настройки_Общая(Настройки, СведенияОВнешнейОбработке);
	_Настройки_ФормыОбработки(Настройки);
	_Настройки_ПараметрыОбработки(Настройки);
	_Настройки_ЦветаОбработки(Настройки);
	
	СведенияОВнешнейОбработке.Вставить("Настройки"	, Настройки);
		
	Возврат СведенияОВнешнейОбработке;
	
КонецФункции

// 27.02.2016.
Процедура _Настройки_Общая(Настройки, СведенияОВнешнейОбработке)
	Перем СистемнаяИнформация, РежимИспользованияМодальностиСтрока, РольПолныеПрава;
	
	СистемнаяИнформация = Новый СистемнаяИнформация;
	 	
	// Свойства обработки.
	Настройки = Новый Структура();
	Настройки.Вставить("ИмяОбработки"						, СведенияОВнешнейОбработке.ИмяОбработки);
	Настройки.Вставить("СинонимОбработки"					, СведенияОВнешнейОбработке.Наименование);
	Настройки.Вставить("АвторскиеПраваНаОбработку"			, СведенияОВнешнейОбработке.АвторскиеПраваНаОбработку);
	Настройки.Вставить("КомментарийОбработки"				, СведенияОВнешнейОбработке.Информация);
	Настройки.Вставить("ВерсияОбработки"					, СведенияОВнешнейОбработке.Версия);
	Настройки.Вставить("ДомашняяСтраницаОбработки"			, СведенияОВнешнейОбработке.ДомашняяСтраницаОбработки);
	Настройки.Вставить("ОбработкаКонфигурации"				, СведенияОВнешнейОбработке.ОбработкаКонфигурации);
	Настройки.Вставить("ФайлОбработки"						, СведенияОВнешнейОбработке.ФайлОбработки);
	// Платформа.
	Настройки.Вставить("ВерсияПриложения"					, СистемнаяИнформация.ВерсияПриложения);
	Настройки.Вставить("ВерсияПриложенияСокращенно"			, _ВерсияСокращенно(СистемнаяИнформация.ВерсияПриложения));
	Настройки.Вставить("ВерсияПриложенияБезНомераСборки"	, _ВерсияБезНомераСборки(СистемнаяИнформация.ВерсияПриложения));
	// Информационная база.
	Настройки.Вставить("СтрокаСоединенияИнформационнойБазы"	, СтрокаСоединенияИнформационнойБазы());
	// Конфигурация.
	Настройки.Вставить("АвторскиеПраваНаКонфигурацию"		, Метаданные.АвторскиеПрава);
	Настройки.Вставить("Конфигурация"						, _КонфигурацияДоступнаДляОбработки());
	Настройки.Вставить("СинонимКонфигурации"				, МетаДанные.Синоним);
	Настройки.Вставить("ВерсияКонфигурации"					, МетаДанные.Версия);
	Настройки.Вставить("ВерсияКонфигурацииСокращенно"		, _ВерсияСокращенно(МетаДанные.Версия));
	Настройки.Вставить("ВерсияКонфигурацииБезНомераСборки"	, _ВерсияБезНомераСборки(МетаДанные.Версия));
	Настройки.Вставить("КраткаяИнформацияОКонфигурации"		, МетаДанные.КраткаяИнформация);
	Настройки.Вставить("КонфигурацияИВерсия"				, МетаДанные.Имя + " [" + МетаДанные.Версия + "]");
	// Свойства конигурации.
	Настройки.Вставить("ВерсияБСП"							, _ПолучитьВерсиюБСП());
	Настройки.Вставить("РежимСовместимости"					, Строка(МетаДанные.РежимСовместимости));
	Настройки.Вставить("РежимИспользованияМодальностиБулево", _ПолучитьРежимИспользованияМодальностиКонфигурации(РежимИспользованияМодальностиСтрока));
	Настройки.Вставить("РежимИспользованияМодальностиСтрока", РежимИспользованияМодальностиСтрока);
	Настройки.Вставить("ОсновнойРежимЗапускаПриложения"		, МетаДанные.ОсновнойРежимЗапуска);
	Настройки.Вставить("ИмяРегистраДатыЗапрета"				, _ПолучитьИмяРегистраДатыЗапретаИзмененийКонфигурации());
	Настройки.Вставить("ПолнотекстовыйПоискРазрешен"		, ПолнотекстовыйПоиск.ПолучитьРежимПолнотекстовогоПоиска() = РежимПолнотекстовогоПоиска.Разрешить);
	// Настройки сеанса.
	Настройки.Вставить("ТекущийРежимЗапускаПриложения"		, ТекущийРежимЗапуска());
	Настройки.Вставить("ТекущийРежимЗапускаКлиента"			, _ТекущийРежимЗапускаКлиента());
	// Пользователь.
	Настройки.Вставить("ТекущийПользовательИБ"				, ПользователиИнформационнойБазы.ТекущийПользователь().Имя);
	Настройки.Вставить("ПравоДоступаАдминистрирование"		, ПравоДоступа("Администрирование", Метаданные, ПользователиИнформационнойБазы.ТекущийПользователь()));
	Настройки.Вставить("РольПолныеПраваДоступна"			, _ПроверитьНаличиеИДоступностьРолиПолныеПраваВКонфигурации(РольПолныеПрава));
	Настройки.Вставить("РольПолныеПрава"					, РольПолныеПрава);
	Настройки.Вставить("ПолныйДоступ"						, _ПроверитьНаличиеПолногоДоступаУПользователя());
	// КонсолиЗапросов.
	Настройки.Вставить("НастройкаАдресВнешнейОбработкиЗапросов", "");	// Типовой.
	Настройки.Вставить("ПарсерЗапроса"						, "");

КонецПроцедуры

// 27.02.2016.
Процедура _Настройки_ФормыОбработки(Настройки)
	
	Настройки.Вставить("ИспользоватьСтандартнуюФормуВыбора"			, Истина);
	Настройки.Вставить("ИмяФормыВыбораОбъектаДанных"				, ОбработкаПолучитьИмяФормы("ВыборОбъектаДанных"));
	
	// Управляемое и Обычное приложение.
	Настройки.Вставить("ИмяФормыОбработки"							, ОбработкаПолучитьИмяФормы("$ОсновнаяФорма$")); //+yuraos, 10.09.2015
	Настройки.Вставить("ИмяФормыМногоСтрочногоТекста"				, ОбработкаПолучитьИмяФормы("МногострочныйТекст"));
	Настройки.Вставить("ИмяФормыСтруктурыПодчиненности"				, ОбработкаПолучитьИмяФормы("СтруктураПодчиненности"));
	Настройки.Вставить("ИмяФормыКартаМаршрута"						, ОбработкаПолучитьИмяФормы("КартаМаршрута"));
	Настройки.Вставить("ИмяФормыНастройкиОбработки"					, ОбработкаПолучитьИмяФормы("Настройка"));
	Настройки.Вставить("ИмяФормыВыборОбъектаМетаданных"				, ОбработкаПолучитьИмяФормы("ВыборОбъектаМетаданных")); //+yuraos, 10.09.2015 (есть теперь и обычая!)
	
	// Управляемое приложение.
	Настройки.Вставить("ИмяФормыКонстанты"							, ОбработкаПолучитьИмяФормы("Константы"));
	Настройки.Вставить("ИмяФормыАктивныеПользователи"				, ОбработкаПолучитьИмяФормы("АктивныеПользователи"));
	Настройки.Вставить("ИмяФормыВыгрузкаЗагрузкаПользователей"		, ОбработкаПолучитьИмяФормы("ВыгрузкаЗагрузкаПользователей"));
	Настройки.Вставить("ИмяФормыЖурналаРегистрации"					, ОбработкаПолучитьИмяФормы("ЖурналРегистрации"));
	Настройки.Вставить("ИмяФормыВариантыОтчетов"					, ОбработкаПолучитьИмяФормы("ВариантыОтчетов"));
	Настройки.Вставить("ИмяФормыРегистрацияИзменений"				, ОбработкаПолучитьИмяФормы("РегистрацияИзменений"));
	Настройки.Вставить("ИмяФормыПолнотекстовыйПоискДанных"			, ОбработкаПолучитьИмяФормы("ПолнотекстовыйПоискДанных"));
	Настройки.Вставить("ИмяФормыУправлениеПолнотекстовымПоиском"	, ОбработкаПолучитьИмяФормы("УправлениеПолнотекстовымПоиском"));
	
	// На перспективу.
	//Настройки.Вставить("ИмяФормыПарсерЗапросов"	, ОбработкаПолучитьИмяФормы("ПарсерЗапросов"));
	
КонецПроцедуры

// 27.02.2016.
Процедура _Настройки_ПараметрыОбработки(Настройки)
	
	Настройки.Вставить("МонопольныйРежим"						, МонопольныйРежим());
	Настройки.Вставить("ПоказыватьСообщения"					, Ложь);
	Настройки.Вставить("ОбменДаннымиЗагрузка"					, Ложь);
	Настройки.Вставить("СкрыватьПустыеТаблицыДвиженийРегистров"	, Ложь);
	Настройки.Вставить("СкрыватьПустыеТабличныеЧасти"			, Ложь);
	
	Настройки.Вставить("СписокОбъектовТипаСсылка"				, ПолучитьКоличествоОбъектовТипаСсылка());
	Настройки.Вставить("СписокОбъектовТипаРегистр"				, ПолучитьКоличествоОбъектовТипаРегистр());
	
	Настройки.Вставить("ЕстьСправочникОрганизации"				, МетаданныеСодержатСправочник("Организации"));
	Настройки.Вставить("ЕстьСправочникНоменклатура"				, МетаданныеСодержатСправочник("Номенклатура"));
	Настройки.Вставить("ЕстьСправочникСклады"					, МетаданныеСодержатСправочник("Склады"));
	Настройки.Вставить("ЕстьСправочникМагазины"					, МетаданныеСодержатСправочник("Магазины"));
	Настройки.Вставить("ЕстьСправочникКассы"					, МетаданныеСодержатСправочник("Кассы"));
	Настройки.Вставить("ЕстьСправочникКассыККМ"					, МетаданныеСодержатСправочник("КассыККМ"));
	Настройки.Вставить("ЕстьСправочникПодразделения"			, МетаданныеСодержатСправочник("Подразделения"));
	Настройки.Вставить("ЕстьСправочникПодразделенияОрганизаций"	, МетаданныеСодержатСправочник("ПодразделенияОрганизаций"));

КонецПроцедуры

// 27.02.2016.
Процедура _Настройки_ЦветаОбработки(Настройки)
	
	Настройки.Вставить("ЦветКрасный"					, Новый Цвет(255, 0, 0));
	Настройки.Вставить("ЦветЗеленый"					, Новый Цвет(0, 128, 0));
	Настройки.Вставить("ЦветСиний"						, Новый Цвет(0, 0, 255));
	Настройки.Вставить("ЦветКоричневый"					, Новый Цвет(128, 0, 0));
	Настройки.Вставить("ЦветТекстаПоля"					, ЦветаСтиля.ЦветТекстаПоля);
	Настройки.Вставить("ЦветФонаПоля"					, ЦветаСтиля.ЦветФонаПоля);
	Настройки.Вставить("ЦветТекстаБлокируемогоРеквизита", ЦветаСтиля.ЦветОсобогоТекста);
	Настройки.Вставить("ЦветФонаБлокируемогоРеквизита"	, Новый Цвет(204, 255 , 255));

КонецПроцедуры

// 27.02.2016. Определить список поддерживаемых конфигураций.
//
Функция _КонфигурацияДоступнаДляОбработки() Экспорт
	Перем Конфигурация, Конфигурации;
	
	Конфигурация = МетаДанные.Имя;
	
	Возврат "Ограничения по конфигурациям не обнаружено.";
	
	Возврат Неопределено;
	
КонецФункции

// 27.02.2016.
Функция _ПолучитьВерсиюБСП() Экспорт
	Перем ВерсияБСП;
	
	Попытка
		Выполнить("ВерсияБСП = СтандартныеПодсистемыСервер.ВерсияБиблиотеки()");
	Исключение
		Попытка
			Выполнить("ВерсияБСП = СтандартныеПодсистемыПереопределяемый.ВерсияБиблиотеки()");
		Исключение
			ВерсияБСП = "0.0.0.0";	// Неопределено. см. БСП_ДоступнаТребуемаяВерсия()
		КонецПопытки;
	КонецПопытки;
	
	Возврат ВерсияБСП;
	
КонецФункции

// 27.02.2016. Возвращает флаг того, что БСП в текущей конфигурации обеспечивает функционал
//
Функция БСП_ДоступнаТребуемаяВерсия212() Экспорт
	
	// Ищем в версии БСП: 2.1.2 и старше
	Попытка
		СтрокиВерсии = СтрЗаменить(
			Вычислить("СтандартныеПодсистемыСервер.ВерсияБиблиотеки()"),
			".", Символы.ПС);
	Исключение
		Возврат Ложь;
	КонецПопытки;
	
	НужнаяВерсия = Новый Массив;
	НужнаяВерсия.Добавить(2);
	НужнаяВерсия.Добавить(1);
	НужнаяВерсия.Добавить(2);
	
	Для Индекс=0 ПО НужнаяВерсия.ВГраница() Цикл
		
		Попытка
			ТекЧисло = Число(СтрПолучитьСтроку(СтрокиВерсии, Индекс + 1));
		Исключение
			Возврат Ложь;
		КонецПопытки;
		
		ЧастьВерсии = НужнаяВерсия[Индекс];
		Если ТекЧисло > ЧастьВерсии Тогда
			Возврат Истина;
		ИначеЕсли ТекЧисло < ЧастьВерсии Тогда
			Возврат Ложь;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Истина;
КонецФункции

// 27.02.2016. Возвращает флаг того, что БСП в текущей конфигурации обеспечивает функционал.
//
Функция БСП_ДоступнаТребуемаяВерсия(Знач Версия = Неопределено) Экспорт
	
	// ВерсияБСП = "0.0.0.0" в обработке (по-умолчанию), определяется при открытии обработки.
	//ТекущаяВерсия = Неопределено;
	ТекущаяВерсия = ЭтотОбъект.ВерсияБСП;
	Если НЕ ЗначениеЗаполнено(ТекущаяВерсия) Тогда
		МодульСтандартныеПодсистемыСервер = ОбщегоНазначенияОбщийМодуль("СтандартныеПодсистемыСервер");
		МодульСтандартныеПодсистемыПереопределяемый = ОбщегоНазначенияОбщийМодуль("СтандартныеПодсистемыПереопределяемый");
		Если МодульСтандартныеПодсистемыСервер <> Неопределено ИЛИ МодульСтандартныеПодсистемыПереопределяемый <> Неопределено Тогда
			Попытка
				ТекущаяВерсия = МодульСтандартныеПодсистемыСервер.ВерсияБиблиотеки();
			Исключение
				Попытка
					ТекущаяВерсия = МодульСтандартныеПодсистемыПереопределяемый.ВерсияБиблиотеки();
				Исключение
					ТекущаяВерсия = Неопределено;
				КонецПопытки;
			КонецПопытки;
		КонецЕсли;
	КонецЕсли;
	
	Если ТекущаяВерсия = Неопределено Тогда
		// Отсутствует или поломан метод определения версии, считаем БСП недоступной.
		Возврат Ложь
	КонецЕсли;
	ТекущаяВерсия = СтрЗаменить(ТекущаяВерсия, ".", Символы.ПС);
	
	НужнаяВерсия = СтрЗаменить(?(Версия = Неопределено, "2.2.2", Версия), ".", Символы.ПС);
	
	Для Индекс = 1 По СтрЧислоСтрок(НужнаяВерсия) Цикл
		
		ЧастьТекущейВерсии = СтрокаВЧисло(СтрПолучитьСтроку(ТекущаяВерсия, Индекс));
		ЧастьНужнойВерсии  = СтрокаВЧисло(СтрПолучитьСтроку(НужнаяВерсия,  Индекс));
		
		Если ЧастьТекущейВерсии = Неопределено Тогда
			Возврат Ложь;
			
		ИначеЕсли ЧастьТекущейВерсии > ЧастьНужнойВерсии Тогда
			Возврат Истина;
			
		ИначеЕсли ЧастьТекущейВерсии < ЧастьНужнойВерсии Тогда
			Возврат Ложь;
			
		КонецЕсли;
	КонецЦикла;
	
	Возврат Истина;
КонецФункции

// 27.02.2016.
Функция _ЭтоОбработкаКонфигурации(ФайлОбработки)
	Перем ОбработкаКонфигурации;
	
	Попытка
		ФайлОбработки = ЭтотОбъект.ИспользуемоеИмяФайла;
		Возврат Ложь;
	Исключение
		ФайлОбработки = "" + ТипЗнч(ЭтотОбъект);
		Возврат Истина;
	КонецПопытки;
	
	Возврат Неопределено;
	
КонецФункции

// 27.02.2016.
Функция _ПолучитьРежимИспользованияМодальностиКонфигурации(РежимИспользованияМодальностиСтрока, СПредупреждениями = Ложь)
	Перем Режим, Режимы;
	
	Попытка
		Режимы = Метаданные.СвойстваОбъектов.РежимИспользованияМодальности;
		Режим = Метаданные.РежимИспользованияМодальности;
		РежимИспользованияМодальностиСтрока = Строка(Режим);
		Если СПредупреждениями Тогда
			Возврат (Режим = Режимы.Использовать ИЛИ Режим = Режимы.ИспользоватьСПредупреждениями);
		Иначе
			Возврат (Режим = Режимы.Использовать);
		КонецЕсли; 
	Исключение
		РежимИспользованияМодальностиСтрока = НСтр("ru = 'Использовать'"); // с английским интерфейсом платформы может прикол случиться 
		Возврат Истина;	// Платформа 8.2 - "Использовать" без альтернатив.
	КонецПопытки;
	
КонецФункции

// 27.02.2016. Форма Режим запуска клиента 1С:Предприятие: Толстый/Тонкий.
//
Функция _ТекущийРежимЗапускаКлиента()
	Перем МассивСоединений;
	Перем ТонкийТолстый;
	
	//+yuraos, 10.09.2015
	// - чтобы для юзеров без полных прав не вызывалось исключение
	УстановитьПривилегированныйРежим(Истина);
	//+yuraos, 10.09.2015

    ТонкийТолстый = "";
	
	МассивСоединений = ПолучитьСоединенияИнформационнойБазы();
	Для Каждого ТекСоединение ИЗ МассивСоединений Цикл
		Если ТекСоединение.Пользователь.Имя = ПользователиИнформационнойБазы.ТекущийПользователь().Имя Тогда
			Если ((ТекСоединение.ИмяПриложения = "1CV8") 
				ИЛИ (ТекСоединение.ИмяПриложения = "1CV8C")) Тогда		// Режим 1С:Предприятие ТолстыйКлиент или ТонкийКлиент.
				// ~ "ТонкийКлиент"	 = ПредставлениеПриложения("1CV8C")
				// ~ "ТолстыйКлиент" = ПредставлениеПриложения("1CV8")
				ТонкийТолстый = ПредставлениеПриложения(ТекСоединение.ИмяПриложения);
				Прервать;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;	
	
	Возврат ТонкийТолстый;

КонецФункции

// 27.02.2016. +yuraos, 10.09.2015
Функция _ПроверитьНаличиеИДоступностьРолиПолныеПраваВКонфигурации(ИмяПолныхПрав = Неопределено)
	
	Если Метаданные.Роли.Найти("ПолныеПрава") <> Неопределено Тогда
		ИмяПолныхПрав = "ПолныеПрава";
	ИначеЕсли Метаданные.Роли.Найти("itilПолныеПрава") <> Неопределено Тогда
		// Рарус 1С:ITIL(Стандарт)
		ИмяПолныхПрав = "itilПолныеПрава";
	ИначеЕсли Метаданные.Роли.Найти("SA") <> Неопределено Тогда
		ИмяПолныхПрав = "SA";
	ИначеЕсли Метаданные.Роли.Найти("sa") <> Неопределено Тогда
		ИмяПолныхПрав = "sa";
	Иначе
		ИмяПолныхПрав = "";
		Для Каждого мд ИЗ Метаданные.Роли Цикл
			Если Найти(ВРег(мд.Имя), ВРег("ПолныеПрава")) > 0 Тогда
				ИмяПолныхПрав = мд.Имя;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если ПустаяСтрока(ИмяПолныхПрав) Тогда
		Возврат Ложь;
	Иначе
		Возврат РольДоступна(ИмяПолныхПрав);
	КонецЕсли; 
	
КонецФункции

// 27.02.2016. +yuraos, 10.09.2015
Функция _ПроверитьНаличиеПолногоДоступаУПользователя(UserName = "", НеУчитыватьSA = Ложь)
	Перем User, ДоступПолный;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ПустаяСтрока(UserName) Тогда
		User = Неопределено;
	Иначе
		User = ПользователиИнформационнойБазы.НайтиПоИмени(UserName); 
	КонецЕсли; 
	
	ДоступПолный	= ПравоДоступа("Администрирование", Метаданные, User) 
					И ПравоДоступа("ОбновлениеКонфигурацииБазыДанных", Метаданные, User) 
					И ПравоДоступа("МонопольныйРежим", Метаданные, User)
					И ПравоДоступа("ИнтерактивноеОткрытиеВнешнихОбработок", Метаданные, User)
					;
					
	Если НеУчитыватьSA <> Истина Тогда
		Если Метаданные.Роли.Найти("SA") <> Неопределено Тогда
			Если User = Неопределено Тогда
				ДоступПолный = ДоступПолный И РольДоступна("SA");
			Иначе
				ДоступПолный = ДоступПолный И User.Роли.Содержит(Метаданные.Роли["SA"]);
			КонецЕсли; 
		КонецЕсли;
	КонецЕсли;
	
	Если Метаданные.Роли.Найти("ПолныеПрава") <> Неопределено Тогда
		Если User = Неопределено Тогда
			ДоступПолный = ДоступПолный И РольДоступна("ПолныеПрава");
		Иначе
			ДоступПолный = ДоступПолный И User.Роли.Содержит(Метаданные.Роли["ПолныеПрава"]);
		КонецЕсли; 
	КонецЕсли;
	
	Возврат ДоступПолный;
	
КонецФункции

// 27.02.2016.
Функция _ПолучитьИмяРегистраДатыЗапретаИзмененийКонфигурации()
	Перем ИмяРегистраДатыЗапрета;
	
	ИмяРегистраДатыЗапрета = Неопределено;
	
	Для Каждого РС Из Метаданные.РегистрыСведений Цикл
		Если Найти(ВРег(РС.Имя),ВРег("Запрет")) > 0 Тогда
			
			Если ((Найти(ВРег(РС.Имя),ВРег("Дат")) > 0) 				
				ИЛИ (Найти(ВРег(РС.Имя),ВРег("Данн")) > 0)) Тогда
				
				Если ((Найти(ВРег(РС.Имя),ВРег("Измен")) > 0) 
					ИЛИ (Найти(ВРег(РС.Имя),ВРег("Коррект")) > 0)
					ИЛИ (Найти(ВРег(РС.Имя),ВРег("Редакт")) > 0)) Тогда
					
						ИмяРегистраДатыЗапрета = РС.Имя;
						Прервать;
						
					КонецЕсли;
					
				КонецЕсли;
				
		КонецЕсли;
	КонецЦикла;
	
	Возврат ИмяРегистраДатыЗапрета;
	
КонецФункции

// 27.02.2016. Получает номер подредакции конфигурации без номера сборки.
//
// Параметры:
//  Версия - Строка - версия конфигурации в формате РР.ПП.ЗЗ.СС,
//                    где СС - номер сборки, который будет удален.
// 
//  Возвращаемое значение:
//  Строка - номер версии конфигурации без номера сборки в формате РР.ПП.ЗЗ.
//
Функция _ВерсияСокращенно(Знач Версия) Экспорт
	Перем Массив, Результат;
	
	Массив = РазложитьСтрокуВМассивПодстрок(Версия, ".");
	
	Если Массив.Количество() < 2 Тогда
		Возврат Версия;
	КонецЕсли;
	
	Результат = "[Редакция].[Подредакция]";
	Результат = СтрЗаменить(Результат, "[Редакция]",    Массив[0]);
	Результат = СтрЗаменить(Результат, "[Подредакция]", Массив[1]);
	
	Возврат Результат;
КонецФункции

// 27.02.2016. Получает номер версии конфигурации без номера сборки.
//
// Параметры:
//  Версия - Строка - версия конфигурации в формате РР.ПП.ЗЗ.СС,
//                    где СС - номер сборки, который будет удален.
// 
//  Возвращаемое значение:
//  Строка - номер версии конфигурации без номера сборки в формате РР.ПП.ЗЗ.
//
Функция _ВерсияБезНомераСборки(Знач Версия) Экспорт
	Перем Массив, Результат;
	
	Массив = РазложитьСтрокуВМассивПодстрок(Версия, ".");
	
	Если Массив.Количество() < 3 Тогда
		Возврат Версия;
	КонецЕсли;
	
	Результат = "[Редакция].[Подредакция].[Релиз]";
	Результат = СтрЗаменить(Результат, "[Редакция]",    Массив[0]);
	Результат = СтрЗаменить(Результат, "[Подредакция]", Массив[1]);
	Результат = СтрЗаменить(Результат, "[Релиз]",       Массив[2]);
	
	Возврат Результат;
КонецФункции

// 27.02.2016. Сравнить две строки версий.
//
// Параметры:
//  СтрокаВерсии1  - Строка - номер версии в формате РР.{П|ПП}.ЗЗ.СС.
//  СтрокаВерсии2  - Строка - второй сравниваемый номер версии.
//
// Возвращаемое значение:
//   Число   - больше 0, если СтрокаВерсии1 > СтрокаВерсии2; 0, если версии равны.
//
Функция СравнитьВерсии(Знач СтрокаВерсии1, Знач СтрокаВерсии2) Экспорт
	Перем Результат;
	
	Строка1 = ?(ПустаяСтрока(СтрокаВерсии1), "0.0.0.0", СтрокаВерсии1);
	Строка2 = ?(ПустаяСтрока(СтрокаВерсии2), "0.0.0.0", СтрокаВерсии2);
	Версия1 = РазложитьСтрокуВМассивПодстрок(Строка1, ".");
	Если Версия1.Количество() <> 4 Тогда
		ВызватьИсключение ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Неправильный формат параметра СтрокаВерсии1: %1'"), СтрокаВерсии1);
	КонецЕсли;
	Версия2 = РазложитьСтрокуВМассивПодстрок(Строка2, ".");
	Если Версия2.Количество() <> 4 Тогда
		ВызватьИсключение ПодставитьПараметрыВСтроку(
	    	НСтр("ru = 'Неправильный формат параметра СтрокаВерсии2: %1'"), СтрокаВерсии2);
	КонецЕсли;
	
	Результат = 0;
	Для Разряд = 0 По 3 Цикл
		Результат = Число(Версия1[Разряд]) - Число(Версия2[Разряд]);
		Если Результат <> 0 Тогда
			Возврат Результат;
		КонецЕсли;
	КонецЦикла;
	Возврат Результат;
	
КонецФункции

// 27.02.2016. Сравнить две строки версий.
//
// Параметры:
//  СтрокаВерсии1  - Строка - номер версии в формате РР.{П|ПП}.ЗЗ.
//  СтрокаВерсии2  - Строка - второй сравниваемый номер версии.
//
// Возвращаемое значение:
//   Число   - больше 0, если СтрокаВерсии1 > СтрокаВерсии2; 0, если версии равны.
//
Функция СравнитьВерсииБезНомераСборки(Знач СтрокаВерсии1, Знач СтрокаВерсии2) Экспорт
	Перем Результат;
	
	Строка1 = ?(ПустаяСтрока(СтрокаВерсии1), "0.0.0", СтрокаВерсии1);
	Строка2 = ?(ПустаяСтрока(СтрокаВерсии2), "0.0.0", СтрокаВерсии2);
	Версия1 = РазложитьСтрокуВМассивПодстрок(Строка1, ".");
	Если Версия1.Количество() <> 3 Тогда
		ВызватьИсключение ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Неправильный формат параметра СтрокаВерсии1: %1'"), СтрокаВерсии1);
	КонецЕсли;
	Версия2 = РазложитьСтрокуВМассивПодстрок(Строка2, ".");
	Если Версия2.Количество() <> 3 Тогда
		ВызватьИсключение ПодставитьПараметрыВСтроку(
	    	НСтр("ru = 'Неправильный формат параметра СтрокаВерсии2: %1'"), СтрокаВерсии2);
	КонецЕсли;
	
	Результат = 0;
	Для Разряд = 0 По 2 Цикл
		Результат = Число(Версия1[Разряд]) - Число(Версия2[Разряд]);
		Если Результат <> 0 Тогда
			Возврат Результат;
		КонецЕсли;
	КонецЦикла;
	Возврат Результат;
	
КонецФункции

// 27.02.2016.
Функция _ПолучитьИмяФормыОбработки(ИмяОбработки, ИмяФормы)
	Перем ПолноеИмяФормы, Форма;
	
	ПолноеИмяФормы = Неопределено;
	
	Если ТекущийРежимЗапуска() = РежимЗапускаКлиентскогоПриложения.УправляемоеПриложение Тогда
		ПолноеИмяФормы = "ВнешняяОбработка." + ИмяОбработки + ".Форма." + ИмяФормы;
	Иначе
		ПолноеИмяФормы = "Обработка." + ИмяОбработки + ".Форма." + ИмяФормы;
	КонецЕсли;
	
	Если Метаданные().Формы.Найти(ИмяФормы) = Неопределено Тогда
		Сообщить("Форма " + ПолноеИмяФормы + " отсутствует в обработке.");
	КонецЕсли;
	
	Возврат ПолноеИмяФормы;
	
КонецФункции

// 27.02.2016. Для работы с обработкой необходимо: ПравоДоступаАдминистрирование и ПолныеПрава.
//
Функция ОбработкаПроверитьПраваПользователяИРежимЗапуска(Настройки) Экспорт
	Перем РезультатПроверки;
	
	//+yuraos, 10.09.2015
	// - чтобы для юзеров без полных прав не вызывалось исключение,
	// а выдавалось внятное сообщение об отказе в доступе
	УстановитьПривилегированныйРежим(Истина);
	//+yuraos, 10.09.2015

	РезультатПроверки = Новый Структура;
	РезультатПроверки.Вставить("ОписаниеОшибки", "");
	РезультатПроверки.Вставить("Отказ", Ложь);
	
	Если (НЕ (ТекущийРежимЗапуска() = РежимЗапускаКлиентскогоПриложения.УправляемоеПриложение)
		И НЕ (ТекущийРежимЗапуска() = РежимЗапускаКлиентскогоПриложения.ОбычноеПриложение)) Тогда
		
		РезультатПроверки.ОписаниеОшибки = "Текущий режим запуска 1С:Предприятие:
		|
		|""" + ВРег(ТекущийРежимЗапуска()) + """.
		|
		|ВЫПОЛНЕНИЕ ОБРАБОТКИ ПРЕДУСМОТРЕНО В СЛЕДУЮЩИХ РЕЖИМАХ ЗАПУСКА 1С:ПРЕДПРИЯТИЕ:
		|
		|1. ОБЫЧНОЕ ПРИЛОЖЕНИЕ;
		|2. УПРАВЛЯЕМОЕ ПРИЛОЖЕНИЕ.
		|
		|ВОСПОЛЬЗОВАТЬСЯ ОБРАБОТКОЙ НЕВОЗМОЖНО.";
		
		РезультатПроверки.Отказ = Истина;
		
		Возврат РезультатПроверки;
		
	КонецЕсли;
	
	ПользователиИБ = ПользователиИнформационнойБазы.ПолучитьПользователей();
	
	Если НЕ Настройки.ПравоДоступаАдминистрирование И ПользователиИБ.Количество() > 0 Тогда
		
		РезультатПроверки.ОписаниеОшибки = "ОБРАБОТКА: """ + Настройки.СинонимОбработки + """.
		|
		|ПОЛЬЗОВАТЕЛЬ: " + Настройки.ТекущийПользовательИБ + ".
		|
		|Для входа администратору ТРЕБУЕТСЯ ПРАВО: ""Администрирование"".";
		
		РезультатПроверки.Отказ = Истина;
		
		Возврат РезультатПроверки;
		
	КонецЕсли;
	
	Если НЕ Настройки.РольПолныеПраваДоступна И ПользователиИБ.Количество() > 0 Тогда
		
		РезультатПроверки.ОписаниеОшибки = "ОБРАБОТКА: """ + Настройки.СинонимОбработки + """.
		|
		|ПОЛЬЗОВАТЕЛЬ: " + Настройки.ТекущийПользовательИБ + ".
		|
		|Для входа администратору ТРЕБУЕТСЯ РОЛЬ: ""Полные права"".";
		
		РезультатПроверки.Отказ = Истина;
		
		Возврат РезультатПроверки;
		
	КонецЕсли;
	
	//+yuraos, 10.09.2015
	Если НЕ Настройки.ПолныйДоступ И ПользователиИБ.Количество() > 0 Тогда
		
		РезультатПроверки.ОписаниеОшибки = "ОБРАБОТКА: """ + Настройки.СинонимОбработки + """.
		|
		|ПОЛЬЗОВАТЕЛЬ: " + Настройки.ТекущийПользовательИБ + ".
		|
		|Для входа администратору ТРЕБУЕТСЯ РОЛЬ: ""Super-Administrator"" (SA).";
		
		РезультатПроверки.Отказ = Истина;
		
		Возврат РезультатПроверки;
		
	КонецЕсли;
	//+yuraos, 10.09.2015

	//Если ((ТекущийРежимЗапуска() = РежимЗапускаКлиентскогоПриложения.УправляемоеПриложение)
	//	И (Настройки.ТекущийРежимЗапускаКлиента = "Толстый клиент")) Тогда
	//	
	//	РезультатПроверки.ОписаниеОшибки = "Текущий режим запуска 1С:Предприятие:
	//	|
	//	|""УПРАВЛЯЕМОЕ ПРИЛОЖЕНИЕ (ТОЛСТЫЙ КЛИЕНТ)"".
	//	|
	//	|Некоторые действия могут завершаться с ошибкой.
	//	|
	//	|ЗАПУСТИТЕ ПРИЛОЖЕНИЕ В РЕЖИМЕ ТОНКОГО КЛИЕНТА.";
	//	
	//	РезультатПроверки.Отказ = Ложь;
	//	
	//	Возврат РезультатПроверки;
	//	
	//КонецЕсли;
	
	Возврат РезультатПроверки;
	
КонецФункции

// 27.02.2016. Форма Режим запуска 1С:Предприятие.
//
Функция ОбработкаПолучитьТонкийТолстый()
	
	//+yuraos, 10.09.2015
	// - чтобы для юзеров без полных прав не вызывалось исключение
	УстановитьПривилегированныйРежим(Истина);
	//+yuraos, 10.09.2015
		
    ТонкийТолстый = "";
	
	МассивСоединений = ПолучитьСоединенияИнформационнойБазы();
	Для Каждого ТекСоединение ИЗ МассивСоединений Цикл
		Если ТекСоединение.Пользователь.Имя = ПользователиИнформационнойБазы.ТекущийПользователь().Имя Тогда
			Если ((ТекСоединение.ИмяПриложения = "1CV8") 
				ИЛИ (ТекСоединение.ИмяПриложения = "1CV8C")) Тогда		// Режим 1С:Предприятие ТолстыйКлиент или ТонкийКлиент.
				// ~ "ТонкийКлиент"	 = ПредставлениеПриложения("1CV8C")
				// ~ "ТолстыйКлиент" = ПредставлениеПриложения("1CV8")
				ТонкийТолстый = ПредставлениеПриложения(ТекСоединение.ИмяПриложения);
				Прервать;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;	
	
	Возврат ТонкийТолстый;

КонецФункции

// 27.02.2016. Кнопка "Даты Запрета". Вспомогательная.
//
Функция ОбработкаПолучитьИмяРегистраДатыЗапретаИзмененийБД()
	
	ИмяРегистраДатыЗапрета = Неопределено;
	
	Для Каждого РС Из Метаданные.РегистрыСведений Цикл
		Если Найти(ВРег(РС.Имя),ВРег("Запрет")) > 0 Тогда
			
			Если ((Найти(ВРег(РС.Имя),ВРег("Дат")) > 0) 				
				ИЛИ (Найти(ВРег(РС.Имя),ВРег("Данн")) > 0)) Тогда
				
				Если ((Найти(ВРег(РС.Имя),ВРег("Измен")) > 0) 
					ИЛИ (Найти(ВРег(РС.Имя),ВРег("Коррект")) > 0)
					ИЛИ (Найти(ВРег(РС.Имя),ВРег("Редакт")) > 0)) Тогда
					
						ИмяРегистраДатыЗапрета = РС.Имя;
						Прервать;
						
					КонецЕсли;
					
				КонецЕсли;
				
		КонецЕсли;
	КонецЦикла;
	
	Возврат ИмяРегистраДатыЗапрета;
	
КонецФункции

// 27.02.2016.
Функция ОбработкаПолучитьИмяФормы(ИмяФормы)
	Перем ПолноеИмяФормы;
	
	//+yuraos, 10.09.2015
	Если ИмяФормы = "$ОсновнаяФорма$" Тогда
		Если ЭтотОбъект.УправляемаяФорма Тогда
			Если _ЭтоОбработкаКонфигурации(Неопределено) Тогда
				ПолноеИмяФормы = "Обработка.Администратор1С.Форма.Управляемая";
			Иначе
				ПолноеИмяФормы = "ВнешняяОбработка.Администратор1С.Форма.Управляемая";
			КонецЕсли;
		Иначе
			ПолноеИмяФормы = "Обычная";
		КонецЕсли;
		Возврат ПолноеИмяФормы;
	КонецЕсли; 
	//+yuraos, 10.09.2015
	
	ПолноеИмяФормы = Неопределено;
	
	Если _ЭтоОбработкаКонфигурации(Неопределено) Тогда
		Если ЭтотОбъект.УправляемаяФорма Тогда
			ПолноеИмяФормы = "Обработка.Администратор1С.Форма." + ИмяФормы;
		Иначе
			ПолноеИмяФормы = ИмяФормы + "_О";
		КонецЕсли;
	Иначе
		Если ЭтотОбъект.УправляемаяФорма Тогда
			ПолноеИмяФормы = "ВнешняяОбработка.Администратор1С.Форма." + ИмяФормы;
		Иначе
			ПолноеИмяФормы = ИмяФормы + "_О";
		КонецЕсли;
	КонецЕсли;
	
	Возврат ПолноеИмяФормы;
	
КонецФункции

// 27.02.2016.
Функция РазрешитьУстановкуЗначенияОбменДаннымиЗагрузкаИстина(ОбъектДанных, Знач РежимЗаписиОбъектаДокумент = Неопределено)
	
	// Не все объекты имеют свойство "ОбменДанными".
	Если ЕстьРеквизитОбъекта1С("ОбменДанными", ОбъектДанных) И ЭтотОбъект.ОбменДаннымиЗагрузка Тогда	// Проверим наличие реквизита объекта.
		Если РежимЗаписиОбъектаДокумент = Неопределено Тогда
			Возврат Истина;
		Иначе
			Если РежимЗаписиОбъектаДокумент = РежимЗаписиДокумента.Запись Тогда
				Возврат Истина;
			Иначе
				// Документ:Проведение/ОтменаПроведения. Если ОбъектИЗМ.ОбменДанными.Загрузка = Истина, то Ошибка при вызове метода контекста (Записать).
				// Действие не может выполняться в режиме загрузки данных.
				Возврат Ложь;
			КонецЕсли;
		КонецЕсли;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// КНОПКИ ЗАПИСЬ/УДАЛЕНИЕ ОБЪЕКТА.
// 

// Кнопка "СоздатьКопрированием". Только Документ.
//
Функция НовыйОбъектБДСоздатьКопированиемНаСервере(ОбъектБД) Экспорт
	
	РезультатСоздания = Новый Структура;
	РезультатСоздания.Вставить("ОписаниеОшибки", "");
	РезультатСоздания.Вставить("Отказ", Ложь);

	Попытка
		
		мдОбъектаБД = ОбъектБД.Метаданные();
	
		Если ТипОбъектаБД = ИмяТипаСправочники() Тогда	// Заглушка.
			
			РезультатСоздания.Отказ = Истина;
			РезультатСоздания.ОписаниеОшибки = "Объект типа """ + ТипОбъектаБД + "." + мдОбъектаБД.Имя + """ не создан. НЕПРЕДУСМОТРЕНО.";
			
		ИначеЕсли ТипОбъектаБД = ИмяТипаДокументы() Тогда
			
			ОбъектНовый = Документы[мдОбъектаБД.Имя].СоздатьДокумент();
			
			// Реквизиты объектов.
			ЗаполнитьЗначенияСвойств(ОбъектНовый, ОбъектБД);
			
			ОбъектНовый.УстановитьНовыйНомер();
			
			// Установка даты документа в зависимости от Периодичности нумерации и Даты исходного документа.
			ОбъектНовый.Дата = ТекущаяДата();
			ТДокументДата_НАЧ_ПриИзмененииНаСервере(ОбъектБД, ОбъектБД.Дата, ОбъектНовый.Дата);
			
			// ТабличныеЧасти объектов.
			Для Каждого ТЧасть ИЗ мдОбъектаБД.ТабличныеЧасти Цикл
				
				ЗаполнитьТаблицу(ОбъектБД[ТЧасть.Имя], ОбъектНовый[ТЧасть.Имя]);
				
			КонецЦикла;
			
			ОбъектНовый.Дата = ?(ОбъектНовый.Дата > ТекущаяДата(), ТекущаяДата(), ОбъектНовый.Дата);
			
			ОбъектНовый.Записать(РежимЗаписиДокумента.Запись);
			ОбъектНовый.Записать(РежимЗаписиДокумента.ОтменаПроведения);
		
			ОбъектБД = ОбъектНовый.Ссылка;
			
			РезультатСоздания.Отказ = Ложь;
			РезультатСоздания.ОписаниеОшибки = "Объект типа """ + ТипОбъектаБД + "." + мдОбъектаБД.Имя + """ УСПЕШНО СОЗДАН.
			|
			|" + ОбъектБД;
			
			Возврат РезультатСоздания;
			
		ИначеЕсли ТипОбъектаБД = ИмяТипаПланыОбмена() Тогда	// Заглушка.
			
			РезультатСоздания.Отказ = Истина;
			РезультатСоздания.ОписаниеОшибки = "Объект типа """ + ТипОбъектаБД + "." + мдОбъектаБД.Имя + """ не создан. НЕПРЕДУСМОТРЕНО.";
			
		Иначе	// Заглушка.
			
			РезультатСоздания.Отказ = Истина;
			РезультатСоздания.ОписаниеОшибки = "Объект типа """ + ТипОбъектаБД + "." + мдОбъектаБД.Имя + """ не создан. НЕПРЕДУСМОТРЕНО.";
			
		КонецЕсли;
	
	Исключение
		
		РезультатСоздания.Отказ = Истина;
		РезультатСоздания.ОписаниеОшибки = "Объект не создан. ОШИБКА СОЗДАНИЯ.
		|
		|Повторите создание объекта копированием.
		|
		|""Авось кривая выведет."" (народная мудрость)";
		
	КонецПопытки;
	
	Возврат РезультатСоздания;

КонецФункции

// Вспомогательная процедура.
//
Процедура ЗаполнитьТаблицу(ТаблицаИсточник, ТаблицаПриемник)
	
	Для Каждого СтрокаТаблицыИсточник ИЗ ТаблицаИсточник Цикл
		
		ЗаполнитьЗначенияСвойств(ТаблицаПриемник.Добавить(), СтрокаТаблицыИсточник);
		
	КонецЦикла;
	
КонецПроцедуры

// Возможно ли проведение документа.
//
Функция МетаданныеПроведениеДокументаРазрешено(ОбъектБД) Экспорт
	
	Возврат ОбъектБД.Метаданные().Проведение = МетаДанные.СвойстваОбъектов.Проведение.Разрешить;
	
КонецФункции

Функция	МетаданныеСодержатСправочник(ИмяСправочника)
	
	Возврат НЕ Метаданные.Справочники.Найти(ИмяСправочника) = Неопределено;
	
КонецФункции

// Имя реквизита типа "ДокументОснование" может быть другим. Каким ? - ...
//
Функция ОбъектБДПолучитьИмяДокументаОснование(ОбъектБД) Экспорт
	
	Для Каждого ЭлементТР ИЗ ЭтотОбъект.ТРеквизитыОбъекта Цикл
		Если Найти(ЭлементТР.Тип, "Документ.") > 0 Тогда
			Возврат ЭлементТР.Имя;
		КонецЕсли;
	КонецЦикла;
	
	Возврат "";
	
КонецФункции

// Количество возможных движений документа.
//
Функция ПолучитьКоличествоДвиженийДокументаНаСервере(ОбъектБД) Экспорт
	
	Возврат ОбъектБД.Метаданные().Движения.Количество()
	
КонецФункции

// Возвращает Объект типа СправочникОбъект/ДокументОбъект.
//
Функция ОбъектБДПолучитьОбъектИзСсылки(ОбъектБД) Экспорт
	
	ОбъектИЗМ = ОбъектБД.ПолучитьОбъект();
	Если ОбъектИЗМ.Заблокирован() Тогда
		Сообщить("МО: " + "Объект """ + ОбъектИЗМ + """ заблокирован и не может быть обработан.", СтатусСообщения.ОченьВажное);
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат ОбъектИЗМ;
	
КонецФункции

// ОБЩАЯ ДЛЯ ТРеквизитыОбъекта, ТЧастей, ЗаписьОбъекта.
//
Функция ОбъектБДПроверитьВозможностьРедактированияЗаписиЗначения(ОбъектБД, ИмяТаблицы, ИмяРеквизитаИзменяемогоЗначения, ТипИзменяемогоЗначения, ИзменяемоеЗначение, ПроверятьРеквизитСНеопределеннымТипом) Экспорт
	
	ТипОбъектаБД 	= ОбъектБДПолучитьТипОбъекта(ОбъектБД);
	мдОбъектаБД		= ОбъектБД.Метаданные();
	
	РезультатПроверки = Новый Структура;
	РезультатПроверки.Вставить("ОписаниеОшибки", "");
	РезультатПроверки.Вставить("Отказ", Ложь);
	
	Если (ТипИзменяемогоЗначения = Тип("Неопределено")) Тогда
	
		Если ПроверятьРеквизитСНеопределеннымТипом И НЕ ЕстьРеквизитОбъекта1С(ИмяРеквизитаИзменяемогоЗначения, ОбъектБД) Тогда
			РезультатПроверки = Новый Структура;
			РезультатПроверки.Вставить("ОписаниеОшибки", ИмяТаблицы + ": Поле объекта """ + ИмяРеквизитаИзменяемогоЗначения + """ отсутствует => недоступно для корректировки/записи.");
			РезультатПроверки.Вставить("Отказ", Истина);
			Возврат РезультатПроверки;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ТипИзменяемогоЗначения = Тип("ХранилищеЗначения") Тогда	// ХранилищеЗначения может быть только единственным типом в данных.
		РезультатПроверки = Новый Структура;
		РезультатПроверки.Вставить("ОписаниеОшибки", ИмяТаблицы + ": Поле Объекта: """ + ИмяРеквизитаИзменяемогоЗначения + """ типа ""ХранилищеЗначения"" недоступно для корректировки/записи.");
		РезультатПроверки.Вставить("Отказ", Истина);
		Возврат РезультатПроверки;
	КонецЕсли;
	
	//Если ТипИзменяемогоЗначения = Тип("УникальныйИдентификатор") Тогда	// УникальныйИдентификатор не имеет поля редактирования.
	//	РезультатПроверки = Новый Структура;
	//	РезультатПроверки.Вставить("ОписаниеОшибки", ИмяТаблицы + ": Поле Объекта: """ + ИмяРеквизитаИзменяемогоЗначения + """ типа ""УникальныйИдентификатор"" недоступно для корректировки/записи.");
	//	РезультатПроверки.Вставить("Отказ", Истина);
	//	Возврат РезультатПроверки;
	//КонецЕсли;
	
	Если ТипОбъектаБД = ИмяТипаСправочники() ИЛИ ТипОбъектаБД = ИмяТипаПланыВидовХарактеристик() Тогда
		Если ТипИзменяемогоЗначения = Тип("Булево") Тогда
			Если мдОбъектаБД.Иерархический И ИмяРеквизитаИзменяемогоЗначения = "ЭтоГруппа" Тогда	// У Справочника ИЛИ ПВХ это Стандартный реквизит типа "Булево".
				РезультатПроверки = Новый Структура;
				РезультатПроверки.Вставить("ОписаниеОшибки", ИмяТаблицы + ": Поле объекта """ + ИмяРеквизитаИзменяемогоЗначения + """ (признак группы) Справочника/ПВХ недоступно для корректировки/записи.");
				РезультатПроверки.Вставить("Отказ", Истина);
				Возврат РезультатПроверки;
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли ТипОбъектаБД = ИмяТипаПланыОбмена() Тогда
		Если ИмяРеквизитаИзменяемогоЗначения = "ОбъектБД" ИЛИ ИмяРеквизитаИзменяемогоЗначения = "НомерОтправленного" ИЛИ ИмяРеквизитаИзменяемогоЗначения = "НомерПринятого" Тогда
			Если мдОбъектаБД.РаспределеннаяИнформационнаяБаза Тогда
				ЭтотУзелПланаОбмена = ПланыОбмена[мдОбъектаБД.Имя].ЭтотУзел();
				БДвРИБ = "";
				Если ПланыОбмена.ГлавныйУзел() = Неопределено Тогда		// ГлавныйУзел Распределеной БД. Для ГлавногоУзла на ГлавномУзле: ПланыОбмена.ГлавныйУзел() = Неопределено.
					Если ЭтотУзелПланаОбмена = ОбъектБД Тогда			// Для ПланаОбмена такой Объект считается ПРЕДОПРЕДЕЛЕННЫМ.
						хУзел = "ЦЕНТРАЛЬНОМ";
						БДвРИБ = ОбъектБДПолучитьПоложениеБДвРИБ(ОбъектБД);
					КонецЕсли;
				Иначе													// ПодчиненныйУзел Распределеной БД.
					Если ЭтотУзелПланаОбмена = ОбъектБД Тогда			// Для ПланаОбмена такой Объект считается ПРЕДОПРЕДЕЛЕННЫМ.
						хУзел = "ПОДЧИНЕННОМ";
						БДвРИБ = ОбъектБДПолучитьПоложениеБДвРИБ(ОбъектБД);
					КонецЕсли;
				КонецЕсли;
				Если НЕ БДвРИБ = "" Тогда
					РезультатПроверки = Новый Структура;
					РезультатПроверки.Вставить("ОписаниеОшибки", ИмяТаблицы + ": Поле объекта """ + ИмяРеквизитаИзменяемогоЗначения + """ недоступно для корректировки/записи.
					|Предопределенный (с точки зрения механизма обмена) ПланОбмена """ + мдОбъектаБД.Имя + "." + ОбъектБД + """
					//|(" + БДвРИБ + ": Узел """ + ЭтотУзелПланаОбмена + """ Распределенной БД).
					|Свойство не может быть изменено для предопределенного узла.");
					РезультатПроверки.Вставить("Отказ", Истина);
					Возврат РезультатПроверки;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли ТипОбъектаБД = ИмяТипаПланыСчетов() Тогда
		Если ИмяРеквизитаИзменяемогоЗначения = "Предопределенное" Тогда	// У ПланаСчетов в ТЧ ВидыСубконто.
			РезультатПроверки = Новый Структура;
			РезультатПроверки.Вставить("ОписаниеОшибки", ИмяТаблицы + ": Поле объекта """ + ИмяРеквизитаИзменяемогоЗначения + """ (признак предопределенный) ПланаСчетов недоступно для корректировки/записи.");
			РезультатПроверки.Вставить("Отказ", Истина);
			Возврат РезультатПроверки;
		КонецЕсли;
		Если ОбъектБД.Предопределенный Тогда
			Если ИмяРеквизитаИзменяемогоЗначения = "Вид" ИЛИ ИмяРеквизитаИзменяемогоЗначения = "Забалансовый"  ИЛИ ИмяРеквизитаИзменяемогоЗначения = "Валютный" ИЛИ ИмяРеквизитаИзменяемогоЗначения = "Количественный" Тогда	// У ПлатаСчетов в таблице Реквизиты.
				РезультатПроверки = Новый Структура;
				РезультатПроверки.Вставить("ОписаниеОшибки", ИмяТаблицы + ": Поле объекта """ + ИмяРеквизитаИзменяемогоЗначения + """ предопределенного Счета ПланаСчетов недоступно для корректировки/записи.");
				РезультатПроверки.Вставить("Отказ", Истина);
				Возврат РезультатПроверки;
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли ТипОбъектаБД = ИмяТипаПланыВидовРасчета() Тогда
		Если ИмяРеквизитаИзменяемогоЗначения = "Предопределенный" Тогда	// У ПланаВидовРасчета в ТЧ.
			РезультатПроверки = Новый Структура;
			РезультатПроверки.Вставить("ОписаниеОшибки", ИмяТаблицы + ": Поле объекта """ + ИмяРеквизитаИзменяемогоЗначения + """ (признак предопределенный) ПланаВидовРасчета недоступно для корректировки/записи.");
			РезультатПроверки.Вставить("Отказ", Истина);
			Возврат РезультатПроверки;
		КонецЕсли;
	КонецЕсли;
	
	Возврат РезультатПроверки;
	
КонецФункции

// Фактическая запись данных после изменения в Форме.
//
Процедура ОбъектБДЗаписатьНаСервере(ОбъектБД, Форма, Отказ, РежимЗаписи = Неопределено) Экспорт
	Перем ТипЗначения, ТипЗначенияХрЗн;
	
	УстановитьПривилегированныйРежим(Истина);
	
	ОбъектИЗМ	= ОбъектБДПолучитьОбъектИзСсылки(ОбъектБД);
	мдОбъектаБД = ОбъектИЗМ.Метаданные();
	ТипОбъектаБД= ИмяБазовогоТипаПоОбъектуМетаданных(мдОбъектаБД);

	Если ОбъектИЗМ = Неопределено Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ЕстьОшибки = Ложь;
	ПерваяОшибка = Неопределено;
	
	// Заполним реквизиты объекта из Таблицы Реквизиты
	Для Каждого Реквизит ИЗ ТРеквизитыОбъекта Цикл
		
		Попытка
			
			ИмяТаблицы = "Таблица ""Реквизиты""";	// см. проверку ХранилищеЗначения.
			ТипЗначения = ТипЗнч(Реквизит.Значение);
			Если ТипЗначения = Тип("Строка") И Реквизит.Значение = "ХранилищеЗначения" Тогда	// ХранилищеЗначения может быть только единственным типом в данных.
				Если ЕстьРеквизитОбъекта1С(Реквизит.Имя, ОбъектБД) Тогда
					ТипЗначенияХрЗн = мдОбъектаБД.Реквизиты[Реквизит.Имя].Тип.Типы()[0];
					ТипЗначения = ?(ТипЗначенияХрЗн = Тип("ХранилищеЗначения"), ТипЗначенияХрЗн, ТипЗначения);
				КонецЕсли;
			КонецЕсли;
			
			РезультатПроверки = ОбъектБДПроверитьВозможностьРедактированияЗаписиЗначения(ОбъектБД, ИмяТаблицы, Реквизит.Имя, ТипЗначения, Реквизит.Значение, Истина);
			
			Если НЕ РезультатПроверки.Отказ Тогда
				ОбъектИЗМ[Реквизит.Имя] = Реквизит.Значение;
			Иначе
				Если ПоказыватьСообщения Тогда
					Если ПерваяОшибка = Неопределено Тогда
						ПерваяОшибка = 1;
						Сообщить(СтрокаРавно);
					КонецЕсли;
					Сообщить("МО: " + РезультатПроверки.ОписаниеОшибки, СтатусСообщения.Важное);
				КонецЕсли;
			КонецЕсли;
			
		Исключение
			
			ЕстьОшибки = Истина;
			Если ПерваяОшибка = Неопределено Тогда
				ПерваяОшибка = 1;
				Сообщить(СтрокаРавно);
			КонецЕсли;
			Сообщить("МО: " + "Не удалось установить значение реквизита """ + Реквизит.Имя + """: " + ОписаниеОшибки(), СтатусСообщения.Важное);
			
		КонецПопытки;
		
	КонецЦикла;
	
	// Заполним ТЧ из Таблиц на форме.
	Для Каждого мдТЧ ИЗ мдОбъектаБД.ТабличныеЧасти Цикл
		Попытка
			Если ТекущийРежимЗапуска() = РежимЗапускаКлиентскогоПриложения.УправляемоеПриложение Тогда
				тчОбъектаФ = Форма[ФормаПолучитьИмяРеквизитаТабличнаяЧасть(мдТЧ.Имя)];
			Иначе
				тчОбъектаФ = Форма.ЭлементыФормы[ФормаПолучитьИмяРеквизитаТабличнаяЧасть(мдТЧ.Имя)].Значение;
			КонецЕсли;
		Исключение
			Если ПоказыватьСообщения Тогда
				Сообщить(СтрокаРавно);
				Сообщить("МО: " + "Невозможно получить данные ТабличнойЧасти: """ + мдТЧ.Имя + """ из элемента Формы: " + ФормаПолучитьИмяРеквизитаТабличнаяЧасть(мдТЧ.Имя) + ?(ЭтотОбъект.СкрыватьПустыеТабличныеЧасти, ", возможно табличная часть скрыта, т.к. пустая", ""), СтатусСообщения.ОченьВажное);
				Если ТипОбъектаБД = ИмяТипаСправочники() ИЛИ ТипОбъектаБД = ИмяТипаПланыВидовХарактеристик() Тогда
					Если (мдТЧ.Использование = Метаданные.СвойстваОбъектов.ИспользованиеРеквизита.ДляГруппы И НЕ ОбъектБД.ЭтоГруппа)
						ИЛИ (мдТЧ.Использование = Метаданные.СвойстваОбъектов.ИспользованиеРеквизита.ДляЭлемента И ОбъектБД.ЭтоГруппа) Тогда
						ГруппаИлиЭлемент = ?(ОбъектБД.ЭтоГруппа, "Группа", "Элемент");
						Сообщить("МО: " + "ТабличнаяЧасть: """ + мдТЧ.Имя + """ не соответствует отбору: Объект """ + ОбъектБД + """ это """ + ГруппаИлиЭлемент + """, а ТабличнаяЧасть используется """ + мдТЧ.Использование + """.", СтатусСообщения.Важное);
						Сообщить("МО: " + "ЭТО ПРАВИЛЬНО. Данная ТабличнаяЧасть не отображается => не редактируется => не сохраняется.");
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			Продолжить;
		КонецПопытки;
		
		тчОбъектаБД = ОбъектИЗМ[мдТЧ.Имя];
		тчОбъектаБД.Очистить();
		Для Каждого СтрокаТЧОбъектаФ ИЗ тчОбъектаФ Цикл
			
			СтрокаТЧОбъектаБД = тчОбъектаБД.Добавить();
			Для Каждого мдКолонкаТЧ ИЗ мдТЧ.Реквизиты Цикл
				
				Попытка
					ИмяТаблицы = "Табличная Часть """ + мдТЧ.Имя + """";
					РезультатПроверки = ОбъектБДПроверитьВозможностьРедактированияЗаписиЗначения(ОбъектБД, ИмяТаблицы, мдКолонкаТЧ.Имя, ТипЗнч(СтрокаТЧОбъектаБД[мдКолонкаТЧ.Имя]), СтрокаТЧОбъектаБД[мдКолонкаТЧ.Имя], Ложь);
			
					Если НЕ РезультатПроверки.Отказ Тогда
						СтрокаТЧОбъектаБД[мдКолонкаТЧ.Имя] = СтрокаТЧОбъектаФ[мдКолонкаТЧ.Имя];
					Иначе
						Если ПоказыватьСообщения Тогда
							Сообщить("МО: № " + Формат(СтрокаТЧОбъектаФ.НомерСтроки, "ЧЦ=6; ЧВН=") + ". " + РезультатПроверки.ОписаниеОшибки, СтатусСообщения.Важное);
						КонецЕсли;
					КонецЕсли;
				Исключение
					ЕстьОшибки = Истина;
					Если ПерваяОшибка = Неопределено Тогда
						ПерваяОшибка = 1;
						Сообщить(СтрокаРавно);
					КонецЕсли;
					Сообщить("МО: " + "Не удалось установить значение реквизита """ + мдКолонкаТЧ.Имя + """: " + ОписаниеОшибки(), СтатусСообщения.Важное);
				КонецПопытки;
				
			КонецЦикла;
			
		КонецЦикла;
	КонецЦикла;
	
	Если ТипОбъектаБД = ИмяТипаПланыСчетов() ИЛИ ТипОбъектаБД = ИмяТипаПланыВидовРасчета() Тогда
		ОбъектБДЗаписатьСтандартнуюТабличнуюЧатьНаСервере(ОбъектИЗМ, Форма, Отказ, ЕстьОшибки, ПерваяОшибка);
	КонецЕсли;
	
	Если ЕстьОшибки Тогда
		
		Отказ = Истина;
		
		Сообщить(СтрокаРавно);
		Если РежимЗаписи = Неопределено Тогда
			Сообщить("МО: " + "При сохранении объекта произошли ошибки. Объект: """ + ОбъектИЗМ + """ не записан.", СтатусСообщения.ОченьВажное);
			Сообщить("МО: " + "Измените ошибочные данные и повторите запись Объекта " + ОбъектИЗМ + ".", СтатусСообщения.Внимание);
		ИначеЕсли РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
			Сообщить("МО: " + "При сохранении объекта произошли ошибки. Документ: """ + ОбъектИЗМ + """ не проведен.", СтатусСообщения.ОченьВажное);
			Сообщить("МО: " + "Измените ошибочные данные и повторите проведение Документа " + ОбъектИЗМ + ".", СтатусСообщения.Внимание);
		ИначеЕсли РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
			Сообщить("МО: " + "При сохранении объекта произошли ошибки. Объект: """ + ОбъектИЗМ + """ отмена проведения не произведена.", СтатусСообщения.ОченьВажное);
			Сообщить("МО: " + "Измените ошибочные данные и повторите отмену проведения Документа """ + ОбъектИЗМ + """.", СтатусСообщения.Внимание);
		КонецЕсли;
		
		Возврат;
		
	КонецЕсли;
	
	Если РазрешитьУстановкуЗначенияОбменДаннымиЗагрузкаИстина(ОбъектИЗМ, РежимЗаписи) Тогда
		ОбъектИЗМ.ОбменДанными.Загрузка = Истина;	// Не все объекты имеют свойство "ОбменДанными".
	КонецЕсли;
		
	Попытка
		
		Если Документы.ТипВсеСсылки().СодержитТип(ТипЗнч(ОбъектБД)) Тогда
			ОбъектИЗМ.Записать(?(РежимЗаписи = Неопределено, РежимЗаписиДокумента.Запись, РежимЗаписи));
		Иначе
			ОбъектИЗМ.Записать();
		КонецЕсли;
		
	Исключение
		
		Отказ = Истина;
		Сообщить("МО: " + ОписаниеОшибки(), СтатусСообщения.ОченьВажное);
		Сообщить("МО: " + "Возможно объект не подлежит записи, например в МодулеОбъекта конфигурации в Процедуре ""ПередЗаписью"" написано: Отказ = Истина
		|см. также даты запрета изменения данных.", СтатусСообщения.ОченьВажное);
		
	КонецПопытки;
	
	Возврат;
	
КонецПроцедуры

Процедура ОбъектБДЗаписатьСтандартнуюТабличнуюЧатьНаСервере(ОбъектИЗМ, Форма, Отказ, ЕстьОшибки, ПерваяОшибка)
	
	мдОбъектаБД = ОбъектИЗМ.Метаданные();
	ТипОбъектаБД= ИмяБазовогоТипаПоОбъектуМетаданных(мдОбъектаБД);
	
	// Заполним ТЧ из Таблиц на форме.
	Для Каждого мдТЧ ИЗ мдОбъектаБД.СтандартныеТабличныеЧасти Цикл
		Попытка
			Если ТекущийРежимЗапуска() = РежимЗапускаКлиентскогоПриложения.УправляемоеПриложение Тогда
				тчОбъектаФ = Форма[ФормаПолучитьИмяРеквизитаТабличнаяЧасть(мдТЧ.Имя)];
			Иначе
				тчОбъектаФ = Форма.ЭлементыФормы[ФормаПолучитьИмяРеквизитаТабличнаяЧасть(мдТЧ.Имя)].Значение;
			КонецЕсли;
		Исключение
			Если ПоказыватьСообщения Тогда
				Сообщить(СтрокаРавно);
				Сообщить("МО: " + "Невозможно получить данные ТабличнойЧасти: """ + мдТЧ.Имя + """ из элемента Формы: " + ФормаПолучитьИмяРеквизитаТабличнаяЧасть(мдТЧ.Имя), СтатусСообщения.ОченьВажное);
			КонецЕсли;
			Продолжить;
		КонецПопытки;
		
		тчОбъектаБД = ОбъектИЗМ[мдТЧ.Имя];
		
		ИмяРеквизита = Неопределено;
		Если ТипОбъектаБД = ИмяТипаПланыСчетов() Тогда
			ИмяРеквизита = "ВидСубконто";
		ИначеЕсли ТипОбъектаБД = ИмяТипаПланыВидовРасчета() Тогда
			ИмяРеквизита = "ВидРасчета";
		КонецЕсли;
		
		МассивУдаляемыхСтрок = Новый Массив;
		МассивПредопределенныхСубконто = Новый Массив;	// Предопределенные ВидыСубконто должны быть ПЕРВЫМИ и НА СВОИХ МЕСТАХ !!!
		Для Каждого СтрокаТЧ ИЗ тчОбъектаБД Цикл
			Если ТипОбъектаБД = ИмяТипаПланыСчетов() ИЛИ ТипОбъектаБД = ИмяТипаПланыВидовРасчета() Тогда
				Если (ТипОбъектаБД = ИмяТипаПланыСчетов() И СтрокаТЧ.Предопределенное) 
					ИЛИ (ТипОбъектаБД = ИмяТипаПланыВидовРасчета() И СтрокаТЧ.Предопределенный) Тогда
					МассивПредопределенныхСубконто.Добавить(СтрокаТЧ[ИмяРеквизита]);
				Иначе
					МассивУдаляемыхСтрок.Добавить(СтрокаТЧ);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		Для Каждого СтрокаТЧ ИЗ МассивУдаляемыхСтрок Цикл
			тчОбъектаБД.Удалить(СтрокаТЧ);
		КонецЦикла;
		
		Для Каждого СтрокаТЧОбъектаФ ИЗ тчОбъектаФ Цикл
			Если НЕ МассивПредопределенныхСубконто.Найти(СтрокаТЧОбъектаФ[ИмяРеквизита]) = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			СтрокаТЧТмп = Неопределено;
			Если ТипОбъектаБД = ИмяТипаПланыСчетов() Тогда
				СтрокаТЧТмп = тчОбъектаБД.Найти(СтрокаТЧОбъектаФ.ВидСубконто, "ВидСубконто");
				Если НЕ СтрокаТЧТмп = Неопределено И СтрокаТЧТмп.Предопределенное Тогда
					Продолжить;
				ИначеЕсли НЕ СтрокаТЧТмп = Неопределено И НЕ СтрокаТЧТмп.Предопределенное Тогда
					СтрокаТЧОбъектаБД = СтрокаТЧТмп;
				Иначе
					Если тчОбъектаБД.Количество() < мдОбъектаБД.МаксКоличествоСубконто Тогда
						СтрокаТЧОбъектаБД = тчОбъектаБД.Добавить();
					Иначе
						Сообщить("МО: " + "Невозможно добавить строку ВидаСубконто """ + СтрокаТЧОбъектаФ.ВидСубконто + """, т.к. будет превышено максимальное количество " + мдОбъектаБД.МаксКоличествоСубконто + ".", СтатусСообщения.Важное);
						Продолжить;
					КонецЕсли;
				КонецЕсли;
			ИначеЕсли ТипОбъектаБД = ИмяТипаПланыВидовРасчета() Тогда
				СтрокаТЧТмп = тчОбъектаБД.Найти(СтрокаТЧОбъектаФ.ВидРасчета, "ВидРасчета");
				Если НЕ СтрокаТЧТмп = Неопределено И СтрокаТЧТмп.Предопределенный Тогда
					Продолжить;
				ИначеЕсли НЕ СтрокаТЧТмп = Неопределено И НЕ СтрокаТЧТмп.Предопределенный Тогда
					СтрокаТЧОбъектаБД = СтрокаТЧТмп;
				Иначе
					СтрокаТЧОбъектаБД = тчОбъектаБД.Добавить();
				КонецЕсли;
			КонецЕсли;
			
			Для Каждого мдКолонкаТЧ ИЗ мдТЧ.СтандартныеРеквизиты Цикл
				
				Если мдКолонкаТЧ.Имя = "НомерСтроки" Тогда
					Продолжить;
				КонецЕсли;
				
				Попытка
					ИмяТаблицы = "Табличная Часть """ + мдТЧ.Имя + """";
					РезультатПроверки = ОбъектБДПроверитьВозможностьРедактированияЗаписиЗначения(ОбъектБД, ИмяТаблицы, мдКолонкаТЧ.Имя, ТипЗнч(СтрокаТЧОбъектаБД[мдКолонкаТЧ.Имя]), СтрокаТЧОбъектаБД[мдКолонкаТЧ.Имя], Ложь);
			
					Если НЕ РезультатПроверки.Отказ Тогда
						СтрокаТЧОбъектаБД[мдКолонкаТЧ.Имя] = СтрокаТЧОбъектаФ[мдКолонкаТЧ.Имя];
					Иначе
						Если ПоказыватьСообщения Тогда
							Сообщить("МО: № " + Формат(СтрокаТЧОбъектаФ.НомерСтроки, "ЧЦ=6; ЧВН=") + ". " + РезультатПроверки.ОписаниеОшибки, СтатусСообщения.Важное);
						КонецЕсли;
					КонецЕсли;
				Исключение
					ЕстьОшибки = Истина;
					Если ПерваяОшибка = Неопределено Тогда
						ПерваяОшибка = 1;
						Сообщить(СтрокаРавно);
					КонецЕсли;
					Сообщить("МО: " + "Не удалось установить значение реквизита """ + мдКолонкаТЧ.Имя + """: " + ОписаниеОшибки(), СтатусСообщения.Важное);
				КонецПопытки;
				
			КонецЦикла;
			
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

// Выполнить Пометка на удаления / Снять пометку удаления / Удалить (НЕПОСРЕДСТВЕННО).
//
Процедура ОбъектБДУдалениеНаСервере(ОбъектБД, Отказ, Действие = "ПометкаНаУдаление") Экспорт
	
	ОбъектИЗМ = ОбъектБДПолучитьОбъектИзСсылки(ОбъектБД);
	Если ОбъектИЗМ = Неопределено Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
			
	Если РазрешитьУстановкуЗначенияОбменДаннымиЗагрузкаИстина(ОбъектИЗМ) Тогда
		ОбъектИЗМ.ОбменДанными.Загрузка = Истина;	// Не все объекты имеют свойство "ОбменДанными".
	КонецЕсли;
	
	Попытка
		
		Если Действие = "ПометкаНаУдаление" Тогда
			
			Если ОбъектБД.ПометкаУдаления Тогда
				Если ПоказыватьСообщения Тогда
					Сообщить("МО: " + "Попытка выполнить действие <Пометка на удаление>.
					|""" + ОбъектБД + """ был помечен на удаление ранее. 
					|Действие не выполнено. см. Статус.", СтатусСообщения.Важное);
				КонецЕсли;
				Отказ = Истина;
				Возврат;
			КонецЕсли;
			
			ОбъектИЗМ.УстановитьПометкуУдаления(Истина);
			
		ИначеЕсли Действие = "Удалить" Тогда
			
			ОбъектИЗМ.Удалить();
			
		Иначе	// Снять пометку удаления.
			
			Если НЕ ОбъектБД.ПометкаУдаления Тогда
				Если ПоказыватьСообщения Тогда
					Сообщить("МО: " + "Попытка выполнить действие <Снять пометку на удаление>.
					|""" + ОбъектБД + """ не был помечен на удаление. 
					|Действие не выполнено. см. Статус.", СтатусСообщения.Важное);
				КонецЕсли;
				Отказ = Истина;
				Возврат;
			КонецЕсли;
	
			ОбъектИЗМ.УстановитьПометкуУдаления(Ложь);
			
		КонецЕсли;
		
	Исключение
		
		Отказ = Истина;
		Сообщить("МО: " + ОписаниеОшибки(), СтатусСообщения.ОченьВажное);
		Сообщить("МО: " + "см. также даты запрета изменения данных.", СтатусСообщения.ОченьВажное);
		
	КонецПопытки;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ФОРМИРОВАНИЕ ТАБЛИЦЫ РЕКВИЗИТОВ.
// 

// Вкладка "Свойства Объекта" и др. Сформировать Основные Таблицы выбранного ОбъектаБД.
// - Таблица Реквизитов.
// - Таблицы Табличных частей.
// - Таблицы Регистров Движений Документов.
//
Функция ОбъектБДСформироватьТРеквизиты(ОбъектБД) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ОбъектБД) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ТипОбъектаБД 	= ОбъектБДПолучитьТипОбъекта(ОбъектБД);
	мдОбъектаБД 	= ОбъектБД.Метаданные();

	ТСвойстваОбъекта.Очистить();
	ТРеквизитыОбъекта.Очистить();
	
	СтруктураРеквизиты = Новый Структура;
	СписокРеквизиты = Новый СписокЗначений;
	
	БлокируемыеРеквизиты = ПолучитьБлокируемыеРеквизитыОбъекта1С(ОбъектБД);
	НеРедактируемыеРеквизиты = ПолучитьНередактируемыеРеквизитыОбъекта1С(ОбъектБД);
	
	// Общие реквизиты.
	Для Каждого мдРеквизита ИЗ Метаданные.ОбщиеРеквизиты Цикл
		ЭлементСоставаОР = мдРеквизита.Состав.Найти(мдОбъектаБД);
		Попытка
			ЗначениеОР = ОбъектБД[мдРеквизита.Имя];
		Исключение
			Продолжить;
		КонецПопытки;
		Если ЭлементСоставаОР.Использование = Метаданные.СвойстваОбъектов.ИспользованиеОбщегоРеквизита.Использовать
			ИЛИ (ЭлементСоставаОР.Использование = Метаданные.СвойстваОбъектов.ИспользованиеОбщегоРеквизита.Авто И мдРеквизита.АвтоИспользование = Метаданные.СвойстваОбъектов.АвтоИспользованиеОбщегоРеквизита.Использовать) Тогда
			СтрокаТРеквизиты = ОбъектБДСформироватьТРеквизитыДобавитьСтроку(мдРеквизита, ОбъектБД, мдРеквизита.Имя, мдРеквизита.Представление(), БлокируемыеРеквизиты, НеРедактируемыеРеквизиты, Истина);
			СтруктураРеквизиты.Вставить(СтрокаТРеквизиты.Имя, СтрокаТРеквизиты.ОписаниеТипов);
			СписокРеквизиты.Добавить(СтрокаТРеквизиты.Имя, СтрокаТРеквизиты.Представление);
		КонецЕсли;
	КонецЦикла;
	
	Если ТипОбъектаБД = ИмяТипаСправочники() Тогда
		
		// Свойства Объекта.
		ОбъектБДСформироватьТСвойстваДобавитьСтроку(мдОбъектаБД, ОбъектБД, "Описание", ОбъектБДПолучитьОписаниеОбъекта(ОбъектБД));				// 1-ой строкой !!!
		
		// Стандартные реквизиты.
		Если мдОбъектаБД.Владельцы.Количество() > 0 Тогда
			
			СтрокаТРеквизиты = ОбъектБДСформироватьТРеквизитыДобавитьСтроку(мдОбъектаБД, ОбъектБД, "Владелец", "Владелец", БлокируемыеРеквизиты, НеРедактируемыеРеквизиты, Истина);
			СтруктураРеквизиты.Вставить(СтрокаТРеквизиты.Имя, СтрокаТРеквизиты.ОписаниеТипов);
			СписокРеквизиты.Добавить(СтрокаТРеквизиты.Имя, СтрокаТРеквизиты.Представление);
			
		КонецЕсли;
		
		Если мдОбъектаБД.Иерархический Тогда
			
			СтрокаТРеквизиты = ОбъектБДСформироватьТРеквизитыДобавитьСтроку(мдОбъектаБД, ОбъектБД, "Родитель", "Родитель", БлокируемыеРеквизиты, НеРедактируемыеРеквизиты, Ложь);
			СтруктураРеквизиты.Вставить(СтрокаТРеквизиты.Имя, СтрокаТРеквизиты.ОписаниеТипов);
			СписокРеквизиты.Добавить(СтрокаТРеквизиты.Имя, СтрокаТРеквизиты.Представление);
			
			Если ЕстьРеквизитОбъекта1С("ЭтоГруппа", ОбъектБД) Тогда
				
				СтрокаТРеквизиты = ОбъектБДСформироватьТРеквизитыДобавитьСтроку(мдОбъектаБД, ОбъектБД, "ЭтоГруппа", "ЭтоГруппа", БлокируемыеРеквизиты, НеРедактируемыеРеквизиты, Ложь);
				СтруктураРеквизиты.Вставить(СтрокаТРеквизиты.Имя, СтрокаТРеквизиты.ОписаниеТипов);
				СписокРеквизиты.Добавить(СтрокаТРеквизиты.Имя, СтрокаТРеквизиты.Представление);
				
			КонецЕсли;
			
		КонецЕсли;
		
		СтрокаТРеквизиты = ОбъектБДСформироватьТРеквизитыДобавитьСтроку(мдОбъектаБД, ОбъектБД, "ПометкаУдаления", "Пометка удаления", БлокируемыеРеквизиты, НеРедактируемыеРеквизиты, Истина);
		СтруктураРеквизиты.Вставить(СтрокаТРеквизиты.Имя, СтрокаТРеквизиты.ОписаниеТипов);
		СписокРеквизиты.Добавить(СтрокаТРеквизиты.Имя, СтрокаТРеквизиты.Представление);
			
		Если мдОбъектаБД.ДлинаКода > 0 Тогда
			
			СтрокаТРеквизиты = ОбъектБДСформироватьТРеквизитыДобавитьСтроку(мдОбъектаБД, ОбъектБД, "Код", "Код", БлокируемыеРеквизиты, НеРедактируемыеРеквизиты, Ложь, мдОбъектаБД.ДлинаКода);
			СтруктураРеквизиты.Вставить(СтрокаТРеквизиты.Имя, СтрокаТРеквизиты.ОписаниеТипов);
			СписокРеквизиты.Добавить(СтрокаТРеквизиты.Имя, СтрокаТРеквизиты.Представление);
			
		КонецЕсли;
		
		Если мдОбъектаБД.ДлинаНаименования > 0 Тогда
			
			СтрокаТРеквизиты = ОбъектБДСформироватьТРеквизитыДобавитьСтроку(мдОбъектаБД, ОбъектБД, "Наименование", "Наименование", БлокируемыеРеквизиты, НеРедактируемыеРеквизиты, Ложь, мдОбъектаБД.ДлинаНаименования);
			СтруктураРеквизиты.Вставить(СтрокаТРеквизиты.Имя, СтрокаТРеквизиты.ОписаниеТипов);
			СписокРеквизиты.Добавить(СтрокаТРеквизиты.Имя, СтрокаТРеквизиты.Представление);
			
		КонецЕсли;
		
		// Реквизиты.
		Для Каждого Реквизит ИЗ мдОбъектаБД.Реквизиты Цикл
			
			Если (Реквизит.Использование = Метаданные.СвойстваОбъектов.ИспользованиеРеквизита.ДляГруппы И ОбъектБД.ЭтоГруппа)
				ИЛИ (Реквизит.Использование = Метаданные.СвойстваОбъектов.ИспользованиеРеквизита.ДляЭлемента И НЕ ОбъектБД.ЭтоГруппа)
				ИЛИ (Реквизит.Использование = Метаданные.СвойстваОбъектов.ИспользованиеРеквизита.ДляГруппыИЭлемента) Тогда
				
				СтрокаТРеквизиты = ОбъектБДСформироватьТРеквизитыДобавитьСтроку(мдОбъектаБД, ОбъектБД, Реквизит.Имя, Реквизит.Представление(), БлокируемыеРеквизиты, НеРедактируемыеРеквизиты, Истина);
				СтруктураРеквизиты.Вставить(СтрокаТРеквизиты.Имя, СтрокаТРеквизиты.ОписаниеТипов);
				СписокРеквизиты.Добавить(СтрокаТРеквизиты.Имя, СтрокаТРеквизиты.Представление);
				
			Иначе
				
				СтрокаТРеквизиты = ОбъектБДСформироватьТРеквизитыДобавитьСтроку(мдОбъектаБД, ОбъектБД, Реквизит.Имя, Реквизит.Представление(), БлокируемыеРеквизиты, НеРедактируемыеРеквизиты, Истина);
				СтруктураРеквизиты.Вставить(СтрокаТРеквизиты.Имя, СтрокаТРеквизиты.ОписаниеТипов);
				СписокРеквизиты.Добавить(СтрокаТРеквизиты.Имя, СтрокаТРеквизиты.Представление);
				
				ТРеквизитыОбъекта.Удалить(СтрокаТРеквизиты);
				
				Если ПоказыватьСообщения Тогда
					ГруппаИлиЭлемент = ?(ОбъектБД.ЭтоГруппа, "Группа", "Элемент");
					Сообщить("МО: " + "Реквизит: """ + Реквизит.Имя + """ не включен в редактирование, т.к. не соответствует отбору: Реквизит - это """ + ГруппаИлиЭлемент + """, а Реквизит используется для: """ + Реквизит.Использование + """.", СтатусСообщения.Внимание);
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
	ИначеЕсли ТипОбъектаБД = ИмяТипаДокументы() Тогда
		
		// Свойства Объекта.
		ОбъектБДСформироватьТСвойстваДобавитьСтроку(мдОбъектаБД, ОбъектБД, "Описание", ОбъектБДПолучитьОписаниеОбъекта(ОбъектБД));				// 1-ой строкой !!!
		ОбъектБДСформироватьТСвойстваДобавитьСтроку(мдОбъектаБД, ОбъектБД, "Последовательности", ОбъектБДПолучитьПоследовательностиДокумента(ОбъектБД));
		
		// Стандартные реквизиты.
		СтрокаТРеквизиты = ОбъектБДСформироватьТРеквизитыДобавитьСтроку(мдОбъектаБД, ОбъектБД, "Номер", "Номер", БлокируемыеРеквизиты, НеРедактируемыеРеквизиты, Ложь, мдОбъектаБД.ДлинаНомера);
		СтруктураРеквизиты.Вставить(СтрокаТРеквизиты.Имя, СтрокаТРеквизиты.ОписаниеТипов);
		СписокРеквизиты.Добавить(СтрокаТРеквизиты.Имя, СтрокаТРеквизиты.Представление);
		
		СтрокаТРеквизиты = ОбъектБДСформироватьТРеквизитыДобавитьСтроку(мдОбъектаБД, ОбъектБД, "Дата", "Дата", БлокируемыеРеквизиты, НеРедактируемыеРеквизиты, Ложь);
		СтруктураРеквизиты.Вставить(СтрокаТРеквизиты.Имя, СтрокаТРеквизиты.ОписаниеТипов);
		СписокРеквизиты.Добавить(СтрокаТРеквизиты.Имя, СтрокаТРеквизиты.Представление);
		
		// Реквизиты.
		Для Каждого Реквизит ИЗ мдОбъектаБД.Реквизиты Цикл
			
			СтрокаТРеквизиты = ОбъектБДСформироватьТРеквизитыДобавитьСтроку(мдОбъектаБД, ОбъектБД, Реквизит.Имя, Реквизит.Представление(), БлокируемыеРеквизиты, НеРедактируемыеРеквизиты, Истина);
			СтруктураРеквизиты.Вставить(СтрокаТРеквизиты.Имя, СтрокаТРеквизиты.ОписаниеТипов);
			СписокРеквизиты.Добавить(СтрокаТРеквизиты.Имя, СтрокаТРеквизиты.Представление);
			
		КонецЦикла;
		
	ИначеЕсли ТипОбъектаБД = ИмяТипаПланыОбмена() Тогда
		
		// Свойства Объекта.
		БДвРИБ = ОбъектБДПолучитьПоложениеБДвРИБ(ОбъектБД);
		
		ОбъектБДСформироватьТСвойстваДобавитьСтроку(мдОбъектаБД, ОбъектБД, "Описание"	, ОбъектБДПолучитьОписаниеОбъекта(ОбъектБД));			// 1-ой строкой !!!
		Если мдОбъектаБД.РаспределеннаяИнформационнаяБаза Тогда
			ОбъектБДСформироватьТСвойстваДобавитьСтроку(мдОбъектаБД, ОбъектБД, "УзелРИБ"	, БДвРИБ + ": " + ?(ОбъектБДПроверитьЭтоГлавныйУзелПланаОбмена(ОбъектБД), "ГлавныйУзел", "ПодчиненныйУзел"));
		Иначе
			ОбъектБДСформироватьТСвойстваДобавитьСтроку(мдОбъектаБД, ОбъектБД, "УзелРИБ"	, "");
		КонецЕсли;
		ОбъектБДСформироватьТСвойстваДобавитьСтроку(мдОбъектаБД, ОбъектБД, "Состав"		, ОбъектБДПолучитьСоставПланаОбмена(ОбъектБД));
		
		// Стандартные реквизиты.
		Если мдОбъектаБД.ДлинаКода > 0 Тогда
			
			СтрокаТРеквизиты = ОбъектБДСформироватьТРеквизитыДобавитьСтроку(мдОбъектаБД, ОбъектБД, "Код", "Код", БлокируемыеРеквизиты, НеРедактируемыеРеквизиты, Ложь, мдОбъектаБД.ДлинаКода);
			СтруктураРеквизиты.Вставить(СтрокаТРеквизиты.Имя, СтрокаТРеквизиты.ОписаниеТипов);
			СписокРеквизиты.Добавить(СтрокаТРеквизиты.Имя, СтрокаТРеквизиты.Представление);
			
		КонецЕсли;
		
		Если мдОбъектаБД.ДлинаНаименования > 0 Тогда
			
			СтрокаТРеквизиты = ОбъектБДСформироватьТРеквизитыДобавитьСтроку(мдОбъектаБД, ОбъектБД, "Наименование", "Наименование", БлокируемыеРеквизиты, НеРедактируемыеРеквизиты, Ложь, мдОбъектаБД.ДлинаНаименования);
			СтруктураРеквизиты.Вставить(СтрокаТРеквизиты.Имя, СтрокаТРеквизиты.ОписаниеТипов);
			СписокРеквизиты.Добавить(СтрокаТРеквизиты.Имя, СтрокаТРеквизиты.Представление);
			
		КонецЕсли;
		
		СтрокаТРеквизиты = ОбъектБДСформироватьТРеквизитыДобавитьСтроку(мдОбъектаБД, ОбъектБД, "НомерПринятого", "Номер принятого", БлокируемыеРеквизиты, НеРедактируемыеРеквизиты, Ложь, мдОбъектаБД.СтандартныеРеквизиты.НомерПринятого.Тип.КвалификаторыЧисла.Разрядность);
		СтруктураРеквизиты.Вставить(СтрокаТРеквизиты.Имя, СтрокаТРеквизиты.ОписаниеТипов);
		СписокРеквизиты.Добавить(СтрокаТРеквизиты.Имя, СтрокаТРеквизиты.Представление);
		
		СтрокаТРеквизиты = ОбъектБДСформироватьТРеквизитыДобавитьСтроку(мдОбъектаБД, ОбъектБД, "НомерОтправленного", "Номер отправленного", БлокируемыеРеквизиты, НеРедактируемыеРеквизиты, Ложь, мдОбъектаБД.СтандартныеРеквизиты.НомерОтправленного.Тип.КвалификаторыЧисла.Разрядность);
		СтруктураРеквизиты.Вставить(СтрокаТРеквизиты.Имя, СтрокаТРеквизиты.ОписаниеТипов);
		СписокРеквизиты.Добавить(СтрокаТРеквизиты.Имя, СтрокаТРеквизиты.Представление);
		
		// Реквизиты.
		Для Каждого Реквизит ИЗ мдОбъектаБД.Реквизиты Цикл
				
			СтрокаТРеквизиты = ОбъектБДСформироватьТРеквизитыДобавитьСтроку(мдОбъектаБД, ОбъектБД, Реквизит.Имя, Реквизит.Представление(), БлокируемыеРеквизиты, НеРедактируемыеРеквизиты, Истина);
			СтруктураРеквизиты.Вставить(СтрокаТРеквизиты.Имя, СтрокаТРеквизиты.ОписаниеТипов);
			СписокРеквизиты.Добавить(СтрокаТРеквизиты.Имя, СтрокаТРеквизиты.Представление);
				
		КонецЦикла;
		
	ИначеЕсли ТипОбъектаБД = ИмяТипаПланыВидовХарактеристик() Тогда
		
		// Свойства Объекта.
		ОбъектБДСформироватьТСвойстваДобавитьСтроку(мдОбъектаБД, ОбъектБД, "Описание", ОбъектБДПолучитьОписаниеОбъекта(ОбъектБД));				// 1-ой строкой !!!
		ОбъектБДСформироватьТСвойстваДобавитьСтроку(мдОбъектаБД, ОбъектБД, "ТипЗначенияХарактеристик", мдОбъектаБД.Тип);
		ОбъектБДСформироватьТСвойстваДобавитьСтроку(мдОбъектаБД, ОбъектБД, "ДополнительныеЗначенияХарактеристик", мдОбъектаБД.ДополнительныеЗначенияХарактеристик);
				
		// Стандартные реквизиты.
		Если мдОбъектаБД.Иерархический Тогда
			
			СтрокаТРеквизиты = ОбъектБДСформироватьТРеквизитыДобавитьСтроку(мдОбъектаБД, ОбъектБД, "Родитель", "Родитель", БлокируемыеРеквизиты, НеРедактируемыеРеквизиты, Ложь);
			СтруктураРеквизиты.Вставить(СтрокаТРеквизиты.Имя, СтрокаТРеквизиты.ОписаниеТипов);
			СписокРеквизиты.Добавить(СтрокаТРеквизиты.Имя, СтрокаТРеквизиты.Представление);
			
			Если ЕстьРеквизитОбъекта1С("ЭтоГруппа", ОбъектБД) Тогда
				
				СтрокаТРеквизиты = ОбъектБДСформироватьТРеквизитыДобавитьСтроку(мдОбъектаБД, ОбъектБД, "ЭтоГруппа", "ЭтоГруппа", БлокируемыеРеквизиты, НеРедактируемыеРеквизиты, Ложь);
				СтруктураРеквизиты.Вставить(СтрокаТРеквизиты.Имя, СтрокаТРеквизиты.ОписаниеТипов);
				СписокРеквизиты.Добавить(СтрокаТРеквизиты.Имя, СтрокаТРеквизиты.Представление);
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если мдОбъектаБД.ДлинаКода > 0 Тогда
			
			СтрокаТРеквизиты = ОбъектБДСформироватьТРеквизитыДобавитьСтроку(мдОбъектаБД, ОбъектБД, "Код", "Код", БлокируемыеРеквизиты, НеРедактируемыеРеквизиты, Ложь, мдОбъектаБД.ДлинаКода);
			СтруктураРеквизиты.Вставить(СтрокаТРеквизиты.Имя, СтрокаТРеквизиты.ОписаниеТипов);
			СписокРеквизиты.Добавить(СтрокаТРеквизиты.Имя, СтрокаТРеквизиты.Представление);
			
		КонецЕсли;
		
		Если мдОбъектаБД.ДлинаНаименования > 0 Тогда
			
			СтрокаТРеквизиты = ОбъектБДСформироватьТРеквизитыДобавитьСтроку(мдОбъектаБД, ОбъектБД, "Наименование", "Наименование", БлокируемыеРеквизиты, НеРедактируемыеРеквизиты, Ложь, мдОбъектаБД.ДлинаНаименования);
			СтруктураРеквизиты.Вставить(СтрокаТРеквизиты.Имя, СтрокаТРеквизиты.ОписаниеТипов);
			СписокРеквизиты.Добавить(СтрокаТРеквизиты.Имя, СтрокаТРеквизиты.Представление);
			
		КонецЕсли;
		
		// Реквизиты.
		Для Каждого Реквизит ИЗ мдОбъектаБД.Реквизиты Цикл
			
			Если (Реквизит.Использование = Метаданные.СвойстваОбъектов.ИспользованиеРеквизита.ДляГруппы И ОбъектБД.ЭтоГруппа)
				ИЛИ (Реквизит.Использование = Метаданные.СвойстваОбъектов.ИспользованиеРеквизита.ДляЭлемента И НЕ ОбъектБД.ЭтоГруппа)
				ИЛИ (Реквизит.Использование = Метаданные.СвойстваОбъектов.ИспользованиеРеквизита.ДляГруппыИЭлемента) Тогда
				
				СтрокаТРеквизиты = ОбъектБДСформироватьТРеквизитыДобавитьСтроку(мдОбъектаБД, ОбъектБД, Реквизит.Имя, Реквизит.Представление(), БлокируемыеРеквизиты, НеРедактируемыеРеквизиты, Истина);
				СтруктураРеквизиты.Вставить(СтрокаТРеквизиты.Имя, СтрокаТРеквизиты.ОписаниеТипов);
				СписокРеквизиты.Добавить(СтрокаТРеквизиты.Имя, СтрокаТРеквизиты.Представление);
				
			Иначе
				
				СтрокаТРеквизиты = ОбъектБДСформироватьТРеквизитыДобавитьСтроку(мдОбъектаБД, ОбъектБД, Реквизит.Имя, Реквизит.Представление(), БлокируемыеРеквизиты, НеРедактируемыеРеквизиты, Истина);
				СтруктураРеквизиты.Вставить(СтрокаТРеквизиты.Имя, СтрокаТРеквизиты.ОписаниеТипов);
				СписокРеквизиты.Добавить(СтрокаТРеквизиты.Имя, СтрокаТРеквизиты.Представление);
				
				ТРеквизитыОбъекта.Удалить(СтрокаТРеквизиты);
				
				Если ПоказыватьСообщения Тогда
					ГруппаИлиЭлемент = ?(ОбъектБД.ЭтоГруппа, "Группа", "Элемент");
					Сообщить("МО: " + "Реквизит: """ + Реквизит.Имя + """ не включен в редактирование, т.к. не соответствует отбору: Реквизит - это """ + ГруппаИлиЭлемент + """, а Реквизит используется для: """ + Реквизит.Использование + """.", СтатусСообщения.Внимание);
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
	ИначеЕсли ТипОбъектаБД = ИмяТипаБизнесПроцессы() Тогда
		
		// Свойства Объекта.
		ОбъектБДСформироватьТСвойстваДобавитьСтроку(мдОбъектаБД, ОбъектБД, "Описание", ОбъектБДПолучитьОписаниеОбъекта(ОбъектБД));				// 1-ой строкой !!!
		
		// Стандартные реквизиты.
		Если мдОбъектаБД.ДлинаНомера > 0 Тогда
			
			СтрокаТРеквизиты = ОбъектБДСформироватьТРеквизитыДобавитьСтроку(мдОбъектаБД, ОбъектБД, "Номер", "Номер", БлокируемыеРеквизиты, НеРедактируемыеРеквизиты, Ложь, мдОбъектаБД.ДлинаНомера);
			СтруктураРеквизиты.Вставить(СтрокаТРеквизиты.Имя, СтрокаТРеквизиты.ОписаниеТипов);
			СписокРеквизиты.Добавить(СтрокаТРеквизиты.Имя, СтрокаТРеквизиты.Представление);
			
		КонецЕсли;
		
		СтрокаТРеквизиты = ОбъектБДСформироватьТРеквизитыДобавитьСтроку(мдОбъектаБД, ОбъектБД, "Дата", "Дата", БлокируемыеРеквизиты, НеРедактируемыеРеквизиты, Ложь);
		СтруктураРеквизиты.Вставить(СтрокаТРеквизиты.Имя, СтрокаТРеквизиты.ОписаниеТипов);
		СписокРеквизиты.Добавить(СтрокаТРеквизиты.Имя, СтрокаТРеквизиты.Представление);
		
		СтрокаТРеквизиты = ОбъектБДСформироватьТРеквизитыДобавитьСтроку(мдОбъектаБД, ОбъектБД, "ВедущаяЗадача", "ВедущаяЗадача", БлокируемыеРеквизиты, НеРедактируемыеРеквизиты, Истина);
		СтруктураРеквизиты.Вставить(СтрокаТРеквизиты.Имя, СтрокаТРеквизиты.ОписаниеТипов);
		СписокРеквизиты.Добавить(СтрокаТРеквизиты.Имя, СтрокаТРеквизиты.Представление);
		
		СтрокаТРеквизиты = ОбъектБДСформироватьТРеквизитыДобавитьСтроку(мдОбъектаБД, ОбъектБД, "Стартован", "Стартован", БлокируемыеРеквизиты, НеРедактируемыеРеквизиты, Ложь);
		СтруктураРеквизиты.Вставить(СтрокаТРеквизиты.Имя, СтрокаТРеквизиты.ОписаниеТипов);
		СписокРеквизиты.Добавить(СтрокаТРеквизиты.Имя, СтрокаТРеквизиты.Представление);
		
		СтрокаТРеквизиты = ОбъектБДСформироватьТРеквизитыДобавитьСтроку(мдОбъектаБД, ОбъектБД, "Завершен", "Завершен", БлокируемыеРеквизиты, НеРедактируемыеРеквизиты, Ложь);
		СтруктураРеквизиты.Вставить(СтрокаТРеквизиты.Имя, СтрокаТРеквизиты.ОписаниеТипов);
		СписокРеквизиты.Добавить(СтрокаТРеквизиты.Имя, СтрокаТРеквизиты.Представление);
		
		// Реквизиты.
		Для Каждого Реквизит ИЗ мдОбъектаБД.Реквизиты Цикл
			
			СтрокаТРеквизиты = ОбъектБДСформироватьТРеквизитыДобавитьСтроку(мдОбъектаБД, ОбъектБД, Реквизит.Имя, Реквизит.Представление(), БлокируемыеРеквизиты, НеРедактируемыеРеквизиты, Истина);
			СтруктураРеквизиты.Вставить(СтрокаТРеквизиты.Имя, СтрокаТРеквизиты.ОписаниеТипов);
			СписокРеквизиты.Добавить(СтрокаТРеквизиты.Имя, СтрокаТРеквизиты.Представление);
			
		КонецЦикла;
		
	ИначеЕсли ТипОбъектаБД = ИмяТипаЗадачи() Тогда
		
		// Свойства Объекта.
		ОбъектБДСформироватьТСвойстваДобавитьСтроку(мдОбъектаБД, ОбъектБД, "Описание", ОбъектБДПолучитьОписаниеОбъекта(ОбъектБД));
	
		// Стандартные реквизиты.
		Если мдОбъектаБД.ДлинаНомера > 0 Тогда
			
			СтрокаТРеквизиты = ОбъектБДСформироватьТРеквизитыДобавитьСтроку(мдОбъектаБД, ОбъектБД, "Номер", "Номер", БлокируемыеРеквизиты, НеРедактируемыеРеквизиты, Ложь, мдОбъектаБД.ДлинаНомера);
			СтруктураРеквизиты.Вставить(СтрокаТРеквизиты.Имя, СтрокаТРеквизиты.ОписаниеТипов);
			СписокРеквизиты.Добавить(СтрокаТРеквизиты.Имя, СтрокаТРеквизиты.Представление);
			
		КонецЕсли;
		
		СтрокаТРеквизиты = ОбъектБДСформироватьТРеквизитыДобавитьСтроку(мдОбъектаБД, ОбъектБД, "Дата", "Дата", БлокируемыеРеквизиты, НеРедактируемыеРеквизиты, Ложь);
		СтруктураРеквизиты.Вставить(СтрокаТРеквизиты.Имя, СтрокаТРеквизиты.ОписаниеТипов);
		СписокРеквизиты.Добавить(СтрокаТРеквизиты.Имя, СтрокаТРеквизиты.Представление);
		
		Если мдОбъектаБД.ДлинаНаименования > 0 Тогда
			
			СтрокаТРеквизиты = ОбъектБДСформироватьТРеквизитыДобавитьСтроку(мдОбъектаБД, ОбъектБД, "Наименование", "Наименование", БлокируемыеРеквизиты, НеРедактируемыеРеквизиты, Ложь, мдОбъектаБД.ДлинаНаименования);
			СтруктураРеквизиты.Вставить(СтрокаТРеквизиты.Имя, СтрокаТРеквизиты.ОписаниеТипов);
			СписокРеквизиты.Добавить(СтрокаТРеквизиты.Имя, СтрокаТРеквизиты.Представление);
			
		КонецЕсли;
		
		СтрокаТРеквизиты = ОбъектБДСформироватьТРеквизитыДобавитьСтроку(мдОбъектаБД, ОбъектБД, "БизнесПроцесс", "БизнесПроцесс", БлокируемыеРеквизиты, НеРедактируемыеРеквизиты, Истина);
		СтруктураРеквизиты.Вставить(СтрокаТРеквизиты.Имя, СтрокаТРеквизиты.ОписаниеТипов);
		СписокРеквизиты.Добавить(СтрокаТРеквизиты.Имя, СтрокаТРеквизиты.Представление);
		
		СтрокаТРеквизиты = ОбъектБДСформироватьТРеквизитыДобавитьСтроку(мдОбъектаБД, ОбъектБД, "ТочкаМаршрута", "ТочкаМаршрута", БлокируемыеРеквизиты, НеРедактируемыеРеквизиты, Истина);
		СтруктураРеквизиты.Вставить(СтрокаТРеквизиты.Имя, СтрокаТРеквизиты.ОписаниеТипов);
		СписокРеквизиты.Добавить(СтрокаТРеквизиты.Имя, СтрокаТРеквизиты.Представление);
		
		СтрокаТРеквизиты = ОбъектБДСформироватьТРеквизитыДобавитьСтроку(мдОбъектаБД, ОбъектБД, "Выполнена", "Выполнена", БлокируемыеРеквизиты, НеРедактируемыеРеквизиты, Ложь);
		СтруктураРеквизиты.Вставить(СтрокаТРеквизиты.Имя, СтрокаТРеквизиты.ОписаниеТипов);
		СписокРеквизиты.Добавить(СтрокаТРеквизиты.Имя, СтрокаТРеквизиты.Представление);
		
		// Реквизиты Адресации.
		Для Каждого Реквизит ИЗ мдОбъектаБД.РеквизитыАдресации Цикл
			
			СтрокаТРеквизиты = ОбъектБДСформироватьТРеквизитыДобавитьСтроку(мдОбъектаБД, ОбъектБД, Реквизит.Имя, Реквизит.Представление(), БлокируемыеРеквизиты, НеРедактируемыеРеквизиты, Истина);
			СтруктураРеквизиты.Вставить(СтрокаТРеквизиты.Имя, СтрокаТРеквизиты.ОписаниеТипов);
			СписокРеквизиты.Добавить(СтрокаТРеквизиты.Имя, СтрокаТРеквизиты.Представление);
			
		КонецЦикла;
		
		// Реквизиты.
		Для Каждого Реквизит ИЗ мдОбъектаБД.Реквизиты Цикл
			
			СтрокаТРеквизиты = ОбъектБДСформироватьТРеквизитыДобавитьСтроку(мдОбъектаБД, ОбъектБД, Реквизит.Имя, Реквизит.Представление(), БлокируемыеРеквизиты, НеРедактируемыеРеквизиты, Истина);
			СтруктураРеквизиты.Вставить(СтрокаТРеквизиты.Имя, СтрокаТРеквизиты.ОписаниеТипов);
			СписокРеквизиты.Добавить(СтрокаТРеквизиты.Имя, СтрокаТРеквизиты.Представление);
			
		КонецЦикла;
		
	ИначеЕсли ТипОбъектаБД = ИмяТипаПланыСчетов() Тогда
		
		// Свойства Объекта.
		ОбъектБДСформироватьТСвойстваДобавитьСтроку(мдОбъектаБД, ОбъектБД, "Описание", ОбъектБДПолучитьОписаниеОбъекта(ОбъектБД));
			
		// Стандартные реквизиты.
		СтрокаТРеквизиты = ОбъектБДСформироватьТРеквизитыДобавитьСтроку(мдОбъектаБД, ОбъектБД, "Родитель", "Родитель", БлокируемыеРеквизиты, НеРедактируемыеРеквизиты, Ложь);
		СтруктураРеквизиты.Вставить(СтрокаТРеквизиты.Имя, СтрокаТРеквизиты.ОписаниеТипов);
		СписокРеквизиты.Добавить(СтрокаТРеквизиты.Имя, СтрокаТРеквизиты.Представление);
		
		Если мдОбъектаБД.ДлинаКода > 0 Тогда
			
			СтрокаТРеквизиты = ОбъектБДСформироватьТРеквизитыДобавитьСтроку(мдОбъектаБД, ОбъектБД, "Код", "Код", БлокируемыеРеквизиты, НеРедактируемыеРеквизиты, Ложь, мдОбъектаБД.ДлинаКода);
			СтруктураРеквизиты.Вставить(СтрокаТРеквизиты.Имя, СтрокаТРеквизиты.ОписаниеТипов);
			СписокРеквизиты.Добавить(СтрокаТРеквизиты.Имя, СтрокаТРеквизиты.Представление);
			
		КонецЕсли;
		
		Если мдОбъектаБД.ДлинаНаименования > 0 Тогда
			
			СтрокаТРеквизиты = ОбъектБДСформироватьТРеквизитыДобавитьСтроку(мдОбъектаБД, ОбъектБД, "Наименование", "Наименование", БлокируемыеРеквизиты, НеРедактируемыеРеквизиты, Ложь, мдОбъектаБД.ДлинаНаименования);
			СтруктураРеквизиты.Вставить(СтрокаТРеквизиты.Имя, СтрокаТРеквизиты.ОписаниеТипов);
			СписокРеквизиты.Добавить(СтрокаТРеквизиты.Имя, СтрокаТРеквизиты.Представление);
			
		КонецЕсли;
		
		СтрокаТРеквизиты = ОбъектБДСформироватьТРеквизитыДобавитьСтроку(мдОбъектаБД, ОбъектБД, "Вид", "Вид", БлокируемыеРеквизиты, НеРедактируемыеРеквизиты, Ложь, мдОбъектаБД.ДлинаНаименования);
		СтруктураРеквизиты.Вставить(СтрокаТРеквизиты.Имя, СтрокаТРеквизиты.ОписаниеТипов);
		СписокРеквизиты.Добавить(СтрокаТРеквизиты.Имя, СтрокаТРеквизиты.Представление);
		
		СтрокаТРеквизиты = ОбъектБДСформироватьТРеквизитыДобавитьСтроку(мдОбъектаБД, ОбъектБД, "Забалансовый", "Забалансовый", БлокируемыеРеквизиты, НеРедактируемыеРеквизиты, Ложь, мдОбъектаБД.ДлинаНаименования);
		СтруктураРеквизиты.Вставить(СтрокаТРеквизиты.Имя, СтрокаТРеквизиты.ОписаниеТипов);
		СписокРеквизиты.Добавить(СтрокаТРеквизиты.Имя, СтрокаТРеквизиты.Представление);
		
		// ПризнакиУчета.
		Для Каждого Реквизит ИЗ мдОбъектаБД.ПризнакиУчета Цикл
			СчитатьМДанные = Ложь;
			Попытка
				Значение = ОбъектБД[Реквизит.Имя];
				СчитатьМДанные = Истина;
			Исключение
				СчитатьМДанные = Ложь;
				//Сообщить(НСтр("ru = '"+ОписаниеОшибки()+"'"), СтатусСообщения.Внимание);
			КонецПопытки;
			Если СчитатьМДанные Тогда
				СтрокаТРеквизиты = ОбъектБДСформироватьТРеквизитыДобавитьСтроку(мдОбъектаБД, ОбъектБД, Реквизит.Имя, Реквизит.Представление(), БлокируемыеРеквизиты, НеРедактируемыеРеквизиты, Истина);
				СтруктураРеквизиты.Вставить(СтрокаТРеквизиты.Имя, СтрокаТРеквизиты.ОписаниеТипов);
				СписокРеквизиты.Добавить(СтрокаТРеквизиты.Имя, СтрокаТРеквизиты.Представление);
			КонецЕсли;
		КонецЦикла;
		
		// Реквизиты.
		Для Каждого Реквизит ИЗ мдОбъектаБД.Реквизиты Цикл
			СтрокаТРеквизиты = ОбъектБДСформироватьТРеквизитыДобавитьСтроку(мдОбъектаБД, ОбъектБД, Реквизит.Имя, Реквизит.Представление(), БлокируемыеРеквизиты, НеРедактируемыеРеквизиты, Истина);
			СтруктураРеквизиты.Вставить(СтрокаТРеквизиты.Имя, СтрокаТРеквизиты.ОписаниеТипов);
			СписокРеквизиты.Добавить(СтрокаТРеквизиты.Имя, СтрокаТРеквизиты.Представление);
		КонецЦикла;
		
	ИначеЕсли ТипОбъектаБД = ИмяТипаПланыВидовРасчета() Тогда
		
		ОбъектБДСформироватьТСвойстваДобавитьСтроку(мдОбъектаБД, ОбъектБД, "Описание", ОбъектБДПолучитьОписаниеОбъекта(ОбъектБД));
		
		Если мдОбъектаБД.ДлинаКода > 0 Тогда
			
			СтрокаТРеквизиты = ОбъектБДСформироватьТРеквизитыДобавитьСтроку(мдОбъектаБД, ОбъектБД, "Код", "Код", БлокируемыеРеквизиты, НеРедактируемыеРеквизиты, Ложь, мдОбъектаБД.ДлинаКода);
			СтруктураРеквизиты.Вставить(СтрокаТРеквизиты.Имя, СтрокаТРеквизиты.ОписаниеТипов);
			СписокРеквизиты.Добавить(СтрокаТРеквизиты.Имя, СтрокаТРеквизиты.Представление);
			
		КонецЕсли;
		
		Если мдОбъектаБД.ДлинаНаименования > 0 Тогда
			
			СтрокаТРеквизиты = ОбъектБДСформироватьТРеквизитыДобавитьСтроку(мдОбъектаБД, ОбъектБД, "Наименование", "Наименование", БлокируемыеРеквизиты, НеРедактируемыеРеквизиты, Ложь, мдОбъектаБД.ДлинаНаименования);
			СтруктураРеквизиты.Вставить(СтрокаТРеквизиты.Имя, СтрокаТРеквизиты.ОписаниеТипов);
			СписокРеквизиты.Добавить(СтрокаТРеквизиты.Имя, СтрокаТРеквизиты.Представление);
			
		КонецЕсли;
		
		// Реквизиты.
		Для Каждого Реквизит ИЗ мдОбъектаБД.Реквизиты Цикл
			СтрокаТРеквизиты = ОбъектБДСформироватьТРеквизитыДобавитьСтроку(мдОбъектаБД, ОбъектБД, Реквизит.Имя, Реквизит.Представление(), БлокируемыеРеквизиты, НеРедактируемыеРеквизиты, Истина);
			СтруктураРеквизиты.Вставить(СтрокаТРеквизиты.Имя, СтрокаТРеквизиты.ОписаниеТипов);
			СписокРеквизиты.Добавить(СтрокаТРеквизиты.Имя, СтрокаТРеквизиты.Представление);
		КонецЦикла;
		
	КонецЕсли;
	
	СтруктураВозврат = Новый Структура;
	СтруктураВозврат.Вставить("ТСвойстваОбъекта"		, ТСвойстваОбъекта);
	СтруктураВозврат.Вставить("ТРеквизитыОбъекта"		, ТРеквизитыОбъекта);
	СтруктураВозврат.Вставить("СтруктураРеквизиты"		, СтруктураРеквизиты);
	СтруктураВозврат.Вставить("СписокРеквизиты"			, СписокРеквизиты);
	СтруктураВозврат.Вставить("БлокируемыеРеквизиты"	, БлокируемыеРеквизиты);
	СтруктураВозврат.Вставить("НеРедактируемыеРеквизиты", НеРедактируемыеРеквизиты);
	
	Возврат СтруктураВозврат;
	
КонецФункции

// Вкладка "Реквизиты бъекта". Сформировать Строку таблицы Реквизитов выбранного ОбъектаБД.
//
Процедура ОбъектБДСформироватьТСвойстваДобавитьСтроку(мдОбъектаБД, ОбъектБД, ИмяРеквизита, ЗначениеРеквизита)
	
	СтрокаТСвойства = ТСвойстваОбъекта.Добавить();
	СтрокаТСвойства.Свойство = ИмяРеквизита;
	СтрокаТСвойства.Значение = ЗначениеРеквизита;
	
КонецПроцедуры

// Вкладка "Реквизиты бъекта". Сформировать Строку таблицы Реквизитов выбранного ОбъектаБД.
//
Функция ОбъектБДСформироватьТРеквизитыДобавитьСтроку(мдОбъектаБД, ОбъектБД, ИмяРеквизита, Представление, БлокируемыеРеквизиты, НеРедактируемыеРеквизиты, Проверяемый, Длина = Неопределено)
	
	// Стандартные реквизиты: Справочника, Документа, ПланаОбмена.
	Мас = Новый Массив;
	Мас.Добавить("Код");					// Справочник, ПланОбмена.
	Мас.Добавить("Наименование");			// Справочник, ПланОбмена.
	Мас.Добавить("Номер");					// Документ.
	Мас.Добавить("НомерОтправленного");		// ПланОбмена.
	Мас.Добавить("НомерПринятого");			// ПланОбмена.
	
	СтрокаТРеквизиты				= ТРеквизитыОбъекта.Добавить();
	
	РезультатРеквизит 				= ОбъектБДПолучитьМДРеквизита(ИмяРеквизита, ОбъектБД);
	
	СтрокаТРеквизиты.Группа			= РезультатРеквизит.Группа;
	Реквизит 						= РезультатРеквизит.Реквизит;
	СтрокаТРеквизиты.Блокированный	= НЕ БлокируемыеРеквизиты.НайтиПоЗначению(ИмяРеквизита) = Неопределено;
	
	Если НеРедактируемыеРеквизиты.Количество() > 0 Тогда
		Если НЕ НеРедактируемыеРеквизиты.НайтиПоЗначению(ИмяРеквизита) = Неопределено Тогда
			Проверяемый = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Тип = Строка(ТипЗнч(ОбъектБД[ИмяРеквизита]));
	
	Если СтрокаТРеквизиты.Блокированный Тогда
		СтрокаТРеквизиты.Проверяемый	= Истина;
	Иначе
		Если Тип = "Дата" ИЛИ Тип = "Булево" ИЛИ Тип = "Хранилище значения" Тогда
			СтрокаТРеквизиты.Проверяемый= Ложь;
		Иначе
			СтрокаТРеквизиты.Проверяемый= Проверяемый;
		КонецЕсли;
	КонецЕсли;
	
	СтрокаТРеквизиты.Имя			= ИмяРеквизита;
	СтрокаТРеквизиты.Представление	= Представление;
	
	Если НЕ Реквизит = Неопределено Тогда
		СтрокаТРеквизиты.ОписаниеТипов = Реквизит.Тип;
	КонецЕсли;
	
	Если ОбъектБД[ИмяРеквизита] = Неопределено Тогда
		СтрокаТРеквизиты.Тип		= "<<Неопределено>>";
	ИначеЕсли (Тип = "Строка" ИЛИ Тип = "Дата" ИЛИ Тип = "Число" ИЛИ Тип = "Булево") Тогда
		СтрокаТРеквизиты.Тип		= Тип;
		Если (Тип = "Строка") ИЛИ (Тип = "Число") Тогда
			Если НЕ Длина = Неопределено Тогда
				СтрокаТРеквизиты.Тип = СтрокаТРеквизиты.Тип + " (" + Длина + ")";
			Иначе
				Если Мас.Найти(ИмяРеквизита) = Неопределено Тогда
					Если Метаданные.ОбщиеРеквизиты.Содержит(мдОбъектаБД) Тогда	// Общий реквизит.
						Если Тип = "Строка" Тогда
							Длина = мдОбъектаБД.Тип.КвалификаторыСтроки.Длина;
							Длина = ?(Длина = 0, "неограниченная", Длина);
							СтрокаТРеквизиты.Тип = СтрокаТРеквизиты.Тип + " (" + Длина + ")";
							Если Длина = "неограниченная" Тогда
								СтрокаТРеквизиты.Проверяемый= Ложь;
							КонецЕсли;
						Иначе
							Если мдОбъектаБД.Тип.КвалификаторыЧисла.РазрядностьДробнойЧасти > 0 Тогда
								СтрокаТРеквизиты.Тип = СтрокаТРеквизиты.Тип + " (" + мдОбъектаБД.Тип.КвалификаторыЧисла.Разрядность + "." + мдОбъектаБД.Тип.КвалификаторыЧисла.РазрядностьДробнойЧасти + ")";
							Иначе
								СтрокаТРеквизиты.Тип = СтрокаТРеквизиты.Тип + " (" + мдОбъектаБД.Тип.КвалификаторыЧисла.Разрядность + ")";
							КонецЕсли;
						КонецЕсли;
					Иначе
						Если Тип = "Строка" Тогда
							Длина = мдОбъектаБД.Реквизиты[ИмяРеквизита].Тип.КвалификаторыСтроки.Длина;
							Длина = ?(Длина = 0, "неограниченная", Длина);
							СтрокаТРеквизиты.Тип = СтрокаТРеквизиты.Тип + " (" + Длина + ")";
							Если Длина = "неограниченная" Тогда
								СтрокаТРеквизиты.Проверяемый= Ложь;
							КонецЕсли;
						Иначе
							Если мдОбъектаБД.Реквизиты[ИмяРеквизита].Тип.КвалификаторыЧисла.РазрядностьДробнойЧасти > 0 Тогда
								СтрокаТРеквизиты.Тип = СтрокаТРеквизиты.Тип + " (" + мдОбъектаБД.Реквизиты[ИмяРеквизита].Тип.КвалификаторыЧисла.Разрядность + "." + мдОбъектаБД.Реквизиты[ИмяРеквизита].Тип.КвалификаторыЧисла.РазрядностьДробнойЧасти + ")";
							Иначе
								СтрокаТРеквизиты.Тип = СтрокаТРеквизиты.Тип + " (" + мдОбъектаБД.Реквизиты[ИмяРеквизита].Тип.КвалификаторыЧисла.Разрядность + ")";
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	Иначе
		СтрокаТРеквизиты.Тип = ОбъектБДПолучитьПолноеСтроковоеИмяТипа(ОбъектБД[ИмяРеквизита]);
	КонецЕсли;
	
	Если ИмяРеквизита = "Описание" ИЛИ ИмяРеквизита = "Комментарий" ИЛИ ИмяРеквизита = "ФайлКартинки" ИЛИ Найти(ИмяРеквизита, "Удалить") = 1 Тогда
		СтрокаТРеквизиты.Проверяемый= Ложь;
	ИначеЕсли ИмяРеквизита = "НаименованиеПолное" Тогда
		СтрокаТРеквизиты.Проверяемый= Истина;
	КонецЕсли;
	
	СтрокаТРеквизиты.Значение = ОбъектБД[ИмяРеквизита];	// ХранилищеЗначения. см. ОбъектБДЗаписатьНаСервере().
	
	Возврат СтрокаТРеквизиты;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ВКЛАДКА "МЕТАДАННЫЕ".
// 

// Вкладка "Метаданные" - "Регистры".
// - Имя Регистра.
// - Измерение/Ресурс/Реквизит Регистра.
// - Признак Ведущщее (только для Регистра Сведений).
//
Функция ПолучитьСписокРегистровСвязанныхСОбъектомМД(ОбъектБД) Экспорт
	
	СписокУникальныхИменРегистров = Новый СписокЗначений;
	
	мдОбъектаБД = ОбъектБД.Метаданные();
	ТипОбъектаБД= ИмяБазовогоТипаПоОбъектуМетаданных(мдОбъектаБД);
	
	ПорядковыйНомер = 0;
	ТМетаданныеРегистрыОбъекта.Очистить();
	Если ТипОбъектаБД = ИмяТипаДокументы() Тогда
		Для Каждого мдРегистратор ИЗ мдОбъектаБД.Движения Цикл
			НоваяСтрока = ТМетаданныеРегистрыОбъекта.Добавить();
			ПорядковыйНомер		= ПорядковыйНомер + 1;
			НоваяСтрока.НПП		= ПорядковыйНомер;
			НоваяСтрока.Регистр	= "" + ИмяБазовогоТипаПоОбъектуМетаданных(мдРегистратор) + "." + мдРегистратор.Имя;
			НоваяСтрока.Позиция	= "[рег] " + мдОбъектаБД.ПолноеИмя();
			Если СписокУникальныхИменРегистров.НайтиПоЗначению(НоваяСтрока.Регистр) = Неопределено Тогда
				СписокУникальныхИменРегистров.Добавить(НоваяСтрока.Регистр);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	сзРегистры = Новый СписокЗначений;
	сзРегистры.Добавить("РегистрыСведений");
	сзРегистры.Добавить("РегистрыНакопления");
	сзРегистры.Добавить("РегистрыБухгалтерии");
	сзРегистры.Добавить("РегистрыРасчета");
	
	Для Каждого ТипРегистра ИЗ сзРегистры Цикл

		Для Каждого мдРегистр ИЗ Метаданные[ТипРегистра.Значение] Цикл
			
			Для Каждого мдИзмерение ИЗ мдРегистр.Измерения Цикл
				
				Для Каждого мдТип ИЗ мдИзмерение.Тип.Типы() Цикл
					Если мдОбъектаБД = Метаданные.НайтиПоТипу(мдТип) тогда
						НоваяСтрока = ТМетаданныеРегистрыОбъекта.Добавить();	
						ПорядковыйНомер		= ПорядковыйНомер + 1;
						НоваяСтрока.НПП		= ПорядковыйНомер;
						НоваяСтрока.Регистр	= "" + мдРегистр.ПолноеИмя();
						НоваяСтрока.Позиция	= "[изм] " + мдИзмерение.Имя;
						Если ((ТипРегистра.Значение = "РегистрыСведений") И мдИзмерение.Ведущее) Тогда
							НоваяСтрока.Ведущее = Истина;
						КонецЕсли;
						Если СписокУникальныхИменРегистров.НайтиПоЗначению(НоваяСтрока.Регистр) = Неопределено Тогда
							СписокУникальныхИменРегистров.Добавить(НоваяСтрока.Регистр);
						КонецЕсли;
					КонецЕсли;
				КонецЦикла;
				
			КонецЦикла;
			
			Для Каждого мдРесурс ИЗ мдРегистр.Ресурсы Цикл
				
				Для Каждого мдТип ИЗ мдРесурс.Тип.Типы() Цикл
					Если мдОбъектаБД = Метаданные.НайтиПоТипу(мдТип) тогда
						НоваяСтрока			= ТМетаданныеРегистрыОбъекта.Добавить();	
						ПорядковыйНомер		= ПорядковыйНомер + 1;
						НоваяСтрока.НПП		= ПорядковыйНомер;
						НоваяСтрока.Регистр	= "" + мдРегистр.ПолноеИмя();
						НоваяСтрока.Позиция	= "[рес] " + мдРесурс.Имя;
						Если СписокУникальныхИменРегистров.НайтиПоЗначению(НоваяСтрока.Регистр) = Неопределено Тогда
							СписокУникальныхИменРегистров.Добавить(НоваяСтрока.Регистр);
						КонецЕсли;
					КонецЕсли;
				КонецЦикла;
				
			КонецЦикла;
			
			Для Каждого мдРеквизит ИЗ мдРегистр.Ресурсы Цикл
				
				Для Каждого мдТип ИЗ мдРеквизит.Тип.Типы() Цикл
					Если мдОбъектаБД = Метаданные.НайтиПоТипу(мдТип) тогда
						НоваяСтрока = ТМетаданныеРегистрыОбъекта.Добавить();	
						ПорядковыйНомер		= ПорядковыйНомер + 1;
						НоваяСтрока.НПП		= ПорядковыйНомер;
						НоваяСтрока.Регистр	= "" + мдРегистр.ПолноеИмя();
						НоваяСтрока.Позиция	= "[рек] " + мдРеквизит.Имя;
						Если СписокУникальныхИменРегистров.НайтиПоЗначению(НоваяСтрока.Регистр) = Неопределено Тогда
							СписокУникальныхИменРегистров.Добавить(НоваяСтрока.Регистр);
						КонецЕсли;
					КонецЕсли;
				КонецЦикла;
				
			КонецЦикла;
			
		КонецЦикла;	// мдРегистр ИЗ Метаданные[ТипРегистра.Значение] Цикл
		
	КонецЦикла;	// ТипРегистра ИЗ сзРегистры Цикл
	
	стрВозврат = Новый Структура;
	стрВозврат.Вставить("Таблица", ТМетаданныеРегистрыОбъекта);
	стрВозврат.Вставить("Заголовок","Количество уникальных регистров: " + СписокУникальныхИменРегистров.Количество());
	
	Возврат стрВозврат;
	
КонецФункции

// Вкладка "Метаданные" - "Подписки".
// - Имя Подписки.
// - Обработчик.
// - Событие.
//
Функция ПолучитьСписокПодписокНаСобытияОбъектаМД(ОбъектБД) Экспорт

	мдОбъектаБД = ОбъектБД.Метаданные();

	ТМетаданныеПодпискиНаСобытия.Очистить();
	
	ТипОбъекта = Тип(ЭтотОбъект.ТипОбъектаБД + "Объект." + мдОбъектаБД.Имя);
	ПорядковыйНомер = 0;
	Для Каждого Подписка ИЗ Метаданные.ПодпискиНаСобытия Цикл
		Если Подписка.Источник.СодержитТип(ТипОбъекта) Тогда
			НоваяСтрока = ТМетаданныеПодпискиНаСобытия.Добавить();	
			ПорядковыйНомер			= ПорядковыйНомер + 1;
			НоваяСтрока.НПП			= ПорядковыйНомер;
			НоваяСтрока.Подписка	= Подписка.Имя;
			НоваяСтрока.Обработчик  = Подписка.Обработчик;
			НоваяСтрока.Событие  	= Подписка.Событие;
		КонецЕсли;
	КонецЦикла;
	
	стрВозврат = Новый Структура;
	стрВозврат.Вставить("Таблица", ТМетаданныеПодпискиНаСобытия);
	стрВозврат.Вставить("Заголовок","Количество подписок: " + ТМетаданныеПодпискиНаСобытия.Количество());
	
	Возврат стрВозврат;

КонецФункции

// Вкладка "Метаданные" - "Планы обмена".
// - Имя Плана обмена.
//
Функция ПолучитьСписокПлановОбменаОбъектаМД(ОбъектБД) Экспорт
	
	мдОбъектаБД = ОбъектБД.Метаданные();

	ТМетаданныеПланыОбмена.Очистить();
	ПорядковыйНомер = 0;
	Для Каждого ПланОбмена ИЗ Метаданные.ПланыОбмена Цикл
		СоставПланаОбмена = ПланОбмена.Состав;
		Для Каждого ЭлементСостава ИЗ СоставПланаОбмена Цикл
			Если ЭлементСостава.Метаданные = мдОбъектаБД Тогда
				НоваяСтрока = ТМетаданныеПланыОбмена.Добавить();	
				ПорядковыйНомер			= ПорядковыйНомер + 1;
				НоваяСтрока.НПП			= ПорядковыйНомер;
				НоваяСтрока.ПланОбмена	= ПланОбмена.Имя;
				НоваяСтрока.ПредставлениеОбъекта = ?(ЗначениеЗаполнено(ПланОбмена.ПредставлениеОбъекта), ПланОбмена.ПредставлениеОбъекта, ПланОбмена.РасширенноеПредставлениеОбъекта);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	стрВозврат = Новый Структура;
	стрВозврат.Вставить("Таблица", ТМетаданныеПланыОбмена);
	стрВозврат.Вставить("Заголовок","Количествово планов обмена: " + ТМетаданныеПланыОбмена.Количество());
	
	Возврат стрВозврат;

КонецФункции

// Вкладка "Метаданные" - "Ввод на основании".
// - Объект.
//
Функция ПолучитьСписокВводНаОснованииОъектаМД(ОбъектБД) Экспорт
	Перем СписокКоллекцийМД;

	СписокКоллекцийМД = ФолучитьМассивКоллекцийОбъектовМетаданных();
	
	мдОбъектаБД = ОбъектБД.Метаданные();

	ТМетаданныеВводитсяНаОсновании.Очистить();
	ТМетаданныеЯвляетсяОснованиемДля.Очистить();
	
	// Вводится на основани ...
	ПорядковыйНомер = 0;
	Для Каждого ОбъектОснование ИЗ мдОбъектаБД.ВводитсяНаОсновании Цикл
		НоваяСтрока = ТМетаданныеВводитсяНаОсновании.Добавить();	
		ПорядковыйНомер		= ПорядковыйНомер + 1;
		НоваяСтрока.НПП		= ПорядковыйНомер;
		НоваяСтрока.Объект	= ОбъектОснование.Имя;
	КонецЦикла;
	
	// Является основанием для ...
	ПорядковыйНомер = 0;
	Для Каждого КоллекцияОбъектовМетаданных ИЗ СписокКоллекцийМД Цикл
		Для Каждого ОбъектОснование ИЗ Метаданные[КоллекцияОбъектовМетаданных] Цикл
			Если ОбъектОснование.ВводитсяНаОсновании.Содержит(мдОбъектаБД) Тогда
				НоваяСтрока = ТМетаданныеЯвляетсяОснованиемДля.Добавить();	
				ПорядковыйНомер		= ПорядковыйНомер + 1;
				НоваяСтрока.НПП		= ПорядковыйНомер;
				НоваяСтрока.Объект	= ОбъектОснование.Имя;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	стрВозврат = Новый Структура;
	стрВозврат.Вставить("Таблица_1", ТМетаданныеВводитсяНаОсновании);
	стрВозврат.Вставить("Таблица_2", ТМетаданныеЯвляетсяОснованиемДля);
	
	Возврат стрВозврат;

КонецФункции

Функция ФолучитьМассивКоллекцийОбъектовМетаданных()
	Перем СписокКоллекцийМД;

	СписокКоллекцийМД = Новый Массив;	// Метаданные
	СписокКоллекцийМД.Добавить("БизнесПроцессы");
	СписокКоллекцийМД.Добавить("Документы");
	СписокКоллекцийМД.Добавить("Задачи");
	СписокКоллекцийМД.Добавить("ПланыВидовРасчета");
	СписокКоллекцийМД.Добавить("ПланыВидовХарактеристик");
	СписокКоллекцийМД.Добавить("ПланыСчетов");
	СписокКоллекцийМД.Добавить("Справочники");
	
	Возврат СписокКоллекцийМД;
	
КонецФункции

// Вкладка "Метаданные" - "Функциональные опции".
// - Имя Функциональной опции.
// - Имя Реквизита.
//
Функция ПолучитьСписокФункциональныхОпцийОбъектаМД(ОбъектБД) Экспорт

	мдОбъектаБД = ОбъектБД.Метаданные();
	
	ТМетаданныеФункциональныеОпции.Очистить();
	
	ПорядковыйНомер = 0;
	Для Каждого ФОпция ИЗ Метаданные.ФункциональныеОпции Цикл
		Для Каждого ЭлементСостава ИЗ ФОпция.Состав Цикл
			Если ЭлементСостава.Объект = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			Если ЭлементСостава.Объект = мдОбъектаБД Тогда
				НоваяСтрока = ТМетаданныеФункциональныеОпции.Добавить();
				ПорядковыйНомер		= ПорядковыйНомер + 1;
				НоваяСтрока.НПП		= ПорядковыйНомер;
				НоваяСтрока.ФОпция	= ПолучитьВидОбъектаХраненияФункциональнойОпции(ФОпция) + ФОпция.Имя;
				НоваяСтрока.Тип		= ФОпция.Хранение.Тип;
				НоваяСтрока.ПривилегированныйРежимПриПолучении = ФОпция.ПривилегированныйРежимПриПолучении;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	стрВозврат = Новый Структура;
	стрВозврат.Вставить("Таблица", ТМетаданныеФункциональныеОпции);
	
	Возврат стрВозврат;

КонецФункции

// Вкладка "Метаданные" - "Функциональные опции".
// - Имя Функциональной опции.
// - Имя Реквизита.
//
Процедура ПолучитьФункциональныеОпцииРеквизитовОбъекта(ОбъектБД, Таблица, ТЧасть = Неопределено, Управляемая = Истина) Экспорт

	мдОбъектаБД = ОбъектБД.Метаданные();
	Если ЭтоТабличнаяЧастьОбъектаМетаданных1С(ТЧасть, мдОбъектаБД) Тогда
		мдТЧасти = мдОбъектаБД.ТабличныеЧасти[ТЧасть];
	ИначеЕсли ЭтоСтандартнаяТабличнаяЧастьОбъектаМетаданных1С(ТЧасть, мдОбъектаБД) Тогда
		мдТЧасти = мдОбъектаБД.СтандартныеТабличныеЧасти[ТЧасть];
	Иначе
		мдТЧасти = Неопределено;
	КонецЕсли;
	
	Для Каждого ФОпция ИЗ Метаданные.ФункциональныеОпции Цикл
		Для Каждого ЭлементСостава ИЗ ФОпция.Состав Цикл
			Если ЭлементСостава.Объект = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			Если (ТЧасть = Неопределено И ЭлементСостава.Объект.Родитель() = мдОбъектаБД) Тогда
				МассивСтрок = Таблица.НайтиСтроки(Новый Структура("Имя", ЭлементСостава.Объект.Имя));
				Если МассивСтрок.Количество() > 0 Тогда
					МассивСтрок[0].ФОпция = ПолучитьВидОбъектаХраненияФункциональнойОпции(ФОпция) + ФОпция.Имя;
				КонецЕсли;
			ИначеЕсли (НЕ ТЧасть = Неопределено И ЭлементСостава.Объект.Родитель() = мдТЧасти И ЭлементСостава.Объект.Родитель().Родитель() = мдОбъектаБД) Тогда
				Если Управляемая Тогда
					КолонкаТЧ = Таблица.ПодчиненныеЭлементы["ТФормыТЧасти"+ТЧасть].ПодчиненныеЭлементы["ТФормыТЧасти"+ТЧасть+ЭлементСостава.Объект.Имя];
					Если Найти(КолонкаТЧ.Заголовок, "ФОпция:") = 0 Тогда
						КолонкаТЧ.Заголовок = КолонкаТЧ.Заголовок + Символы.ПС + "(ФОпция:" + ПолучитьВидОбъектаХраненияФункциональнойОпции(ФОпция) + ФОпция.Имя + ")";
					КонецЕсли;
				Иначе
					КолонкаТЧ = Таблица.Колонки[ЭлементСостава.Объект.Имя];
					Если Найти(КолонкаТЧ.ТекстШапки, "ФОпция:") = 0 Тогда
						КолонкаТЧ.ТекстШапки = КолонкаТЧ.ТекстШапки + Символы.ПС + "(ФОпция:" + ПолучитьВидОбъектаХраненияФункциональнойОпции(ФОпция) + ФОпция.Имя + ")";
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Возврат;

КонецПроцедуры

Функция ПолучитьВидОбъектаХраненияФункциональнойОпции(Знач ФОпция)
	
	Если Строка(ФОпция.Хранение.Тип) = "Число" ИЛИ Строка(ФОпция.Хранение.Тип) = "Строка" ИЛИ Строка(ФОпция.Хранение.Тип) = "Дата" ИЛИ Строка(ФОпция.Хранение.Тип) = "Булево" Тогда
		Если НЕ Метаданные.НайтиПоПолномуИмени("Константа." + ФОпция.Хранение.Имя) = Неопределено Тогда
			Возврат "[Константа:]";
		ИначеЕсли НЕ Метаданные.НайтиПоПолномуИмени("Справочник." + ФОпция.Хранение.Имя) = Неопределено Тогда
			Возврат "[Справочник:]";
		ИначеЕсли НЕ Метаданные.НайтиПоПолномуИмени("РегистрСведений." + ФОпция.Хранение.Имя) = Неопределено Тогда
			Возврат "[РСведений:]";
		КонецЕсли;
	КонецЕсли;
	
	Возврат "";

КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ВКЛАДКА "ДОПОЛНИТЕЛЬНО" - "ССЫЛКИ НА ОБЪЕКТ".

// Вкладка "Ссылки на Объект". Поиск ссылок на выбранный ОбъектБД.
//
Функция ТСсылкиНайтиСсылкиНаОбъектНаСервере(ОбъектБД) Экспорт
	
	МассивЗаменяемых = Новый Массив;
	МассивЗаменяемых.Добавить(ОбъектБД);
	
	ТСсылкиСписок = НайтиПоСсылкам(МассивЗаменяемых);
	ТСсылкиСписок.Колонки.Вставить(0, "Включено", Новый ОписаниеТипов("Булево"), , 3);
	
	Возврат ТСсылкиСписок;
 
КонецФункции

// Вкладка "Ссылки на Объект". Произвести Замену ссылок Выбранного ОбъектаБД на Заменяющий ОбъектБД.
//
Процедура ТСсылкиПроизвестиЗаменуСсылокНаСервере(ОбъектБДЗаменяющий) Экспорт
	
	Заменяемые = Новый Соответствие;
	Заменяемые.Вставить(ОбъектБД, ОбъектБДЗаменяющий);
	
	ТСсылкиСписок = ТСсылкиПодготовитьТаблицуНайденныеСсылки(ТСсылкиСписок);
	
	Если ((ТСсылкиСписок <> Неопределено) И (ТСсылкиСписок.Количество() > 0)) Тогда
		ТСсылкиПроизвестиЗаменуСсылокНаСервереВыполнение(Заменяемые, ТСсылкиСписок, ВыполнятьВТранзакции);
	КонецЕсли;
	
КонецПроцедуры

// Вкладка "Ссылки на Объект". 1С:ИТС. ВыпольнитьЗамену.
//
Функция ТСсылкиПроизвестиЗаменуСсылокНаСервереВыполнение(Заменяемые, ТаблицаСсылок, ВыполнятьВТранзакции)
	// 1С:ИТС.
	
	БылиИсключения = Ложь;
	Если ВыполнятьВТранзакции Тогда
		НачатьТранзакцию();
	КонецЕсли;
	ОбрабатываемаяСсылка = Неопределено;
		
	ПараметрыЗамены = Новый Структура;
	
	Для Каждого РегистрБухгалтерии ИЗ Метаданные.РегистрыБухгалтерии Цикл
		ПараметрыЗамены.Вставить(РегистрБухгалтерии.Имя+"Субконто", РегистрБухгалтерии.ПланСчетов.МаксКоличествоСубконто);
		ПараметрыЗамены.Вставить(РегистрБухгалтерии.Имя+"Корреспонденция", РегистрБухгалтерии.Корреспонденция);		
	КонецЦикла;
	
	ПараметрыЗамены.Вставить("Объект", Неопределено);
	
    ЗначениеИндикатора = 0;
	Для Каждого СтрокаТаблицы ИЗ ТаблицаСсылок Цикл
		Если НЕ СтрокаТаблицы.Включено Тогда
			Продолжить;
		КонецЕсли;
		ПравильныйЭлемент = Заменяемые[СтрокаТаблицы.Ссылка];
		
		ЗначениеИндикатора = ЗначениеИндикатора + 1;
		
		Ссылка = СтрокаТаблицы.Ссылка;
		
		Если ОбрабатываемаяСсылка <> СтрокаТаблицы.Данные Тогда
			Если ОбрабатываемаяСсылка <> Неопределено и ПараметрыЗамены.Объект <> Неопределено Тогда
				
				Если РазрешитьУстановкуЗначенияОбменДаннымиЗагрузкаИстина(ПараметрыЗамены.Объект) Тогда
					ПараметрыЗамены.Объект.ОбменДанными.Загрузка = Истина;	// Не все объекты имеют свойство "ОбменДанными".
				КонецЕсли;
				
				Попытка
					ПараметрыЗамены.Объект.Записать();
				Исключение
					СообщитьОбОшибкеПриЗаписи(ИнформацияОбОшибке());
					БылиИсключения = Истина;
					Если ВыполнятьВТранзакции Тогда
						Перейти ~ОТКАТ;
					КонецЕсли;
				КонецПопытки;
				ПараметрыЗамены.Объект = Неопределено;
				
			КонецЕсли;
			ОбрабатываемаяСсылка = СтрокаТаблицы.Данные;
			
		КонецЕсли;
			
		Если Метаданные.Документы.Содержит(СтрокаТаблицы.Метаданные) Тогда
			
			Если ПараметрыЗамены.Объект = Неопределено Тогда
				ПараметрыЗамены.Объект = СтрокаТаблицы.Данные.ПолучитьОбъект();
			КонецЕсли;
			
			Для Каждого Реквизит ИЗ СтрокаТаблицы.Метаданные.Реквизиты Цикл
				Если Реквизит.Тип.СодержитТип(ТипЗнч(Ссылка)) И ПараметрыЗамены.Объект[Реквизит.Имя] = Ссылка Тогда
					ПараметрыЗамены.Объект[Реквизит.Имя] = ПравильныйЭлемент;
				КонецЕсли;
			КонецЦикла;
				
			Для Каждого ТЧ ИЗ СтрокаТаблицы.Метаданные.ТабличныеЧасти Цикл
				Для Каждого Реквизит ИЗ ТЧ.Реквизиты Цикл
					Если Реквизит.Тип.СодержитТип(ТипЗнч(Ссылка)) Тогда
						СтрокаТабЧасти = ПараметрыЗамены.Объект[ТЧ.Имя].Найти(Ссылка, Реквизит.Имя);
						Пока СтрокаТабЧасти <> Неопределено Цикл
							СтрокаТабЧасти[Реквизит.Имя] = ПравильныйЭлемент;
							СтрокаТабЧасти = ПараметрыЗамены.Объект[ТЧ.Имя].Найти(Ссылка, Реквизит.Имя);
						КонецЦикла;
					КонецЕсли;
				КонецЦикла;
			КонецЦикла;
			
			Для Каждого Движение ИЗ СтрокаТаблицы.Метаданные.Движения Цикл
				
				ЭтоДвижениеРегистраБухгалтерии = Метаданные.РегистрыБухгалтерии.Содержит(Движение);
				ЕстьКорреспонденция = ЭтоДвижениеРегистраБухгалтерии И ПараметрыЗамены[Движение.Имя + "Корреспонденция"];
				
				НаборЗаписей  = ПараметрыЗамены.Объект.Движения[Движение.Имя];
				НаборЗаписей.Прочитать();
				НадоЗаписывать = Ложь;
				ТаблицаНабора = НаборЗаписей.Выгрузить();
				
				Если ТаблицаНабора.Количество() = 0 Тогда
					Продолжить;
				КонецЕсли;
				
				масИменКолонок = Новый Массив;
				
				// Получим имена измерений, которые могут содержать ссылку
				Для Каждого Измерение ИЗ Движение.Измерения Цикл
					Если Измерение.Тип.СодержитТип(ТипЗнч(Ссылка)) Тогда
						
						Если ЭтоДвижениеРегистраБухгалтерии Тогда
							
							Если Измерение.ПризнакУчета <> Неопределено Тогда
								
								масИменКолонок.Добавить(Измерение.Имя + "Дт");
								масИменКолонок.Добавить(Измерение.Имя + "Кт");
								
							Иначе
								масИменКолонок.Добавить(Измерение.Имя);
							КонецЕсли;
							
						Иначе
							масИменКолонок.Добавить(Измерение.Имя);
						КонецЕсли;
						
					КонецЕсли;
				КонецЦикла;
						
				// Получим имена ресурсов, которые могут содержать ссылку
				Если Метаданные.РегистрыСведений.Содержит(Движение) Тогда
					Для Каждого Ресурс ИЗ Движение.Ресурсы Цикл
						Если Ресурс.Тип.СодержитТип(ТипЗнч(Ссылка)) Тогда
							масИменКолонок.Добавить(Ресурс.Имя);
						КонецЕсли;
					КонецЦикла;
				КонецЕсли;
						
				// Получим имена ресурсов, которые могут содержать ссылку
				Для Каждого Реквизит ИЗ Движение.Реквизиты Цикл
					Если Реквизит.Тип.СодержитТип(ТипЗнч(Ссылка)) Тогда
						масИменКолонок.Добавить(Реквизит.Имя);
					КонецЕсли;
				КонецЦикла;
				
				// Произведем замены в таблице
				Для Каждого ИмяКолонки ИЗ масИменКолонок Цикл
					СтрокаТабЧасти = ТаблицаНабора.Найти(Ссылка, ИмяКолонки);
					Пока СтрокаТабЧасти <> Неопределено Цикл
						СтрокаТабЧасти[ИмяКолонки] = ПравильныйЭлемент;
						НадоЗаписывать = Истина;
						СтрокаТабЧасти = ТаблицаНабора.Найти(Ссылка, ИмяКолонки);
					КонецЦикла;
				КонецЦикла;
				
				Если Метаданные.РегистрыБухгалтерии.Содержит(Движение) Тогда
					
					Для ИндексСубконто = 1 ПО ПараметрыЗамены[Движение.Имя + "Субконто"] Цикл
						Если ЕстьКорреспонденция Тогда
							СтрокаТабЧасти = ТаблицаНабора.Найти(Ссылка, "СубконтоДт"+ИндексСубконто);
							Пока СтрокаТабЧасти <> Неопределено Цикл
								СтрокаТабЧасти["СубконтоДт"+ИндексСубконто] = ПравильныйЭлемент;
								НадоЗаписывать = Истина;
								СтрокаТабЧасти = ТаблицаНабора.Найти(Ссылка, "СубконтоДт"+ИндексСубконто);
							КонецЦикла;
							СтрокаТабЧасти = ТаблицаНабора.Найти(Ссылка, "СубконтоКт"+ИндексСубконто);
							Пока СтрокаТабЧасти <> Неопределено Цикл
								СтрокаТабЧасти["СубконтоКт"+ИндексСубконто] = ПравильныйЭлемент;
								НадоЗаписывать = Истина;
								СтрокаТабЧасти = ТаблицаНабора.Найти(Ссылка, "СубконтоКт"+ИндексСубконто);
							КонецЦикла;								
						Иначе							
							СтрокаТабЧасти = ТаблицаНабора.Найти(Ссылка, "Субконто"+ИндексСубконто);
							Пока СтрокаТабЧасти <> Неопределено Цикл
								СтрокаТабЧасти["Субконто"+ИндексСубконто] = ПравильныйЭлемент;
								НадоЗаписывать = Истина;
								СтрокаТабЧасти = ТаблицаНабора.Найти(Ссылка, "Субконто"+ИндексСубконто);
							КонецЦикла;							
						КонецЕсли;						
					КонецЦикла;
					
					Если Ссылка.Метаданные() = Движение.ПланСчетов Тогда
						Для Каждого СтрокаТабЧасти ИЗ ТаблицаНабора Цикл
							Если ЕстьКорреспонденция Тогда
								Если СтрокаТабЧасти.СчетДт = Ссылка Тогда
									СтрокаТабЧасти.СчетДт = ПравильныйЭлемент;
									НадоЗаписывать = Истина;
								КонецЕсли;
								Если СтрокаТабЧасти.СчетКт = Ссылка Тогда
									СтрокаТабЧасти.СчетКт = ПравильныйЭлемент;
									НадоЗаписывать = Истина;
								КонецЕсли;
							Иначе
								Если СтрокаТабЧасти.Счет = Ссылка Тогда
									СтрокаТабЧасти.Счет = ПравильныйЭлемент;
									НадоЗаписывать = Истина;
								КонецЕсли;
							КонецЕсли;
						КонецЦикла;
					КонецЕсли;
				КонецЕсли;
				
				Если Метаданные.РегистрыРасчета.Содержит(Движение) Тогда
					СтрокаТабЧасти = ТаблицаНабора.Найти(Ссылка, "ВидРасчета");
					Пока СтрокаТабЧасти <> Неопределено Цикл
						СтрокаТабЧасти["ВидРасчета"] = ПравильныйЭлемент;
						НадоЗаписывать = Истина;
						СтрокаТабЧасти = ТаблицаНабора.Найти(Ссылка, "ВидРасчета");
					КонецЦикла;
				КонецЕсли;
				
				Если НадоЗаписывать Тогда
					НаборЗаписей.Загрузить(ТаблицаНабора);
					
					Если РазрешитьУстановкуЗначенияОбменДаннымиЗагрузкаИстина(НаборЗаписей) Тогда
						НаборЗаписей.ОбменДанными.Загрузка = Истина;	// Не все объекты имеют свойство "ОбменДанными".
					КонецЕсли;
					
					Попытка
						НаборЗаписей.Записать();
					Исключение
						СообщитьОбОшибкеПриЗаписи(ИнформацияОбОшибке());
						БылиИсключения = Истина;
						Если ВыполнятьВТранзакции Тогда
							Перейти ~ОТКАТ;
						КонецЕсли;
					КонецПопытки;
					
				КонецЕсли;
			КонецЦикла;
			
			Для Каждого Последовательность ИЗ Метаданные.Последовательности Цикл
				Если Последовательность.Документы.Содержит(СтрокаТаблицы.Метаданные) Тогда
					НадоЗаписывать = Ложь;
					НаборЗаписи = Последовательности[Последовательность.Имя].СоздатьНаборЗаписей();
					НаборЗаписи.Отбор.Регистратор.Установить(СтрокаТаблицы.Данные);
					НаборЗаписи.Прочитать();
					
					Если НаборЗаписи.Количество() > 0 Тогда
						
						Для Каждого Измерение ИЗ Последовательность.Измерения Цикл
							Если Измерение.Тип.СодержитТип(ТипЗнч(Ссылка)) И НаборЗаписи[0][Измерение.Имя]=Ссылка Тогда
								НаборЗаписи[0][Измерение.Имя] = ПравильныйЭлемент;
								НадоЗаписывать = Истина;
							КонецЕсли;
						КонецЦикла;					
						
						Если НадоЗаписывать Тогда
							
							Если РазрешитьУстановкуЗначенияОбменДаннымиЗагрузкаИстина(НаборЗаписи) Тогда
								НаборЗаписи.ОбменДанными.Загрузка = Истина;	// Не все объекты имеют свойство "ОбменДанными".
							КонецЕсли;
							
							Попытка
								НаборЗаписи.Записать();
							Исключение
								СообщитьОбОшибкеПриЗаписи(ИнформацияОбОшибке());
								БылиИсключения = Истина;
								Если ВыполнятьВТранзакции Тогда
									Перейти ~ОТКАТ;
								КонецЕсли;
							КонецПопытки;
							
						КонецЕсли;
						
					КонецЕсли;
					
				КонецЕсли;
			КонецЦикла;
			
		ИначеЕсли Метаданные.Справочники.Содержит(СтрокаТаблицы.Метаданные) Тогда
			
			Если ПараметрыЗамены.Объект = Неопределено Тогда
				ПараметрыЗамены.Объект = СтрокаТаблицы.Данные.ПолучитьОбъект();
			КонецЕсли;
			
			Если СтрокаТаблицы.Метаданные.Владельцы.Содержит(Ссылка.Метаданные()) И ПараметрыЗамены.Объект.Владелец = Ссылка Тогда
				ПараметрыЗамены.Объект.Владелец = ПравильныйЭлемент;
			КонецЕсли;
			
			Если СтрокаТаблицы.Метаданные.Иерархический И ПараметрыЗамены.Объект.Родитель = Ссылка Тогда
				ПараметрыЗамены.Объект.Родитель = ПравильныйЭлемент;
			КонецЕсли;
			
			Для Каждого Реквизит ИЗ СтрокаТаблицы.Метаданные.Реквизиты Цикл
				Если Реквизит.Тип.СодержитТип(ТипЗнч(Ссылка)) И ПараметрыЗамены.Объект[Реквизит.Имя] = Ссылка Тогда
					ПараметрыЗамены.Объект[Реквизит.Имя] = ПравильныйЭлемент;
				КонецЕсли;
			КонецЦикла;
			
			Для Каждого ТЧ ИЗ СтрокаТаблицы.Метаданные.ТабличныеЧасти Цикл
				Для Каждого Реквизит ИЗ ТЧ.Реквизиты Цикл
					Если Реквизит.Тип.СодержитТип(ТипЗнч(Ссылка)) Тогда
						СтрокаТабЧасти = ПараметрыЗамены.Объект[ТЧ.Имя].Найти(Ссылка, Реквизит.Имя);
						Пока СтрокаТабЧасти <> Неопределено Цикл
							СтрокаТабЧасти[Реквизит.Имя] = ПравильныйЭлемент;
							СтрокаТабЧасти = ПараметрыЗамены.Объект[ТЧ.Имя].Найти(Ссылка, Реквизит.Имя);
						КонецЦикла;
					КонецЕсли;
				КонецЦикла;
			КонецЦикла;
			
		ИначеЕсли Метаданные.ПланыВидовХарактеристик.Содержит(СтрокаТаблицы.Метаданные)
				  ИЛИ Метаданные.ПланыСчетов.Содержит(СтрокаТаблицы.Метаданные)
				  ИЛИ Метаданные.ПланыВидовРасчета.Содержит(СтрокаТаблицы.Метаданные)
				  ИЛИ Метаданные.Задачи.Содержит(СтрокаТаблицы.Метаданные)
				  ИЛИ Метаданные.БизнесПроцессы.Содержит(СтрокаТаблицы.Метаданные) Тогда
			
			Если ПараметрыЗамены.Объект = Неопределено Тогда
				ПараметрыЗамены.Объект = СтрокаТаблицы.Данные.ПолучитьОбъект();
			КонецЕсли;
						
			Для Каждого Реквизит ИЗ СтрокаТаблицы.Метаданные.Реквизиты Цикл
				Если Реквизит.Тип.СодержитТип(ТипЗнч(Ссылка)) И ПараметрыЗамены.Объект[Реквизит.Имя] = Ссылка Тогда
					ПараметрыЗамены.Объект[Реквизит.Имя] = ПравильныйЭлемент;
				КонецЕсли;
			КонецЦикла;
			
			Для Каждого ТЧ ИЗ СтрокаТаблицы.Метаданные.ТабличныеЧасти Цикл
				Для Каждого Реквизит ИЗ ТЧ.Реквизиты Цикл
					Если Реквизит.Тип.СодержитТип(ТипЗнч(Ссылка)) Тогда
						СтрокаТабЧасти = ПараметрыЗамены.Объект[ТЧ.Имя].Найти(Ссылка, Реквизит.Имя);
						Пока СтрокаТабЧасти <> Неопределено Цикл
							СтрокаТабЧасти[Реквизит.Имя] = ПравильныйЭлемент;
							СтрокаТабЧасти = ПараметрыЗамены.Объект[ТЧ.Имя].Найти(Ссылка, Реквизит.Имя);
						КонецЦикла;							
					КонецЕсли;
				КонецЦикла;
			КонецЦикла;	
			
		ИначеЕсли Метаданные.Константы.Содержит(СтрокаТаблицы.Метаданные) Тогда
			
			Константы[СтрокаТаблицы.Метаданные.Имя].Установить(ПравильныйЭлемент);
			
		ИначеЕсли Метаданные.РегистрыСведений.Содержит(СтрокаТаблицы.Метаданные) Тогда	
			
			СтруктураИзмерений = Новый Структура;
			НаборЗаписей = РегистрыСведений[СтрокаТаблицы.Метаданные.Имя].СоздатьНаборЗаписей();
			Для Каждого Измерение ИЗ СтрокаТаблицы.Метаданные.Измерения Цикл
				НаборЗаписей.Отбор[Измерение.Имя].Установить(СтрокаТаблицы.Данные[Измерение.Имя]);
				СтруктураИзмерений.Вставить(Измерение.Имя);
			КонецЦикла;
			
			Если СтрокаТаблицы.Метаданные.ПериодичностьРегистраСведений <> Метаданные.СвойстваОбъектов.ПериодичностьРегистраСведений.Непериодический Тогда
				НаборЗаписей.Отбор["Период"].Установить(СтрокаТаблицы.Данные.Период);
			КонецЕсли;
			НаборЗаписей.Прочитать();
			
			Если НаборЗаписей.Количество() = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			ТаблицаНабора = НаборЗаписей.Выгрузить();
			НаборЗаписей.Очистить();
			
			Если РазрешитьУстановкуЗначенияОбменДаннымиЗагрузкаИстина(НаборЗаписей) Тогда
				НаборЗаписей.ОбменДанными.Загрузка = Истина;	// Не все объекты имеют свойство "ОбменДанными".
			КонецЕсли;
			
			Если Не ВыполнятьВТранзакции Тогда
				НачатьТранзакцию();
			КонецЕсли;
			
			Попытка
				
				НаборЗаписей.Записать();
				
				Для Каждого Колонка ИЗ ТаблицаНабора.Колонки Цикл
					Если ТаблицаНабора[0][Колонка.Имя] = Ссылка Тогда
						ТаблицаНабора[0][Колонка.Имя] = ПравильныйЭлемент;
						Если СтруктураИзмерений.Свойство(Колонка.Имя) Тогда
							НаборЗаписей.Отбор[Колонка.Имя].Установить(ПравильныйЭлемент);
						КонецЕсли;
						
					КонецЕсли;
				КонецЦикла;
				
				НаборЗаписей.Загрузить(ТаблицаНабора);
				
				НаборЗаписей.Записать();
				
				Если Не ВыполнятьВТранзакции Тогда
					ЗафиксироватьТранзакцию();
				КонецЕсли; 
				
			Исключение
				
				СообщитьОбОшибкеПриЗаписи(ИнформацияОбОшибке());
				
				Если ВыполнятьВТранзакции Тогда
					БылиИсключения = Истина;
					Перейти ~ОТКАТ;
				Иначе
					ОтменитьТранзакцию();
				КонецЕсли;
				
			КонецПопытки;
			
		Иначе
			Сообщить("МО: " + "Ссылки типа """ + СтрокаТаблицы.Метаданные + """ не заменяются.");
		КонецЕсли;
		//ОбработкаПрерыванияПользователя();
	КонецЦикла;
	
	Если ПараметрыЗамены.Объект <> Неопределено Тогда
		
		Если РазрешитьУстановкуЗначенияОбменДаннымиЗагрузкаИстина(ПараметрыЗамены.Объект) Тогда
			ПараметрыЗамены.Объект.ОбменДанными.Загрузка = Истина;	// Не все объекты имеют свойство "ОбменДанными".
		КонецЕсли;
		
		Попытка
			ПараметрыЗамены.Объект.Записать();
		Исключение
			СообщитьОбОшибкеПриЗаписи(ИнформацияОбОшибке());
			БылиИсключения = Истина;
			Если ВыполнятьВТранзакции Тогда
				Перейти ~ОТКАТ;
			КонецЕсли;
		КонецПопытки;
	КонецЕсли;
	
~ОТКАТ:
	Если ВыполнятьВТранзакции Тогда
		Если БылиИсключения Тогда
			ОтменитьТранзакцию();
		Иначе
			//ОтменитьТранзакцию();	// .- МА! Для Отладки.
			ЗафиксироватьТранзакцию();
		КонецЕсли;	
	КонецЕсли;

	Возврат НЕ БылиИсключения;
	
КонецФункции

// Вкладка "Ссылки на Объект". Подготовить Таблицу НайденныеСсылки для последующей обработки.
// - Удалить Колонку Метаданные с Типом "Строка".
// - Добавить Колонку Метаданные с Типом "Метаданные".
// Это необходимо для обработки в функции ВыполнитьЗаменуЭлементов(...).
// 
Функция ТСсылкиПодготовитьТаблицуНайденныеСсылки(ТСсылкиСписок)
	
	ТСсылкиСписок.Колонки.Удалить("Метаданные");
	ТСсылкиСписок.Колонки.Добавить("Метаданные");
	Для Каждого Стр ИЗ ТСсылкиСписок Цикл
		мдДанных = Метаданные.НайтиПоТипу(ТипЗнч(Стр.Данные));
		Если Метаданные.НайтиПоТипу(ТипЗнч(Стр.Данные)) <> Неопределено Тогда
			Стр.Метаданные = мдДанных;
		Иначе
			Сообщить("МО: " + "МетаДанные для """ + Стр.Данные + """ не найдены. Обработка прервана.", СтатусСообщения.Важное);
			ТСсылкиСписок = Новый ТаблицаЗначений;
			Возврат Неопределено;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ТСсылкиСписок;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ВКЛАДКА "ДОПОЛНИТЕЛЬНО" - "СПРАВОЧНИК (ДОПОЛНИТЕЛЬНО)".
//

// Вкладка "Справочник (Дополнительно)". Выполнить ЦИКЛ УдалитьЛишнее/Наименование=Артикул+Наименование/НаименованиеПолное=Наименование.
//
Функция ТСправочникВыполнитьОбработкуСправочникаНаСервере(ТСправочникСписок, СправочникИзменяемыйРеквизит, СправочникНовоеЗначениеРеквизита, Действие) Экспорт
	
	Если ВыполнятьВТранзакции Тогда
		НачатьТранзакцию();
	КонецЕсли;
		
	Если Действие = "Наименования_ПоОКОПФ" Тогда
		ОКОПФ = ТСправочникСформироватьСписокОКОПФ();
	КонецЕсли;
	
	Отказ = Ложь;
	ЗначениеИндикатора = 0;
	КоличествоИзмененных = 0;
			
	Если Действие = "ИсключитьНеЧитаемыеСимволыИзСтроки" Тогда
		RegEXP_Инициализация();
	КонецЕсли;
	
	Для Каждого СтрокаСписка ИЗ ТСправочникСписок Цикл
			
		ЗначениеИндикатора = ЗначениеИндикатора + 1;
		
		Если НЕ СтрокаСписка.Включено Тогда
			Продолжить;
		КонецЕсли;
		
		Изменен = Ложь;
		ЗначениеРеквизита = ТСправочникВыполнитьОбработкуСправочникаНаСервереОднаСтрока(СтрокаСписка, СправочникИзменяемыйРеквизит, СправочникНовоеЗначениеРеквизита, Действие, Изменен, Отказ, ОКОПФ);
		
		Если Отказ Тогда
			Прервать;
		Иначе
			СтрокаСписка.Включено = Ложь;
			Если Изменен Тогда
				КоличествоИзмененных = КоличествоИзмененных + 1;
				СтрокаСписка.Изменен = Истина;
				СтрокаСписка.РеквизитНовоеЗначение = ЗначениеРеквизита;
			КонецЕсли;
		КонецЕсли;
			
	КонецЦикла;
	
	Если Действие = "ИсключитьНеЧитаемыеСимволыИзСтроки" Тогда
		RegExp = Неопределено;
	КонецЕсли;
	
	Если ВыполнятьВТранзакции Тогда
		Если НЕ Отказ Тогда
			//ОтменитьТранзакцию();	// .- МА! Отладка.
			ЗафиксироватьТранзакцию();
		Иначе
			ОтменитьТранзакцию();
		КонецЕсли
	КонецЕсли;
	
	РезультатВыполнения = Новый Структура;
	Если НЕ Отказ Тогда
		РезультатВыполнения.Вставить("Отказ", Ложь);
		РезультатВыполнения.Вставить("ЭлементОтказ", Неопределено);
	Иначе	
		РезультатВыполнения.Вставить("Отказ", Истина);
		РезультатВыполнения.Вставить("ЭлементОтказ", "№: " + ЗначениеИндикатора + ": " + СтрокаСписка.Элемент);
	КонецЕсли;
	
	РезультатВыполнения.Вставить("Изменено", КоличествоИзмененных);
	РезультатВыполнения.Вставить("Всего", ТСправочникСписок.Количество());
	РезультатВыполнения.Вставить("ТСправочникСписок", ТСправочникСписок);
		
	Возврат РезультатВыполнения;

КонецФункции

// Вкладка "Справочник (Дополнительно)". Выполнить СТРОКА ЦИКЛА УдалитьЛишнее/Наименование=Артикул+Наименование/НаименованиеПолное=Наименование.
//
Функция ТСправочникВыполнитьОбработкуСправочникаНаСервереОднаСтрока(СтрокаСписка, СправочникИзменяемыйРеквизит, СправочникНовоеЗначениеРеквизита, Действие, Изменен, Отказ, ОКОПФ)
	
	ОбъектИЗМ = ОбъектБДПолучитьОбъектИзСсылки(СтрокаСписка.Ссылка);
	Если ОбъектИЗМ = Неопределено Тогда
		Отказ = Истина;
		Изменен = Ложь;
		Возврат Неопределено;
	КонецЕсли;
			
	Если Действие = "УдалитьНедопустимыеСимволыXML" Тогда
		
		ЗначениеДоИзменения = ОбъектИЗМ[СправочникИзменяемыйРеквизит];
		
		ОбъектИЗМ[СправочникИзменяемыйРеквизит] = ЗаменитьНедопустимыеСимволыXML(ОбъектИЗМ[СправочникИзменяемыйРеквизит]);
		ОбъектИЗМ[СправочникИзменяемыйРеквизит] = СокрЛП(ОбъектИЗМ[СправочникИзменяемыйРеквизит]);
		
		Если ОбъектИЗМ[СправочникИзменяемыйРеквизит] = ЗначениеДоИзменения Тогда
			Изменен = Ложь;
			Возврат Неопределено;
		Иначе	
			Изменен = Истина;
		КонецЕсли;
		
	ИначеЕсли Действие = "ЧистыйСтроковыйРеквизит_БезЛишнихСимволов" Тогда
		
		ЗначениеДоИзменения = ОбъектИЗМ[СправочникИзменяемыйРеквизит];
		
		ОбъектИЗМ[СправочникИзменяемыйРеквизит] = ЗаменитьНедопустимыеСимволыXML(ОбъектИЗМ[СправочникИзменяемыйРеквизит]);
		ОбъектИЗМ[СправочникИзменяемыйРеквизит] = СокрЛП(ОбъектИЗМ[СправочникИзменяемыйРеквизит]);
		
		ОбъектИЗМ[СправочникИзменяемыйРеквизит] = ТСправочникОчиститьОтЛишнегоОднаСтрока(ОбъектИЗМ[СправочникИзменяемыйРеквизит]);
		ОбъектИЗМ[СправочникИзменяемыйРеквизит] = СокрЛП(ОбъектИЗМ[СправочникИзменяемыйРеквизит]);
		
		Если ОбъектИЗМ[СправочникИзменяемыйРеквизит] = ЗначениеДоИзменения Тогда
			Изменен = Ложь;
			Возврат Неопределено;
		Иначе	
			Изменен = Истина;
		КонецЕсли;
		
	ИначеЕсли Действие = "ИсключитьНеЧитаемыеСимволыИзСтроки" Тогда
		
		ЗначениеДоИзменения = ОбъектИЗМ[СправочникИзменяемыйРеквизит];
		
		ОбъектИЗМ[СправочникИзменяемыйРеквизит] = ЗаменитьНедопустимыеСимволыXML(ОбъектИЗМ[СправочникИзменяемыйРеквизит]);
		ОбъектИЗМ[СправочникИзменяемыйРеквизит] = СокрЛП(ОбъектИЗМ[СправочникИзменяемыйРеквизит]);
		
		Если RegExp = Неопределено Тогда
			Value = ЗаменитьНеЧитаемыеСимволыВСтроке(ОбъектИЗМ[СправочникИзменяемыйРеквизит]);	// Вариант "НЕТИПОВОЙ 1С".
		Иначе
			Value = ЗаменитьНечитаемыеСимволыRegExp(ОбъектИЗМ[СправочникИзменяемыйРеквизит]);	// Вариант "НЕТИПОВОЙ RegExp".
		КонецЕсли;
		ОбъектИЗМ[СправочникИзменяемыйРеквизит] = СокрЛП(Value);
		
		Если ОбъектИЗМ[СправочникИзменяемыйРеквизит] = ЗначениеДоИзменения Тогда
			Изменен = Ложь;
			Возврат Неопределено;
		Иначе	
			Изменен = Истина;
		КонецЕсли;
		
	ИначеЕсли Действие = "Реквизит_Значение" Тогда
		
		ЗначениеДоИзменения = ОбъектИЗМ[СправочникИзменяемыйРеквизит];
		
		ОбъектИЗМ[СправочникИзменяемыйРеквизит] = СправочникНовоеЗначениеРеквизита;
		
		Если ОбъектИЗМ[СправочникИзменяемыйРеквизит] = ЗначениеДоИзменения Тогда
			Изменен = Ложь;
			Возврат Неопределено;
		Иначе	
			Изменен = Истина;
		КонецЕсли;
		
	ИначеЕсли Действие = "НаименованиеПолное_НаименованиеИОписание" Тогда
		
		ЗначениеДоИзменения = ОбъектИЗМ[СправочникИзменяемыйРеквизит];
		
		ОбъектИЗМ[СправочникИзменяемыйРеквизит] = СокрЛП(ОбъектИЗМ.Наименование + " " + ОбъектИЗМ.Описание);
		
		Если ОбъектИЗМ[СправочникИзменяемыйРеквизит] = ЗначениеДоИзменения Тогда
			Изменен = Ложь;
			Возврат Неопределено;
		Иначе	
			Изменен = Истина;
		КонецЕсли;
		
	ИначеЕсли Действие = "Наименование_АртикулВНаименование" Тогда
		
		Если НЕ ЗначениеЗаполнено(ОбъектИЗМ.Артикул) Тогда
			Изменен = Ложь;
			Возврат Неопределено;
		Иначе	
			Изменен = Истина;
		КонецЕсли;
		
		ЗначениеДоИзменения = ОбъектИЗМ[СправочникИзменяемыйРеквизит];
		СледующийСимвол = "";
		
		Если (Найти(ОбъектИЗМ.Наименование, СокрЛП(ОбъектИЗМ.Артикул)) <> 1 ) Тогда
			
			хНаименование = СтрЗаменить(ОбъектИЗМ.Наименование, СокрЛП(ОбъектИЗМ.Артикул), "");
			СледующийСимвол = Лев(хНаименование, 1);
			хНаименование = СокрЛП(хНаименование);
			
			Если СледующийСимвол = " " Тогда
				
				ОбъектИЗМ[СправочникИзменяемыйРеквизит] = СокрЛП(ОбъектИЗМ.Артикул) + " " + хНаименование;
				
			Иначе
				Если СледующийСимвол = "*" ИЛИ СледующийСимвол = "+" ИЛИ СледующийСимвол = "-" ИЛИ СледующийСимвол = "_" ИЛИ СледующийСимвол = "=" ИЛИ СледующийСимвол = "/" ИЛИ СледующийСимвол = "\" 
					ИЛИ СледующийСимвол = "@" ИЛИ СледующийСимвол = "№" ИЛИ СледующийСимвол = "$" ИЛИ СледующийСимвол = "%" ИЛИ СледующийСимвол = "&" ИЛИ СледующийСимвол = "(" ИЛИ СледующийСимвол = ")" 
					ИЛИ СледующийСимвол = "!" ИЛИ СледующийСимвол = ":" ИЛИ СледующийСимвол = ";" ИЛИ СледующийСимвол = "'" ИЛИ СледующийСимвол = "?" ИЛИ СледующийСимвол = "," ИЛИ СледующийСимвол = "." 
					ИЛИ СледующийСимвол = "<" ИЛИ СледующийСимвол = ">" ИЛИ СледующийСимвол = "|" Тогда
					
					ОбъектИЗМ[СправочникИзменяемыйРеквизит] = СокрЛП(ОбъектИЗМ.Артикул) + хНаименование;
					
				Иначе
					
					ОбъектИЗМ[СправочникИзменяемыйРеквизит] = СокрЛП(ОбъектИЗМ.Артикул) + " " + хНаименование;
					
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		
		Если ОбъектИЗМ[СправочникИзменяемыйРеквизит] = ЗначениеДоИзменения Тогда
			Изменен = Ложь;
			Возврат Неопределено;
		Иначе	
			Изменен = Истина;
		КонецЕсли;
		
	ИначеЕсли Действие = "Наименование_НаименованиеБезАртикула" Тогда
		
		Если НЕ ЗначениеЗаполнено(ОбъектИЗМ.Артикул) Тогда
			Изменен = Ложь;
			Возврат Неопределено;
		Иначе	
			Изменен = Истина;
		КонецЕсли;
		
		ЗначениеДоИзменения = ОбъектИЗМ[СправочникИзменяемыйРеквизит];
		
		Если (Найти(ОбъектИЗМ.Наименование, СокрЛП(ОбъектИЗМ.Артикул)) > 0 ) Тогда
			ОбъектИЗМ[СправочникИзменяемыйРеквизит] = СокрЛП(СтрЗаменить(ОбъектИЗМ.Наименование, СокрЛП(ОбъектИЗМ.Артикул), ""));
		КонецЕсли;
		
		Если ОбъектИЗМ[СправочникИзменяемыйРеквизит] = ЗначениеДоИзменения Тогда
			Изменен = Ложь;
			Возврат Неопределено;
		Иначе	
			Изменен = Истина;
		КонецЕсли;
		
	ИначеЕсли Действие = "Наименования_ПоОКОПФ" Тогда	// Справочники "Контрагенты" и "Организации".
		
		ЗначениеДоИзменения = ОбъектИЗМ[СправочникИзменяемыйРеквизит];

		ОбъектИЗМ.Наименование = ТСправочникОчиститьОтЛишнегоОднаСтрока(ОбъектИЗМ.Наименование);

		хНаименование = СокрЛП(ОбъектИЗМ.Наименование);
		
		ПозПервыйПробел = Найти(хНаименование, " ");
		Слово1 = ВРег(СокрЛП(Лев(хНаименование, ПозПервыйПробел)));
		
		хНаименованиеБезСлово1 = СокрЛП((СтрЗаменить(хНаименование, Слово1, "")));
		Для Каждого Элемент ИЗ ОКОПФ Цикл
			
			Если Слово1 = Элемент.Ключ Тогда
				
				хНаименованиеБезСлово1 = СокрЛП(СтрЗаменить(хНаименованиеБезСлово1, " "+Элемент.Ключ+" ", " "));
				
				хНаименование = хНаименованиеБезСлово1 + " " + Элемент.Ключ;
				ОбъектИЗМ[СправочникИзменяемыйРеквизит] = хНаименование;
				
				Попытка
					ОбъектИЗМ.НаименованиеПолное = Элемент.Значение + " " + хНаименованиеБезСлово1;
				Исключение
				КонецПопытки;
				
				Попытка
					ОбъектИЗМ.НаименованиеСокращенное = Элемент.Ключ + " " + хНаименованиеБезСлово1;
				Исключение
				КонецПопытки;
				
				Прервать;
				
			КонецЕсли;
			
		КонецЦикла;
		
		Если ОбъектИЗМ[СправочникИзменяемыйРеквизит] = ЗначениеДоИзменения Тогда
			Изменен = Ложь;
			Возврат Неопределено;
		Иначе	
			Изменен = Истина;
		КонецЕсли;
		
		Попытка
			СтрокаСписка.НаименованиеПолное = ОбъектИЗМ.НаименованиеПолное;
		Исключение
		КонецПопытки;
		
		Попытка
			СтрокаСписка.НаименованиеСокращенное = ОбъектИЗМ.НаименованиеСокращенное;
		Исключение
		КонецПопытки;
		
	ИначеЕсли Действие = "НеиспользуемыеЭлементы_ПоискИУдаление" Тогда
			
		ОбъектИЗМ.УстановитьПометкуУдаления(Истина);
		Изменен = Истина;
		
	КонецЕсли;
		
	Если РазрешитьУстановкуЗначенияОбменДаннымиЗагрузкаИстина(ОбъектИЗМ) Тогда
		ОбъектИЗМ.ОбменДанными.Загрузка = Истина;	// Не все объекты имеют свойство "ОбменДанными".
	КонецЕсли;
	
	Попытка
		
		ОбъектИЗМ.Записать();
		СтрокаСписка.Элемент = Строка(ОбъектИЗМ.Ссылка);
		СтрокаСписка.Ссылка = ОбъектИЗМ.Ссылка;
		
	Исключение
		
		Отказ = Истина;
		Изменен = Ложь;
		Сообщить("МО: " + ОписаниеОшибки(), СтатусСообщения.ОченьВажное);
		СтрокаСписка.НаименованиеПолное = Неопределено;
		СтрокаСписка.НаименованиеСокращенное = Неопределено;
		Возврат Неопределено;
		
	КонецПопытки;
	
	Возврат ОбъектИЗМ[СправочникИзменяемыйРеквизит];
	
КонецФункции

// Вкладка "Справочник (Дополнительно)". Очистка Наименования. Одна строка.
//
Функция ТСправочникОчиститьОтЛишнегоОднаСтрока(хРеквизит)
	
	Возврат ОчиститьОтЛишнегоЗначение(хРеквизит);
		
КонецФункции

// Удалить символы типа Символы.НПП, ПС и др. подобные, а также "двойные" пробелы из наименования.
//
Функция ОчиститьОтЛишнегоЗначение(Знач хЗначение)
	
	хЗначение = СтрЗаменить(хЗначение,Символы.Таб	, " ");	// Табуляция.
	хЗначение = СтрЗаменить(хЗначение,Символы.ВТаб	, " ");	// Табуляция (вертикальная).
	хЗначение = СтрЗаменить(хЗначение,Символы.НПП	, " ");	// Неразрывный пробел.
	хЗначение = СтрЗаменить(хЗначение,Символы.ВК	, " ");	// Возврат Каретки.
	хЗначение = СтрЗаменить(хЗначение,Символы.ПФ	, " ");	// Перевод Формы (страницы).
	Если ЭтотОбъект.ЗаменятьСимволПС Тогда
		хЗначение = СтрЗаменить(хЗначение,Символы.ПС, " ");	// Перевод Строки.
	КонецЕсли;
	
	хЗначение = СтрЗаменить(хЗначение,"       "," ");
	хЗначение = СтрЗаменить(хЗначение,"      "," ");
	хЗначение = СтрЗаменить(хЗначение,"     "," ");
	хЗначение = СтрЗаменить(хЗначение,"    "," ");
	хЗначение = СтрЗаменить(хЗначение,"   "," ");
	хЗначение = СтрЗаменить(хЗначение,"  "," ");
	
	хЗначение = СтрЗаменить(хЗначение," * ","*");
	хЗначение = СтрЗаменить(хЗначение," х ","х");
	хЗначение = СтрЗаменить(хЗначение," x ","x");
	хЗначение = СтрЗаменить(хЗначение," * ","*");
	хЗначение = СтрЗаменить(хЗначение," = ","=");
	хЗначение = СтрЗаменить(хЗначение," - ","-");
	хЗначение = СтрЗаменить(хЗначение," ,",",");
	хЗначение = СтрЗаменить(хЗначение," .",".");
	хЗначение = СтрЗаменить(хЗначение,"( ","(");
	хЗначение = СтрЗаменить(хЗначение," )",")");
	хЗначение = СтрЗаменить(хЗначение,"[ ","[");
	хЗначение = СтрЗаменить(хЗначение," ]","]");
	хЗначение = СтрЗаменить(хЗначение,"{ ","{");
	хЗначение = СтрЗаменить(хЗначение," }","}");
	
	хЗначение = СокрЛП(хЗначение);
	
	Возврат хЗначение;
	
КонецФункции

// Функция (ТИПОВАЯ 1С), оставляющая в строке только допустимые для XML символы и цифры.
// 
// Возвращаемое значение:
//	Строка.
//
Функция ЗаменитьНедопустимыеСимволыXML(Знач Текст, СимволЗамены = " ") Экспорт
	
	Позиция = НайтиНедопустимыеСимволыXML(Текст);
	Пока Позиция > 0 Цикл
		ТекущийСимвол = Сред(Текст, Позиция, 1);
		Если КодСимвола(ТекущийСимвол) = 21 Тогда	// Параграф.
			Текст = СтрЗаменить(Текст, ТекущийСимвол, Символ(167));
			Позиция = НайтиНедопустимыеСимволыXML(Текст);
			Продолжить;
		КонецЕсли;
		Текст = СтрЗаменить(Текст, ТекущийСимвол, СимволЗамены);
		Позиция = НайтиНедопустимыеСимволыXML(Текст);
	КонецЦикла;
	
	Возврат Текст;
	
КонецФункции

// Функция (НЕТИПОВАЯ 1С), оставляющая в строке только читаемые(допустимые) для XML символы и цифры.
// 
// Возвращаемое значение:
//	Строка.
//
Функция ЗаменитьНеЧитаемыеСимволыВСтроке(Знач АнализируемыйТекст, ЗаменятьСимволы = Истина, СимволЗамены = " ")
	Перем ЧитаемыеСимволы, ИтоговаяСтрока;
	
	// Читаемые символы.
	ЧитаемыеСимволы = ПолучитьЧитаемыеСимволы(Ложь);
	
	// Формирование результирующей строки.
	ИтоговаяСтрока = "";
	Для НомерСимвола = 1 ПО СтрДлина(АнализируемыйТекст) Цикл
		ТекущийСимвол = Сред(АнализируемыйТекст, НомерСимвола, 1);
		// Заменяемые символы. Системный набор значений: "Символы":
		Если ТекущийСимвол = Символы.ВК ИЛИ ТекущийСимвол = Символы.ВТаб ИЛИ ТекущийСимвол = Символы.НПП 
			ИЛИ (ЭтотОбъект.ЗаменятьСимволПС И ТекущийСимвол = Символы.ПС) ИЛИ ТекущийСимвол = Символы.ПФ ИЛИ ТекущийСимвол = Символы.Таб Тогда
			ТекущийСимвол = СимволЗамены;
		КонецЕсли;
		Если КодСимвола(ТекущийСимвол) = 21 Тогда	// Параграф.
			ТекущийСимвол = Символ(167);
		КонецЕсли;
		Если Найти(ЧитаемыеСимволы, ТекущийСимвол) > 0 Тогда
			ИтоговаяСтрока = ИтоговаяСтрока + ТекущийСимвол;
		Иначе
			Если ЗаменятьСимволы Тогда
				ИтоговаяСтрока = ИтоговаяСтрока + СимволЗамены;
			Иначе
				// Сокращение строки на символ.
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ИтоговаяСтрока;
	
КонецФункции

// Функция (НЕТИПОВАЯ REGEXP), инициализация.
// 
// Возвращаемое значение:
//	Строка.
//
Функция RegEXP_Инициализация()
	Перем ЧитаемыеСимволы;
	
	// Читаемые символы.
	ЧитаемыеСимволы = ПолучитьЧитаемыеСимволы(Истина);
	
	ПолучитьCOMОбъектREGEXP(ЧитаемыеСимволы, Ложь, Истина, Ложь);
	
КонецФункции

Функция ПолучитьЧитаемыеСимволы(ИнициализацияRegEXP)
	Перем Латиница, Кирилица, БеларусА, УкраинаА, Греческие, Цифры, СпециальныеСимволы;
	Перем ДвойнаяКавычка, ОдинарнаяКавычка, АпострофОбратный, АвторскоеПраво, Зарезервировано;
	Перем ТоварныйЗнак, ШирокоеТире, ДенежныеСимволы, ДробныеСимволы, СимволыСтепени, ПрочиеСимволы;
	Перем ЧитаемыеСимволы;
	
	// Читаемые символы.
	Латиница = "ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyz";
	Кирилица = "АБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯабвгдеёжзийклмнопрстуфхцчшщъыьэюя";
	БеларусА = "АаБбВвГгДдЕеЁёЖжЗзІіЙйКкЛлМмНнОоПпРрСсТтУуЎўФфХхЦцЧчШшЫыЬьЭэЮюЯя";
	УкраинаА = "АаБбВвГгҐґДдЕеЄєЖжЗзИиІіЇїЙйКкЛлМмНнОоПпРрСсТтУуФфХхЦцЧчШшЩщЬьЮюЯя";
	Греческие = "ΑΒΓΔΕΖΗΘΙΚΛΜΝΞΟΠΡΣΤΥΦΧΨΩαβγδεζηθικλμνξοπρστυφχψω";
	Цифры = "0123456789";
	СпециальныеСимволы = "~`!@#$%^&*(){}[]_-=+\|/*:;.<>?,№«» ";
	ДвойнаяКавычка = "^""";
	ОдинарнаяКавычка = "^'";
	АпострофОбратный = "^" + Символ(769);	// КодСимвола 769. Обратный для символа на букве "Ё".
	АвторскоеПраво = "^©";					// КодСимвола 169. "Copyright" - латинская буква C в окружности - авторское право.
	Зарезервировано = "^®"; 				// КодСимвола 174. "Registered" - латинская буква R в окружности - товарный знак.
	ТоварныйЗнак = "^™";					// Верхний  индекс ТМ.
	ШирокоеТире = "^—";						// КодСимвола 8212.
	ДенежныеСимволы = "^¤^ք^$^¢^€^£^¥";		// Денежная единица, Рубль, Доллар, Цент, Евро, Фунт стерлингов, Иена или юань. Код символа "ք" = 1412.
	ДробныеСимволы = "^½^¼^¾";				// Дроби: 1/2, 1/4, 3/4.
	СимволыСтепени = "^¹^²^³";				// Степени: 1, 2, 3
	ПрочиеСимволы = "^°^±^×^÷^Ø^ƒ^µ^"+Символ(167);	// Градус, Плюс/Минус, Знак умножения, Знак деления, Диаметр, Знак функции, Микро, Параграф.
	
	ЧитаемыеСимволы = "[";
	Если ИнициализацияRegEXP Тогда
		ЧитаемыеСимволы = ЧитаемыеСимволы + "^0-9^a-z^A-Z^а-я^А-Я^Ё^ё^Α-Ω^α-ω";	// Цифры + Латиница + Кирилица + Греческие.
		ЧитаемыеСимволы = ЧитаемыеСимволы + БеларусА + УкраинаА;
		ЧитаемыеСимволы = ЧитаемыеСимволы + "^~^`^!^@^#^\$^%^\^^&^\*^\(^\)^\{^\}^\[^\]^_^\-^=^\+^\\^\|^/^\*^:^;^\.^<^>^\?^,^№^«^»^ ";	// СпециальныеСимволы.
		ЧитаемыеСимволы = ЧитаемыеСимволы + ДвойнаяКавычка + ОдинарнаяКавычка + АпострофОбратный + АвторскоеПраво + Зарезервировано + ТоварныйЗнак;
		ЧитаемыеСимволы = ЧитаемыеСимволы + ШирокоеТире + ДенежныеСимволы + ДробныеСимволы + СимволыСтепени + ПрочиеСимволы;
	Иначе
		ЧитаемыеСимволы = ЧитаемыеСимволы + Цифры+ Латиница + Кирилица + Греческие;
		ЧитаемыеСимволы = ЧитаемыеСимволы + БеларусА + УкраинаА;
		ЧитаемыеСимволы = ЧитаемыеСимволы + СпециальныеСимволы;
		ЧитаемыеСимволы = ЧитаемыеСимволы + ДвойнаяКавычка + ОдинарнаяКавычка + АпострофОбратный + АвторскоеПраво + Зарезервировано + ТоварныйЗнак;
		ЧитаемыеСимволы = ЧитаемыеСимволы + ШирокоеТире + ДенежныеСимволы + ДробныеСимволы + СимволыСтепени + ПрочиеСимволы;
	КонецЕсли;
	Если НЕ ЭтотОбъект.ЗаменятьСимволПС Тогда
		ЧитаемыеСимволы = ЧитаемыеСимволы + Символы.ПС;
	КонецЕсли;
	ЧитаемыеСимволы = ЧитаемыеСимволы + "]";
	
	Возврат ЧитаемыеСимволы;
	
КонецФункции

// Evg-Lylyk: http://infostart.ru/public/64222/
//
Процедура ПолучитьCOMОбъектREGEXP(Шаблон, ИскатьДоПервогоСовпадения = Истина, МногоСтрок = Истина, ИгнорироватьРегистр = Истина)

	Если RegExp = Неопределено Тогда //Нужна инициализация
		Попытка
	        RegExp = Новый COMОбъект("VBScript.RegExp");    // создаем объект для работы с регулярными выражениями
		Исключение
		    RegExp = Неопределено;
			Возврат;
		КонецПопытки;
    КонецЕсли;

    //Заполняем данные
    RegExp.MultiLine = МногоСтрок;                  // истина — текст многострочный, ложь — одна строка
    RegExp.Global = НЕ ИскатьДоПервогоСовпадения;   // истина — поиск по всей строке, ложь — до первого совпадения
    RegExp.IgnoreCase = ИгнорироватьРегистр;        // истина — игнорировать регистр строки при поиске
    RegExp.Pattern = Шаблон;                        // шаблон (регулярное выражение)
	
КонецПроцедуры

// Функция (НЕТИПОВАЯ REGEXP), оставляющая в строке только читаемые(допустимые) для XML символы и цифры.
// 
// Возвращаемое значение:
//	Строка.
//
Функция ЗаменитьНечитаемыеСимволыRegExp(Знач АнализируемыйТекст, ЗаменятьСимволы = Истина, СимволЗамены = " ")
	
	РезультатПроверки = Истина;
	Если НЕ RegExp.Test(АнализируемыйТекст) Тогда
		Возврат АнализируемыйТекст;
	КонецЕсли;
	
	// Формирование результирующей строки.
	ИтоговаяСтрока = АнализируемыйТекст;
	
	РезультатАнализаСтроки = RegExp.Execute(АнализируемыйТекст);
	
	Для Каждого Результат ИЗ РезультатАнализаСтроки Цикл
		ТекущийСимвол = Результат.Value;
		Если КодСимвола(ТекущийСимвол) = 21 Тогда	// Параграф.
			ИтоговаяСтрока = СтрЗаменить(ИтоговаяСтрока, ТекущийСимвол, Символ(167));
			Продолжить;
		КонецЕсли;
		Если ЗаменятьСимволы Тогда
			// Замена символа в строке.
			ИтоговаяСтрока = СтрЗаменить(ИтоговаяСтрока, ТекущийСимвол, СимволЗамены);
		Иначе
			// Сокращение строки на символ.
			ИтоговаяСтрока = СтрЗаменить(ИтоговаяСтрока, ТекущийСимвол, "");
		КонецЕсли;
	КонецЦикла;
	
	Возврат ИтоговаяСтрока;
	
КонецФункции

// Вкладка "Справочник (Дополнительно)". Формирование структуры ОКОПФ.
//
Функция ТСправочникСформироватьСписокОКОПФ()
	
	ОКОПФ = Новый Структура;
	ОКОПФ.Вставить("АО",	"Акционерное Общество");
	ОКОПФ.Вставить("АУ",	"Автономное учреждение");
	ОКОПФ.Вставить("ГОУ",	"Государственное образовательное учреждение");
	ОКОПФ.Вставить("ГУ",	"Государственное учреждение");
	ОКОПФ.Вставить("ГУП",	"Государственное унитарное предприятие");
	ОКОПФ.Вставить("ЗАО",	"Закрытое акционерное общество");
	ОКОПФ.Вставить("ИП",	"Индивидуальный предприниматель");
	ОКОПФ.Вставить("ИЧП",	"Индивидуально-частный предприниматель");
	ОКОПФ.Вставить("МУП",	"Муниципальное унитарное предприятие");
	ОКОПФ.Вставить("НКО",	"Некоммерческая организация");
	ОКОПФ.Вставить("НОУ",	"Негосударственное образовательное учреждение");
	ОКОПФ.Вставить("ПБОЮЛ",	"Предприниматель без образования юридического лица");
	ОКОПФ.Вставить("ПИФ",	"Паевой инвестиционный фонд");
	ОКОПФ.Вставить("ОАО",	"Открытое акционерное общество");
	ОКОПФ.Вставить("ООО",	"Общество с ограниченной ответственностью");
	ОКОПФ.Вставить("ТОО",	"Полное товарищество");
	ОКОПФ.Вставить("ТСЖ",	"Товарищество собственников жилья");
	ОКОПФ.Вставить("ФГУ",	"Федеральное государственное учреждение");
	ОКОПФ.Вставить("ФГУП",	"Федеральное государственное унитарное предприятие");
	ОКОПФ.Вставить("ЧП",	"Частный предприниматель");
	
	Возврат ОКОПФ;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ВКЛАДКА "ДОПОЛНИТЕЛЬНО" - "ДОКУМЕНТ (ДОПОЛНИТЕЛЬНО)".
//

// Вкладка "Документ дополнительно". Поле ДадаНач.
//
Функция ТДокументДата_НАЧ_ПриИзмененииНаСервере(ОбъектБД, ДатаНач, ДатаКон) Экспорт
	
	мдОбъектаБД = ОбъектБД.Метаданные();
	
	Если мдОбъектаБД.ПериодичностьНомера = Метаданные.СвойстваОбъектов.ПериодичностьНомераДокумента.Год Тогда
		
		ДатаКон = КонецГода(ДатаНач);
		
		Если ДатаНач <> НачалоГода(ДатаНач) Тогда
			Возврат "Выбрана начальная дата: " + ДатаНач + "
			|Это не соответствует начальной дате Периодичности документов: " + НачалоГода(ДатаНач) + "
			|
			|БУДЬТЕ ВНИМАТЕЛЬНЫ ПРИ НАЗНАЧЕНИИ НОВОГО ПРЕФИКСА И НАЧАЛЬНОГО НОМЕРА ДОКУМЕНТОВ.
			|
			|Рекомендуется Префикс, не используемый при штатной нумерации документов.";
		КонецЕсли;
		
	ИначеЕсли мдОбъектаБД.ПериодичностьНомера = Метаданные.СвойстваОбъектов.ПериодичностьНомераДокумента.Квартал Тогда
		
		ДатаКон = КонецКвартала(ДатаНач);
		
		Если ДатаНач <> НачалоКвартала(ДатаНач) Тогда
			Возврат "Выбрана начальная дата: " + ДатаНач + "
			|Это не соответствует начальной дате Периодичности документов: " + НачалоКвартала(ДатаНач) + "
			|
			|БУДЬТЕ ВНИМАТЕЛЬНЫ ПРИ НАЗНАЧЕНИИ НОВОГО ПРЕФИКСА И НАЧАЛЬНОГО НОМЕРА ДОКУМЕНТОВ.
			|
			|Рекомендуется Префикс, не используемый при штатной нумерации документов.";
		КонецЕсли;
		
	ИначеЕсли мдОбъектаБД.ПериодичностьНомера = Метаданные.СвойстваОбъектов.ПериодичностьНомераДокумента.Месяц Тогда
		
		ДатаКон = КонецМесяца(ДатаНач);
		
		Если ДатаНач <> НачалоМесяца(ДатаНач) Тогда
			Возврат "Выбрана начальная дата: " + ДатаНач + "
			|Это не соответствует начальной дате Периодичности документов: " + НачалоМесяца(ДатаНач) + "
			|
			|БУДЬТЕ ВНИМАТЕЛЬНЫ ПРИ НАЗНАЧЕНИИ НОВОГО ПРЕФИКСА И НАЧАЛЬНОГО НОМЕРА ДОКУМЕНТОВ.
			|
			|Рекомендуется Префикс, не используемый при штатной нумерации документов.";
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

// Вкладка "Документ дополнительно". Получить начальное значение Номера.
//
Функция ТДокументПрефиксНомерНовыйНаСервере(ОбъектБД, Знач ПрефиксНовый, Знач ДатаНач, Знач ДатаКон) Экспорт
	
	Номер = 0;
	ПрефиксНовыйДлина = СтрДлина(СокрЛП(ПрефиксНовый));
	
	мдОбъектаБД = ОбъектБД.Метаданные();
	Если мдОбъектаБД.ПериодичностьНомера = Метаданные.СвойстваОбъектов.ПериодичностьНомераДокумента.Год Тогда
		ДатаНачЗапроса = НачалоГода(ДатаНач);
	ИначеЕсли мдОбъектаБД.ПериодичностьНомера = Метаданные.СвойстваОбъектов.ПериодичностьНомераДокумента.Квартал Тогда
		ДатаНачЗапроса = НачалоКвартала(ДатаНач);
	ИначеЕсли мдОбъектаБД.ПериодичностьНомера = Метаданные.СвойстваОбъектов.ПериодичностьНомераДокумента.Месяц Тогда
		ДатаНачЗапроса = НачалоМесяца(ДатаНач);
	КонецЕсли;
	
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Документ.Номер КАК Номер,
		|	ПОДСТРОКА(Документ.Номер,1," + ПрефиксНовыйДлина + ") КАК ПРЕФИКСНОМЕРА
		|ИЗ
		|	Документ." + ОбъектБД.МетаДанные().Имя + " КАК Документ
		|ГДЕ
		|	Документ.Дата МЕЖДУ &ДатаНач И &ДатаКон
		|	И Номер ПОДОБНО &ПрефиксНовый
		|УПОРЯДОЧИТЬ ПО
		|	Номер УБЫВ";

	Запрос.УстановитьПараметр("ДатаНач", ДатаНачЗапроса);
	Запрос.УстановитьПараметр("ДатаКон", ДатаКон);
	Запрос.УстановитьПараметр("ПрефиксНовый", ПрефиксНовый+"%");

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если Найти(СокрЛП(ВРег(ВыборкаДетальныеЗаписи.Номер)), СокрЛП(ВРег(ПрефиксНовый))) > 0 Тогда
			Номер = Сред(СокрЛП(ВыборкаДетальныеЗаписи.Номер), ПрефиксНовыйДлина + 2);
		КонецЕсли;
		Прервать;
	КонецЦикла;
	
	Попытка
		Номер = Число(Номер);
	Исключение
		Номер = 0;
	КонецПопытки;

	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	
	Если Номер < 0 Тогда
		Номер = 0
	КонецЕсли;
	
	Возврат Номер;
	
КонецФункции

// Вкладка "Документ дополнительно". Проверка существования документа с НомерНач.
//
Функция ТДокументПроверитьСуществованиеДокументаСНомеромНач(ОбъектБД, НомерНач, ПрефиксНовый, ДатаКон) Экспорт
	
	ДокументСНомеромНач = Неопределено;
	
	НомерСтрокой = СокрЛП(СтрЗаменить(Формат(НомерНач,"ЧЦ=10; ЧВН="), Символы.НПП, ""));
	НомерСтрокой = ""+ПрефиксНовый+Сред(НомерСтрокой,СтрДлина(ПрефиксНовый));
	
	ДокументСНомеромНач = Документы[ОбъектБД.МетаДанные().Имя].НайтиПоНомеру(НомерСтрокой, ДатаКон);
	
	Если НЕ ЗначениеЗаполнено(ДокументСНомеромНач) Тогда
		ДокументСНомеромНач = Неопределено;
	КонецЕсли;
	
	Возврат ДокументСНомеромНач;
	
КонецФункции

// Вкладка "Документ дополнительно". Найти Документы.
//
Функция ТДокументНайтиДокументыНаСервере(ОбъектБД, Знач ПрефиксОрганизация, Знач ПрефиксТекущий, Знач ПрефиксИсключение, Знач ДатаНач, Знач ДатаКон) Экспорт
	
	Если ДатаКон = Дата("00010101") Тогда
		ДатаКон = ТекущаяДата();
	КонецЕсли;
	
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	Запрос = Новый Запрос;
	Запрос.Текст = "
		|ВЫБРАТЬ
		|	ОбъектБазы.Ссылка
		|ИЗ
		|Документ."+ОбъектБД.Метаданные().Имя+" КАК ОбъектБазы
		|ГДЕ
		|	ОбъектБазы.Дата МЕЖДУ &ДатаНач И &ДатаКон";

	Запрос.УстановитьПараметр("ДатаНач", НачалоДня(ДатаНач));
	Запрос.УстановитьПараметр("ДатаКон", КонецДня(ДатаКон));

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	
	ТДокументСписок.Очистить();
	
	мПрефиксыИсключения = Новый Массив;
	мПрефиксыИсключения = РазложитьСтрокуВМассивПодстрок(ПрефиксИсключение, ";");
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Если Найти(ВыборкаДетальныеЗаписи.Ссылка.Номер, ПрефиксТекущий) = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Попытка
			Если ЗначениеЗаполнено(ПрефиксОрганизация) И НЕ ВыборкаДетальныеЗаписи.Ссылка.Организация  = ПрефиксОрганизация Тогда		// Префиксы документов используются (как правило) для организаций.
				Продолжить;
			КонецЕсли;
		Исключение
			// Нет реквизита "Организация".
			// Поэтому в качестве вспомогательного средства фильтрации необходимо использовать "ПрефиксИсключение".
			// см. Модуль Формы.
		КонецПопытки;
		
		Если ЗначениеЗаполнено(ПрефиксИсключение) Тогда
			
			Найдено = Ложь;
			Для Каждого ЭлементМассива ИЗ мПрефиксыИсключения Цикл
				
				Если Найти(ВыборкаДетальныеЗаписи.Ссылка.Номер, ЭлементМассива) > 0 Тогда
					Найдено = Истина;
					Прервать;
				КонецЕсли;
				
			КонецЦикла;
			
			Если Найдено Тогда
				Продолжить;
			КонецЕсли;
			
		КонецЕсли;
		
		СтрокаТ = ТДокументСписок.Добавить();
		СтрокаТ.ДокументТек = ВыборкаДетальныеЗаписи.Ссылка;
		СтрокаТ.ПредставлениеТек = Строка(ВыборкаДетальныеЗаписи.Ссылка);
		
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	
	Возврат ТДокументСписок;
	
КонецФункции

// Вкладка "Документ дополнительно". Перенумеровать документы.
//
Функция ТДокументПеренумероватьДокументыНаСервере(ОбъектБД, ДатаНач, ДатаКон, ПрефиксНовый, НомерНач) Экспорт
	
	мдОбъектаБД	= ОбъектБД.Метаданные();
	
	Если ВыполнятьВТранзакции Тогда
		НачатьТранзакцию();
	КонецЕсли;
	
	Отказ = Ложь;
	ИзменениеОбъектаБД = Ложь;

	ПрефиксНовый = СокрЛП(ПрефиксНовый);
	Номер = НомерНач;
	Если мдОбъектаБД.ПериодичностьНомера = Метаданные.СвойстваОбъектов.ПериодичностьНомераДокумента.Год Тогда
		ПериодНач = НачалоГода(ДатаНач);
	ИначеЕсли мдОбъектаБД.ПериодичностьНомера = Метаданные.СвойстваОбъектов.ПериодичностьНомераДокумента.Квартал Тогда
		ПериодНач = НачалоКвартала(ДатаНач);
	ИначеЕсли мдОбъектаБД.ПериодичностьНомера = Метаданные.СвойстваОбъектов.ПериодичностьНомераДокумента.Месяц Тогда
		ПериодНач = НачалоМесяца(ДатаНач);
	КонецЕсли;
	Для Каждого Стр ИЗ ТДокументСписок Цикл
		Если НЕ Стр.Включено Тогда
			Продолжить;
		КонецЕсли;
		
		Было = Строка(Стр.ДокументТек);
		Если Стр.ДокументТек = ОбъектБД Тогда
			ИзменениеОбъектаБД = Истина;
		КонецЕсли;
		
		Если ТипЗнч(ОбъектБД.Номер) = Тип("Строка") Тогда
			Если мдОбъектаБД.ПериодичностьНомера = Метаданные.СвойстваОбъектов.ПериодичностьНомераДокумента.Год Тогда
				Если ПериодНач <> НачалоГода(Стр.ДокументТек.Дата) Тогда
					ПериодНач = НачалоГода(Стр.ДокументТек.Дата);
					Номер = 1;
				КонецЕсли;
			ИначеЕсли мдОбъектаБД.ПериодичностьНомера = Метаданные.СвойстваОбъектов.ПериодичностьНомераДокумента.Квартал Тогда
				ПериодНач = НачалоКвартала(Стр.ДокументТек.Дата);
				Если ПериодНач <> НачалоКвартала(Стр.ДокументТек.Дата) Тогда
					ПериодНач = НачалоКвартала(Стр.ДокументТек.Дата);
					Номер = 1;
				КонецЕсли;
			ИначеЕсли мдОбъектаБД.ПериодичностьНомера = Метаданные.СвойстваОбъектов.ПериодичностьНомераДокумента.Месяц Тогда
				ПериодНач = НачалоМесяца(Стр.ДокументТек.Дата);
				Если ПериодНач <> НачалоМесяца(Стр.ДокументТек.Дата) Тогда
					ПериодНач = НачалоМесяца(Стр.ДокументТек.Дата);
					Номер = 1;
				КонецЕсли;
			КонецЕсли;
			НомерСтрокой = СокрЛП(СтрЗаменить(Формат(Номер,"ЧЦ=10; ЧВН="), Символы.НПП, ""));
			
			Док = Стр.ДокументТек.ПолучитьОбъект();
			Док.Номер = ""+ПрефиксНовый+Сред(НомерСтрокой,СтрДлина(ПрефиксНовый));
			
			Номер = Номер + 1;
		Иначе
			Сообщить("МО: " + "Для """ + Стр.ДокументТек + """ новый номер не установлен.", СтатусСообщения.Важное);
		КонецЕсли;
		
		Если РазрешитьУстановкуЗначенияОбменДаннымиЗагрузкаИстина(Док) Тогда
			Док.ОбменДанными.Загрузка = Истина;	// Не все объекты имеют свойство "ОбменДанными".
		КонецЕсли;
			
		Попытка
			Док.Записать(РежимЗаписиДокумента.Запись);
		Исключение
			Отказ = Истина;
			Сообщить("МО: " + ОписаниеОшибки()+"
			|- Возможно в Периоде Нумерации документа существует документ с формируемым № "+Док.Номер+".
			|1. Исправьте период;
			|2. Произведите поиск документов;
			|3. Попытайтесь вновь перенумеровать документы.
			|или используйте другой Префикс.
			|
			|- Возможно установлена дата запрета изменения данных.
			|1. Необходимо изменить дату запрета;
			|2. Произвести поиск документов;
			|3. Попытайтесь вновь перенумеровать документы.");
			Прервать;
		КонецПопытки;
		
		Стр.Включено = Ложь;
		Стр.ДокументБыло = Было;
		Стр.ДокументТек = Док.Ссылка;
		Стр.ПредставлениеТек = Строка(Док.Ссылка);
		
	КонецЦикла;
	
	Если ВыполнятьВТранзакции Тогда
		Если НЕ Отказ Тогда
			//ОтменитьТранзакцию();	// .- МА! Отладка.
			ЗафиксироватьТранзакцию();
		Иначе
			ОтменитьТранзакцию();
		КонецЕсли
	КонецЕсли;
	
	стрВозврат = Новый Структура;
	стрВозврат.Вставить("Таблица", ТДокументСписок);
	стрВозврат.Вставить("ИзменениеОбъектаБД",ИзменениеОбъектаБД);
	
	Возврат стрВозврат;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ВКЛАДКА "ДОПОЛНИТЕЛЬНО". "ДОКУМЕНТ (ДОПОЛНИТЕЛЬНО) ПРОВЕДЕНИЕ".
//

// Вкладка "Документ дополнительно". Проведение документов. Заполнение списка видов документов.
//
Функция ТДокументПроведениеЗаполнитьСписокВидовДокументов(ДокументСписокВидов, Организация) Экспорт
	
	ДокументСписокВидов.Очистить();
	
	ФильтрПоОрганизации = НЕ Метаданные.Справочники.Найти("Организации") = Неопределено И ЗначениеЗаполнено(Организация);
	
	Для Каждого мдДокумента ИЗ Метаданные.Документы Цикл
		
		Если НЕ мдДокумента.Проведение = Метаданные.СвойстваОбъектов.Проведение.Разрешить Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = ДокументСписокВидов.Добавить();
		
		НоваяСтрока.Пометка = Истина;
		Если ФильтрПоОрганизации И мдДокумента.Реквизиты.Найти("Организация") = Неопределено Тогда
			НоваяСтрока.Пометка = Ложь;
		КонецЕсли;
		
		Если мдДокумента.Реквизиты.Найти("Организация") = Неопределено Тогда
			НоваяСтрока.Комментарий = "Реквизит 'Организация' отсутствует";
		КонецЕсли;
		
		// Документы, у которых проведение разрешено или ЧекККМ.
		Если мдДокумента.Имя = "ЧекККМ" ИЛИ мдДокумента.Имя = "ЧекККМВозврат" Тогда	// Чеки ККМ не проводить! Нецелесобразно. ФИСКАЛЬНЫЙ РЕГИСТРАТОР.
			НоваяСтрока.Пометка = Ложь;
		КонецЕсли;
		
		НоваяСтрока.Значение = мдДокумента.Имя;
		НоваяСтрока.Представление = мдДокумента.Представление();
		
	КонецЦикла;	
	ДокументСписокВидов.Сортировать("Представление");
	
	Возврат ДокументСписокВидов;
	
КонецФункции

// Вкладка "Документ дополнительно". Проведение документов. Формирование таблицы документов для проведения по выбранным видам документов.
//
Функция ТДокументПолучитьТаблицуДокументовДляПроведения(ДатаНачала, ДатаОкончания, Организация, ТДокументСписокВидов, Проводить)
	
	тзДокументов = Новый ТаблицаЗначений;
	
	ФильтрПоОрганизации = НЕ Метаданные.Справочники.Найти("Организации") = Неопределено И ЗначениеЗаполнено(Организация);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "";
	
	НПП = 0;
	Для Каждого ВидДокумента ИЗ ТДокументСписокВидов Цикл
		
		Если НЕ ВидДокумента.Пометка Тогда
			Продолжить;
		КонецЕсли;
		
		Если ФильтрПоОрганизации И Метаданные.Документы[ВидДокумента.Значение].Реквизиты.Найти("Организация") = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Если НПП > 0 Тогда
			Запрос.Текст = Запрос.Текст + "
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|"
		КонецЕсли;
		
		НПП = НПП + 1;
		Запрос.Текст = Запрос.Текст + "ВЫБРАТЬ
		|	ДокументПроведенный.Ссылка КАК Ссылка,
		|	ДокументПроведенный.МоментВремени КАК МоментВремени
		|ИЗ
		|	Документ." + ВидДокумента.Значение + " КАК ДокументПроведенный
		|ГДЕ";
		
		Если Проводить = "Проведенные" Тогда
			Запрос.Текст = Запрос.Текст + "
			|	ДокументПроведенный.Проведен = ИСТИНА
			|	И ДокументПроведенный.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания";
		ИначеЕсли  Проводить = "НеПроведенные" Тогда
			Запрос.Текст = Запрос.Текст + "
			|	ДокументПроведенный.Проведен = ЛОЖЬ
			|	И ДокументПроведенный.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания";
		Иначе
			// ВСЕ.
			Запрос.Текст = Запрос.Текст + "
			|	ДокументПроведенный.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания";
		КонецЕсли;
		Запрос.Текст = Запрос.Текст + "
		|	И НЕ ДокументПроведенный.ПометкаУдаления";
		
		Запрос.Текст = Запрос.Текст + "
		|&ФильтрПоОрганизации";
		
	КонецЦикла;
	
	Если Запрос.Текст = "" Тогда
		Возврат тзДокументов;
	КонецЕсли; 
	
	Запрос.Текст = Запрос.Текст + "
	|УПОРЯДОЧИТЬ ПО
	|	МоментВремени";
	
	Если ФильтрПоОрганизации Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ФильтрПоОрганизации", "	И ДокументПроведенный.Организация = &Организация
		|");
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ФильтрПоОрганизации", "");
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ДатаНачала"		, ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания"	, ДатаОкончания);
	Запрос.УстановитьПараметр("Организация"		, Организация);
	
	РезультатЗапроса = Запрос.Выполнить();
	тзДокументов = РезультатЗапроса.Выгрузить();
	
	Возврат тзДокументов;
	
КонецФункции

// Вкладка "Документ дополнительно". Проведение документов. Проведение документов из имеющегося списка.
//
Процедура ТДокументПровестиДокументыИзСпискаВыбранныхВидов(ДатаНачала, ДатаОкончания, ДокументПроведениеОрганизация, ТДокументСписокВидов, Проводить, КоличествоПроведенных, ОжидатьСнятиеБлокировки, ВремяОжиданияСнятияБлокировки, ЕстьБлокированные) Экспорт
	
	тзДокументов = ТДокументПолучитьТаблицуДокументовДляПроведения(ДатаНачала, ДатаОкончания, ДокументПроведениеОрганизация, ТДокументСписокВидов, Проводить);
	
	Если ВыполнятьВТранзакции Тогда
		НачатьТранзакцию();
	КонецЕсли;
	
	Если тзДокументов.Количество() = 0 Тогда
		Сообщить("Документы за данный период не найдены.");
		Возврат;
	КонецЕсли;
	
	ТДокументСписокВидов.ЗаполнитьЗначения(0, "Проведено");
	
	Отказ = Ложь;
	НПП = 0;
	КоличествоПроведенных = 0;
	ЕстьБлокированные = Ложь;
	Для Каждого Документ ИЗ тзДокументов Цикл
		НПП = НПП + 1;
		ДокументЗаблокированДругимПользователем = Ложь;
		СообщениеОБлокировкеДругимПользователем = "";
		ДокументОбъект = Документ.Ссылка.ПолучитьОбъект();
		
		Сообщить(""+НПП+"."+Документ.Ссылка);
		
		Попытка
			ДокументЗаблокированДругимПользователем = Ложь;
    		ДокументОбъект.Заблокировать();
		Исключение
			ДокументЗаблокированДругимПользователем = Истина;
			СообщениеОБлокировкеДругимПользователем = ОписаниеОшибки();
		КонецПопытки;
		
		Если ДокументЗаблокированДругимПользователем И НЕ ОжидатьСнятиеБлокировки Тогда
    		Сообщить("" + НПП + ". Невозможно заблокировать и провести документ: " + Документ.Ссылка);
			Продолжить;
		ИначеЕсли ДокументЗаблокированДругимПользователем И ОжидатьСнятиеБлокировки Тогда
			ЗадержкаВВыполненииДействия(ВремяОжиданияСнятияБлокировки);
			Если ДокументОбъект.Заблокирован() Тогда
	    		Сообщить("" + НПП + ". Ожидание: " + ВремяОжиданияСнятияБлокировки + " минут.
				|Документ по-прежнему заблокирован другим пользователем: " + Документ.Ссылка);
				Продолжить;
			Иначе
				// Заблокирован().
				// Примечание:
				// Следует учитывать, что этот метод используется для проверки блокировки объекта базы данных конкретным объектом встроенного языка. 
				// Он не может быть использован, чтобы проверить, заблокирован ли вообще объект базы данных. 
				Попытка
					ДокументЗаблокированДругимПользователем = Ложь;
    				ДокументОбъект.Заблокировать();
				Исключение
					ДокументЗаблокированДругимПользователем = Истина;
					СообщениеОБлокировкеДругимПользователем = ОписаниеОшибки();
				КонецПопытки;
			КонецЕсли;
		КонецЕсли;
				
		Попытка
			Если (ДокументОбъект.Заблокирован() И НЕ ДокументЗаблокированДругимПользователем) Тогда
				ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
				ДокументОбъект.Разблокировать();
				СтрокаСписка = ТДокументСписокВидов.Найти(Документ.Ссылка.Метаданные().Имя, "Значение");
				Если НЕ СтрокаСписка = Неопределено Тогда
					СтрокаСписка.Проведено = СтрокаСписка.Проведено + 1;
				КонецЕсли;
				КоличествоПроведенных = КоличествоПроведенных + 1;
				Если ПоказыватьСообщения Тогда
					Сообщить("" + НПП + ". Проведен: " + ДокументОбъект);
				КонецЕсли;
			Иначе
				ЕстьБлокированные = Истина;
				ПозицияХ = Найти(ВРег(СообщениеОБлокировкеДругимПользователем), "КОМПЬЮТЕР");
				Сообщить("" + НПП + ". Не проведен: " + ДокументОбъект + ", т.к. блокирован:
				|" + ?(ПозицияХ > 0, Сред(СообщениеОБлокировкеДругимПользователем, ПозицияХ), СообщениеОБлокировкеДругимПользователем));
			КонецЕсли;
		Исключение
			Отказ = Истина;
			Сообщить("" + НПП + ". " + ОписаниеОшибки());
			Прервать;
		КонецПопытки;
		
	КонецЦикла; 
	
	Если ВыполнятьВТранзакции Тогда
		Если НЕ Отказ Тогда
			//ОтменитьТранзакцию();	// .- МА! Отладка.
			ЗафиксироватьТранзакцию();
		Иначе
			ОтменитьТранзакцию();
			Сообщить("Транзакция отменена. Проведение документов не осуществлено.");
		КонецЕсли
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗадержкаВВыполненииДействия(Знач ВремяОжидания)
	
	Попытка
		Задержка = ВремяОжидания*60;
		СтрокаЗапроса = "ping -n 1 -w "+Формат(1000*Задержка, "ЧГ=0")+" 127.255.255.255";
		WshShell = Новый COMОбъект("WScript.Shell");
		WshShell.Run(СтрокаЗапроса, 0, -1);
	Исключение
	КонецПопытки;
	
	Если ПоказыватьСообщения Тогда
		Сообщить("Время ожидания истеко. " + ВремяОжидания + " минут(а).")
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ИНФОРМАЦИЯ ПО ОБЪЕКТУ.
//

// Возвращает для Объекта БД Дата+Время по GUID.
// GUID (Globally Unique Identifier) — статистически уникальный 128-битный идентификатор.
//
Функция GUIDПолучитьДатуИВремяСозданияОбъектаНаСервере(Знач ОбъектИсследуемый, ЭтоПредопределенный = Неопределено) Экспорт
	
	Если ОбъектИсследуемый = Неопределено ИЛИ Строка(ОбъектИсследуемый) = "COMОбъект" Тогда
		Возврат Дата("00010101000000");
	КонецЕсли;
	
	Если НЕ ТипЗнч(ОбъектИсследуемый) = Тип("УникальныйИдентификатор") Тогда
		
		Если ЭтоПредопределенный = Неопределено Тогда
			ЭтоПредопределенный = Ложь;
			Попытка
				ЭтоПредопределенный = ОбъектИсследуемый.Предопределенный;	// Создан конфигуратором.
			Исключение
				ЭтоПредопределенный = Ложь;
			КонецПопытки;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ОбъектИсследуемый) ИЛИ ЭтоПредопределенный ИЛИ ЭтоПланОбмена(ОбъектИсследуемый.МетаДанные()) Тогда
			Возврат Дата("00010101000000");
		КонецЕсли;
		
		GUID = ОбъектИсследуемый.УникальныйИдентификатор();
		
	Иначе
		
		Если (НЕ ЭтоПредопределенный = Неопределено И ТипЗнч(ЭтоПредопределенный) = Тип("Булево") И ЭтоПредопределенный) Тогда		// Импорт из 1С:Предприятие 8.Х. Передается GUID с дополнительными флажками.
			Возврат Дата("00010101000000");
		КонецЕсли;
		
		GUID = ОбъектИсследуемый;
		
	КонецЕсли;
	
	Если Строка(GUID) = "00000000-0000-0000-0000-000000000000" Тогда
		Возврат Дата("00010101000000");
	КонецЕсли;
	
	Строка16 = Сред(GUID, 16, 3) + Сред(GUID, 10, 4) + Сред(GUID, 1, 8);
	
	Разрядность = СтрДлина(Строка16);
	
	ЧислоСекунд = 0;
	Для Позиция = 1 ПО Разрядность Цикл
		ЧислоСекунд = ЧислоСекунд + Найти("123456789abcdef", Сред(Строка16,Позиция,1)) * Pow(16,Разрядность - Позиция);
	КонецЦикла;
	ЧислоСекунд = ЧислоСекунд / 10000000;
	
	ДатаИВремяСозданияОбъекта = Дата(1582, 10, 15, 04, 00, 00) + ЧислоСекунд;
	
	// Созданы в Конфигураторе, потом удалены из Конфигуратора - даты фантастические.
	// Проверяем на невозможные даты.
	Если ДатаИВремяСозданияОбъекта <= Дата("19800101000000") ИЛИ ДатаИВремяСозданияОбъекта >= КонецГода(ТекущаяДата()) Тогда	// <=1980 ИЛИ >=Конец текущего года.
		Возврат Дата("00010101000000");
	КонецЕсли;
	
	Возврат ДатаИВремяСозданияОбъекта;

КонецФункции

// Возвращает GUID для удаленного Объекта БД типа "05dbe824-a4c6-11dd-bf56-00145e3710ab" ИЗ "<Объект не найден> (84:bf5600145e3710ab11dda4c605dbe824)".
// GUID (Globally Unique Identifier) — статистически уникальный 128-битный идентификатор.
//
Функция GUIDБитогоОбъектаНаСервере(Знач БитыйGUID) Экспорт
	
	// БитыйGUID = <Объект не найден> (84:bf5600145e3710ab11dda4c605dbe824)
	
	БитыйGUID = СокрЛП(БитыйGUID);
	
	Если Найти(БитыйGUID, "<Объект не найден> (") = 0 ИЛИ Найти(БитыйGUID, "<Объект не найден> (") > 1 ИЛИ Найти(БитыйGUID, ")") = 0 Тогда
		Сообщить("Неверный формат ""Битой"" ссылки.
		|""Битая"" ссылка должна иметь вид: 
		|<Объект не найден> (84:bf5600145e3710ab11dda4c605dbe824)");
		Возврат Неопределено;
	КонецЕсли;
	
	GUIDБитогоОбъектаСтрокой = СтрЗаменить(БитыйGUID, "<Объект не найден> (", "");
	GUIDБитогоОбъектаСтрокой = СтрЗаменить(GUIDБитогоОбъектаСтрокой, ")", "");
	GUIDБитогоОбъектаСтрокой = СтрЗаменить(GUIDБитогоОбъектаСтрокой, "0x", "");
	GUIDБитогоОбъектаСтрокой = Сред(GUIDБитогоОбъектаСтрокой, Найти(GUIDБитогоОбъектаСтрокой, ":") + 1, СтрДлина(GUIDБитогоОбъектаСтрокой));
	
	// Преобразуем GUID
	GUID = Сред(GUIDБитогоОбъектаСтрокой, 25,  8) + 
	 "-" + Сред(GUIDБитогоОбъектаСтрокой, 21,  4) + 
	 "-" + Сред(GUIDБитогоОбъектаСтрокой, 17,  4) + 
	 "-" + Сред(GUIDБитогоОбъектаСтрокой,  1,  4) +
	 "-" + Сред(GUIDБитогоОбъектаСтрокой,  5, 12);
	 
	Попытка
		GUID = Новый УникальныйИдентификатор(GUID);
	Исключение
		GUID = Новый УникальныйИдентификатор;
	КонецПопытки;
	
	Возврат GUID;

КонецФункции

// Возвращает Ссылку на Объект.
// GUID (Globally Unique Identifier) — статистически уникальный 128-битный идентификатор.
//
// ОбъектМенеджеры:
//
// 1. Справочники.
// 2. Документы.
// 3. ПланыВидовХарактеристик.
// 4. ПланыОбмена.
// 5. БизнесПроцессы.
// 6. Задачи.
// 7. ПланыВидовРасчета.
// 8. ПланыСчетов.
//
Функция GUIDПолучитьСсылкуНаОбъектНаСервере(GUID) Экспорт
	
	GUIDСсылкаНаОбъект = Неопределено;
	
	МассивОбъектыМенеджер = Новый Массив;
	МассивОбъектыМенеджер.Добавить(Справочники);
	МассивОбъектыМенеджер.Добавить(Документы);
	МассивОбъектыМенеджер.Добавить(ПланыВидовХарактеристик);
	МассивОбъектыМенеджер.Добавить(ПланыОбмена);
	МассивОбъектыМенеджер.Добавить(БизнесПроцессы);
	МассивОбъектыМенеджер.Добавить(Задачи);
	МассивОбъектыМенеджер.Добавить(ПланыВидовРасчета);
	МассивОбъектыМенеджер.Добавить(ПланыСчетов);
	
	Для Каждого ОбъектыМенеджер ИЗ МассивОбъектыМенеджер Цикл
		GUIDСсылкаНаОбъект = GUIDПолучитьСсылкуНаОбъектПоМенеджеруОбъектаОдногоВИДАиУникальномуИдентификатору(ОбъектыМенеджер, GUID);
		Если НЕ GUIDСсылкаНаОбъект = Неопределено И НЕ GUIDСсылкаНаОбъект.Пустая() Тогда
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат GUIDСсылкаНаОбъект;
	
КонецФункции

// Возвращает Ссылку на Объект.
// GUID (Globally Unique Identifier) — статистически уникальный 128-битный идентификатор.
//
// ОбъектМенеджеры:
//
// 1. Справочники.
// 2. Документы.
// 3. ПланыВидовХарактеристик.
// 4. ПланыОбмена.
// 5. БизнесПроцессы.
// 6. Задачи.
// 7. ПланыВидовРасчета.
// 8. ПланыСчетов.
//
Функция GUIDПолучитьСсылкуНаОбъектПоМенеджеруОбъектаОдногоВИДАиУникальномуИдентификатору(ОбъектыМенеджер, GUID) Экспорт
	
	GUIDСсылкаНаОбъект = Неопределено;
	
	Для Каждого МенеджерОбъекта Из ОбъектыМенеджер Цикл
		
		GUIDСсылкаНаОбъект = МенеджерОбъекта.ПолучитьСсылку(GUID);
		
		Если Найти(Строка(GUIDСсылкаНаОбъект), "<Объект не найден>" ) > 0 Тогда
			GUIDСсылкаНаОбъект = Неопределено;
			Продолжить;
		КонецЕсли;
		
		Попытка
			Если GUIDСсылкаНаОбъект.ПолучитьОбъект() <> Неопределено Тогда	// Монопольный режим ?!
				Прервать;
			КонецЕсли;
		Исключение
			GUIDСсылкаНаОбъект = Неопределено;
		    //Сообщить(НСтр("ru = '"+ОписаниеОшибки()+"'"), СтатусСообщения.Внимание);
		КонецПопытки;
		
	КонецЦикла;
	
	Возврат GUIDСсылкаНаОбъект;
	
КонецФункции

// Возвращает Ссылку на Объект.
// GUID (Globally Unique Identifier) — статистически уникальный 128-битный идентификатор.
//
// ОбъектМенеджеры:
//
// 1. Справочники.
// 2. Документы.
// 3. ПланыВидовХарактеристик.
// 4. ПланыОбмена.
// 5. БизнесПроцессы.
// 6. Задачи.
// 7. ПланыВидовРасчета.
// 8. ПланыСчетов.
//
Функция GUIDПолучитьСсылкуНаОбъектПоМенеджеруОбъектаОдногоТИПАиУникальномуИдентификатору(МенеджерОбъекта, GUID) Экспорт
	
	GUIDСсылкаНаОбъект = МенеджерОбъекта.ПолучитьСсылку(GUID);
	
	Если Найти(Строка(GUIDСсылкаНаОбъект), "Объект не найден") > 0 Тогда
		GUIDСсылкаНаОбъект = Неопределено;
	КонецЕсли;
	
	Попытка
		ПроверкаGUIDСсылкИНаОбъект = GUIDСсылкаНаОбъект.ПолучитьОбъект() <> Неопределено;	// Монопольный режим ?!
		Возврат GUIDСсылкаНаОбъект;
	Исключение
		GUIDСсылкаНаОбъект = Неопределено;
	    //Сообщить(НСтр("ru = '"+ОписаниеОшибки()+"'"), СтатусСообщения.Внимание);
	КонецПопытки;
	
	Возврат GUIDСсылкаНаОбъект;
	
КонецФункции

// Восстановление Объекта БД по ссылке типа "<Объект не найден> (84:bf5600145e3710ab11dda4c605dbe824)".
// GUID (Globally Unique Identifier) — статистически уникальный 128-битный идентификатор.
//
// ОбъектМенеджеры:
//
// 1. Справочники.
// 2. Документы.
// 3. ПланыВидовХарактеристик.
// 4. ПланыОбмена.
// 5. БизнесПроцессы.
// 6. Задачи.
// 7. ПланыВидовРасчета.
// 8. ПланыСчетов.
//
Функция GUIDВосстановитьОбъектПоТипуИГУИД(БитыйОбъектТип, БитыйОбъектGUID, БитыйОбъектДатаИВремя, БитыйОбъектТекст) Экспорт

	ВосстановленныйОбъектСссылка = Неопределено;
	
	// Проверим существует ли Объект.
	
	GUIDСсылкаНаОбъект = GUIDПолучитьСсылкуНаОбъектНаСервере(БитыйОбъектGUID);
	
	Если НЕ GUIDСсылкаНаОбъект = Неопределено Тогда
		Если Найти(Строка(GUIDСсылкаНаОбъект), "<Объект не найден>" ) > 0 Тогда
			Сообщить("Возвращенное значение не является Объектом БД:
			|" + GUIDСсылкаНаОбъект + "
			|
			|Проверьте:
			|1. Значение ""Битый"" Объект: (ТЕКСТ);
			|2. Выбранный тип Объекта.");
		Иначе
			Сообщить("Объект с Уникальным идентификатором: 
			|" + БитыйОбъектGUID + "
			|уже сущенствует:
			|" + GUIDСсылкаНаОбъект);
		КонецЕсли;
		Возврат GUIDСсылкаНаОбъект;
	КонецЕсли;
	
	ОбъектМД = МетаДанные.НайтиПоТипу(БитыйОбъектТип);
	
	ОбъектМенеджер = Неопределено;
	
	Если ЭтоСправочник(ОбъектМД) Тогда
		
		ОбъектМенеджер = Справочники[ОбъектМД.Имя];
		
		ОбъектВоссоздаваемый = ОбъектМенеджер.СоздатьЭлемент();
		
		Попытка
			ОбъектВоссоздаваемый.Наименование = БитыйОбъектТекст;
		Исключение
			//Сообщить(НСтр("ru = '"+ОписаниеОшибки()+"'"), СтатусСообщения.Внимание);
		КонецПопытки;
		
	ИначеЕсли ЭтоДокумент(ОбъектМД) Тогда
		
		ОбъектМенеджер = Документы[ОбъектМД.Имя];
		
		ОбъектВоссоздаваемый = ОбъектМенеджер.СоздатьДокумент();
		
		Попытка
			ОбъектВоссоздаваемый.Комментарий = БитыйОбъектТекст;
		Исключение
			//Сообщить(НСтр("ru = '"+ОписаниеОшибки()+"'"), СтатусСообщения.Внимание);
		КонецПопытки;
		
	ИначеЕсли ЭтоПланВидовХарактеристик(ОбъектМД) Тогда
		
		ОбъектМенеджер = ПланыВидовХарактеристик[ОбъектМД.Имя];
		
		ОбъектВоссоздаваемый = ОбъектМенеджер.СоздатьЭлемент();
		
		Попытка
			ОбъектВоссоздаваемый.Наименование = БитыйОбъектТекст;
		Исключение
			//Сообщить(НСтр("ru = '"+ОписаниеОшибки()+"'"), СтатусСообщения.Внимание);
		КонецПопытки;
		
	ИначеЕсли ЭтоПланОбмена(ОбъектМД) Тогда
		
		ОбъектМенеджер = ПланыОбмена[ОбъектМД.Имя];
		
		ОбъектВоссоздаваемый = ОбъектМенеджер.СоздатьУзел();
		
		Попытка
			ОбъектВоссоздаваемый.Наименование = БитыйОбъектТекст;
		Исключение
			//Сообщить(НСтр("ru = '"+ОписаниеОшибки()+"'"), СтатусСообщения.Внимание);
		КонецПопытки;
		
	ИначеЕсли ЭтоБизнесПроцесс(ОбъектМД) Тогда
		
		ОбъектМенеджер = БизнесПроцессы[ОбъектМД.Имя];
		
		ОбъектВоссоздаваемый = ОбъектМенеджер.СоздатьБизнесПроцесс();
		
		Попытка
			ОбъектВоссоздаваемый.Наименование = БитыйОбъектТекст;
		Исключение
			//Сообщить(НСтр("ru = '"+ОписаниеОшибки()+"'"), СтатусСообщения.Внимание);
		КонецПопытки;
		
	ИначеЕсли ЭтоЗадача(ОбъектМД) Тогда
		
		ОбъектМенеджер = Задачи[ОбъектМД.Имя];
		
		ОбъектВоссоздаваемый = ОбъектМенеджер.СоздатьЗадачу();
		
		Попытка
			ОбъектВоссоздаваемый.Наименование = БитыйОбъектТекст;
		Исключение
			//Сообщить(НСтр("ru = '"+ОписаниеОшибки()+"'"), СтатусСообщения.Внимание);
		КонецПопытки;
		
	ИначеЕсли ЭтоПланВидовРасчета(ОбъектМД) Тогда
		
		ОбъектМенеджер = ПланыВидовРасчета[ОбъектМД.Имя];
		
		ОбъектВоссоздаваемый = ОбъектМенеджер.СоздатьВидРасчета();
		
	ИначеЕсли ЭтоПланСчетов(ОбъектМД) Тогда
		
		ОбъектМенеджер = ПланыСчетов[ОбъектМД.Имя];
		
		ОбъектВоссоздаваемый = ОбъектМенеджер.СоздатьСчет();
		
	Иначе	
		
		Сообщить("Для: " + БитыйОбъектТип + " неопределен объект Метаданных.");
		
		Возврат GUIDСсылкаНаОбъект;
		
	КонецЕсли;
	
	Если РазрешитьУстановкуЗначенияОбменДаннымиЗагрузкаИстина(ОбъектВоссоздаваемый) Тогда
		ОбъектВоссоздаваемый.ОбменДанными.Загрузка = Истина;	// Не все объекты имеют свойство "ОбменДанными".
	КонецЕсли;
	
	ОбъектВоссоздаваемый.УстановитьСсылкуНового(ОбъектМенеджер.ПолучитьСсылку(БитыйОбъектGUID));
	
	Если НЕ ОбъектМД = Неопределено И ЕстьРеквизитОбъекта1С("Дата", ОбъектВоссоздаваемый) Тогда
		ОбъектВоссоздаваемый.Дата = БитыйОбъектДатаИВремя;
	КонецЕсли;
	
	Если НЕ ОбъектМД = Неопределено И ЕстьРеквизитОбъекта1С("Организация", ОбъектВоссоздаваемый) Тогда
		Попытка
			ОбъектВоссоздаваемый.Организация = ЭтотОбъект.ОбъектБД.Организация;
		Исключение
		    //Сообщить(НСтр("ru = '"+ОписаниеОшибки()+"'"), СтатусСообщения.Внимание);
		КонецПопытки;
	КонецЕсли;
	
	Попытка
		ОбъектВоссоздаваемый.Записать();
		ВосстановленныйОбъектСссылка = ОбъектВоссоздаваемый.Ссылка;
	Исключение
	    Сообщить(НСтр("ru = '"+ОписаниеОшибки()+"'"), СтатусСообщения.Внимание);
	КонецПопытки;
	
	Если НЕ ОбъектМД = Неопределено И ЭтоДокумент(ОбъектМД) И ЭтотОбъект.ТипОбъектаБД = ИмяТипаДокументы() И ОбъектМД.Имя = ЭтотОбъект.ИмяОбъектаБД Тогда
		// Документы.
		ЗаполнитьЗначенияСвойств(ОбъектВоссоздаваемый, ЭтотОбъект.ОбъектБД);
		ОбъектВоссоздаваемый.Дата = БитыйОбъектДатаИВремя;
		ОбъектВоссоздаваемый.УстановитьНовыйНомер();
		ОбъектВоссоздаваемый.Проведен = Ложь;
	ИначеЕсли НЕ ОбъектМД = Неопределено И ЭтоБизнесПроцесс(ОбъектМД) ИЛИ ЭтоЗадача(ОбъектМД) Тогда
		// БизнесПроцессы и Задачи.
		Если ЕстьРеквизитОбъекта1С("Номер", ОбъектВоссоздаваемый) Тогда
			Попытка
				ОбъектВоссоздаваемый.УстановитьНовыйНомер();
			Исключение
				//Сообщить(НСтр("ru = '"+ОписаниеОшибки()+"'"), СтатусСообщения.Внимание);
			КонецПопытки;
		КонецЕсли;
	КонецЕсли;
	
	Попытка
		ОбъектВоссоздаваемый.Записать();
		ВосстановленныйОбъектСссылка = ОбъектВоссоздаваемый.Ссылка;
	Исключение
	    Сообщить(НСтр("ru = '"+ОписаниеОшибки()+"'"), СтатусСообщения.Внимание);
	КонецПопытки;
		
	Возврат ВосстановленныйОбъектСссылка;

КонецФункции

// Поиск по ИБ значений типа "<Объект не найден> (84:bf5600145e3710ab11dda4c605dbe824)".
// GUID (Globally Unique Identifier) — статистически уникальный 128-битный идентификатор.
//
Функция GUIDНайтиБитыеОбъектыНаСервере() Экспорт
	
	ЭтотОбъект.БитыеСсылки.Очистить();
	
	КоллекцияОбъектовМДТипаСсылка = ПолучитьКоллекциюОбъектовМДТипаСсылка();
	ТаблицаБитыеСсылки = GUIDНайтиБитыеВОбъектахТипаСсылка(КоллекцияОбъектовМДТипаСсылка);
	
	КоллекцияОбъектовМДТипаРегистр = ПолучитьКоллекциюОбъектовМДТипаРегистр();
	ТаблицаБитыеСсылки = GUIDНайтиБитыеВОбъектахТипаРегистр(КоллекцияОбъектовМДТипаРегистр);
	
	Возврат ТаблицаБитыеСсылки;
	
КонецФункции

Функция GUIDНайтиБитыеВОбъектахТипаСсылка(КоллекцияОбъектовМДТипаСсылка)
	
	Для Каждого ЭлементСЗ ИЗ КоллекцияОбъектовМДТипаСсылка Цикл
		
		Если НЕ ЭтотОбъект.СписокОбъектовТипаСсылка.НайтиПоЗначению(ЭлементСЗ.Представление).Пометка Тогда
			Продолжить;
		КонецЕсли;
		
		ОбъектМД = ЭлементСЗ.Значение;
		хТипОбъекта = ЭлементСЗ.Представление;
		хИсточник = хТипОбъекта+"."+ОбъектМД.Имя;
		
		// Стандартные реквизиты.
		GUIDНайтиБитыеОбходПоИзмерениямРесурсамРеквизитам("Ссылка", хТипОбъекта, хИсточник, ОбъектМД, "СтандартныеРеквизиты");
		
		// Реквизиты.
		GUIDНайтиБитыеОбходПоИзмерениямРесурсамРеквизитам("Ссылка", хТипОбъекта, хИсточник, ОбъектМД, "Реквизиты");
		
		// Табличные части.
		Для Каждого ТЧасть ИЗ ОбъектМД.ТабличныеЧасти Цикл
			GUIDНайтиБитыеОбходПоИзмерениямРесурсамРеквизитам("Ссылка", хТипОбъекта, хИсточник+"."+ТЧасть.Имя, ОбъектМД.ТабличныеЧасти[ТЧасть.Имя], "Реквизиты", Истина);
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат ЭтотОбъект.БитыеСсылки;
	
КонецФункции

Функция GUIDНайтиБитыеВОбъектахТипаРегистр(КоллекцияОбъектовМДТипаРегистр)
	
	Для Каждого ЭлементСЗ ИЗ КоллекцияОбъектовМДТипаРегистр Цикл
		Если НЕ ЭтотОбъект.СписокОбъектовТипаРегистр.НайтиПоЗначению(ЭлементСЗ.Представление).Пометка Тогда
			Продолжить;
		КонецЕсли;
		
		ОбъектМД = ЭлементСЗ.Значение;
		хТипОбъекта = ЭлементСЗ.Представление;
		хИсточник = хТипОбъекта+"."+ОбъектМД.Имя;
		
		GUIDНайтиБитыеОбходПоИзмерениямРесурсамРеквизитам("Регистр", хТипОбъекта, хИсточник, ОбъектМД, "СтандартныеРеквизиты");
		
		// Измерения.
		GUIDНайтиБитыеОбходПоИзмерениямРесурсамРеквизитам("Регистр", хТипОбъекта, хИсточник, ОбъектМД, "Измерения");
		
		// Ресурсы.
		Если хТипОбъекта = "РегистрСведений" Тогда	// Ресурсы Регистров: Накопления, Бухгалтерии, Расчета - Число.
			GUIDНайтиБитыеОбходПоИзмерениямРесурсамРеквизитам("Регистр", хТипОбъекта, хИсточник, ОбъектМД, "Ресурсы");
		КонецЕсли;
		
		// Реквизиты.
		GUIDНайтиБитыеОбходПоИзмерениямРесурсамРеквизитам("Регистр", хТипОбъекта, хИсточник, ОбъектМД, "Реквизиты");
		
	КонецЦикла;
	
	Возврат ЭтотОбъект.БитыеСсылки;
	
КонецФункции

Процедура GUIDНайтиБитыеОбходПоИзмерениямРесурсамРеквизитам(хВидОбъекта, хТипОбъекта, хИсточник, ОбъектМД, ИРР, ЭтоТЧ=Ложь)
	
	Для Каждого хРеквизит ИЗ ОбъектМД[ИРР] Цикл
		Для Каждого хТип ИЗ хРеквизит.Тип.Типы() Цикл
			Если ЭтоПримитивныйТип(хТип) ИЛИ (ИРР = "СтандартныеРеквизиты" И хРеквизит.Имя = "Ссылка") Тогда
				Продолжить;
			КонецЕсли;
			хТипМетаданные = Метаданные.НайтиПоТипу(хТип);
			Если НЕ хТипМетаданные = Неопределено И НЕ Метаданные.Перечисления.Содержит(хТипМетаданные) Тогда
				СоставнойТипПрерватьЦикл = Ложь;
				Если хРеквизит.Тип.Типы().Количество() > 1 Тогда
					СоставнойТипПрерватьЦикл = Истина;
				КонецЕсли;
				ТекстЗапроса = "";
				Если хВидОбъекта = "Регистр" Тогда
					Если (хТипОбъекта = "РегистрСведений" И Найти(Строка(хТип), "(точка маршрута)") > 0) Тогда
						ТекстЗапроса = GUIDНайтиБитыеТекстЗапросаПоОбъектуМД(хИсточник, хРеквизит.Имя, хТипМетаданные.ПолноеИмя(), """" + хИсточник + """", ".Точки");
					ИначеЕсли хТипОбъекта = "РегистрБухгалтерии" Тогда
						GUIDНайтиБитыеРеквизитыРегистраБухгалтерия(хВидОбъекта, хТипОбъекта, хИсточник, ОбъектМД, ИРР, хРеквизит, хТипМетаданные);
						Если СоставнойТипПрерватьЦикл Тогда
							Прервать;
						КонецЕсли;
						Продолжить;
					Иначе
						ТекстЗапроса = GUIDНайтиБитыеТекстЗапросаПоОбъектуМД(хИсточник, хРеквизит.Имя, хТипМетаданные.ПолноеИмя(), """" + хИсточник + """", "");
					КонецЕсли;
				Иначе
					Если (ИРР = "СтандартныеРеквизиты" И (хТипОбъекта = "Задача" И Найти(Строка(хТип), "(точка маршрута)") > 0))
						ИЛИ (ЭтоТЧ И ИРР = "Реквизиты" И (хТипОбъекта = "БизнесПроцесс" И Найти(Строка(хТип), "(точка маршрута)") > 0)) 
						ИЛИ (ЭтоТЧ И ИРР = "Реквизиты" И (хТипОбъекта = "Справочник" И Найти(Строка(хТип), "(точка маршрута)") > 0)) Тогда
						ТекстЗапроса = GUIDНайтиБитыеТекстЗапросаПоОбъектуМД(хИсточник, хРеквизит.Имя, хТипМетаданные.ПолноеИмя(), "хОбъект.Ссылка", ".Точки");
					Иначе
						ТекстЗапроса = GUIDНайтиБитыеТекстЗапросаПоОбъектуМД(хИсточник, хРеквизит.Имя, хТипМетаданные.ПолноеИмя(), "хОбъект.Ссылка", "");
					КонецЕсли;
				КонецЕсли;
				Если ЗначениеЗаполнено(ТекстЗапроса) Тогда
					тзРезультатаЗапроса = GUIDНайтиБитыеВыполнитьЗапрос(ТекстЗапроса);
					Если НЕ тзРезультатаЗапроса = Неопределено Тогда
						Если СоставнойТипПрерватьЦикл Тогда
							// Изменить содержимое тзРезультатаЗапроса.
							ОбъектНеНайденОписаниеТипа = ПолучитьСтрокуИзМассиваПодстрок(хРеквизит.Тип.Типы(), ";");
							Для Каждого СтрокаБитыхСсылок ИЗ тзРезультатаЗапроса Цикл
								СтрокаБитыхСсылок.ОбъектНеНайденОписаниеТипа = ОбъектНеНайденОписаниеТипа;
							КонецЦикла;
						КонецЕсли;
						ЗаполнитьТаблицу(тзРезультатаЗапроса, ЭтотОбъект.БитыеСсылки);
					КонецЕсли;
				КонецЕсли;
				Если СоставнойТипПрерватьЦикл Тогда
					Прервать;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

Процедура GUIDНайтиБитыеРеквизитыРегистраБухгалтерия(хВидОбъекта, хТипОбъекта, хИсточник, ОбъектМД, ИРР, хРеквизит, хТипМетаданные)
	
	ТекстЗапроса = "";
	Если ИРР = "СтандартныеРеквизиты" ИЛИ ИРР = "Измерения" Тогда
		Если хРеквизит.Имя = "Счет" Тогда
			ТекстЗапроса_Дт = GUIDНайтиБитыеТекстЗапросаПоОбъектуМД(хИсточник, "СчетДт", хТипМетаданные.ПолноеИмя(), """" + хИсточник + """", "");
			ТекстЗапроса_Кт = GUIDНайтиБитыеТекстЗапросаПоОбъектуМД(хИсточник, "СчетКт", хТипМетаданные.ПолноеИмя(), """" + хИсточник + """", "");
			ТекстЗапроса = ТекстЗапроса_Дт + Символы.ПС + "ОБЪЕДИНИТЬ ВСЕ" + Символы.ПС + ТекстЗапроса_Кт;
		ИначеЕсли Найти(ВРег(хРеквизит.Имя), "СУБКОНТО") > 0 Тогда
			ЦифраСправа = Прав(хРеквизит.Имя,1);
			ИмяБезЦифры = СтрЗаменить(хРеквизит.Имя, ЦифраСправа,"");
			ТекстЗапроса_Дт = GUIDНайтиБитыеТекстЗапросаПоОбъектуМД(хИсточник+".ДвиженияССубконто", ИмяБезЦифры+"Дт"+ЦифраСправа, хТипМетаданные.ПолноеИмя(), """" + хИсточник + """", "");
			ТекстЗапроса_Кт = GUIDНайтиБитыеТекстЗапросаПоОбъектуМД(хИсточник+".ДвиженияССубконто", ИмяБезЦифры+"Кт"+ЦифраСправа, хТипМетаданные.ПолноеИмя(), """" + хИсточник + """", "");
			ТекстЗапроса = ТекстЗапроса_Дт + Символы.ПС + "ОБЪЕДИНИТЬ ВСЕ" + Символы.ПС + ТекстЗапроса_Кт;
		ИначеЕсли хРеквизит.Имя = "Регистратор" Тогда
			ТекстЗапроса = GUIDНайтиБитыеТекстЗапросаПоОбъектуМД(хИсточник, "Регистратор", хТипМетаданные.ПолноеИмя(), """" + хИсточник + """", "");
		ИначеЕсли хРеквизит.Имя = "Организация" Тогда
			ТекстЗапроса = GUIDНайтиБитыеТекстЗапросаПоОбъектуМД(хИсточник, "Организация", хТипМетаданные.ПолноеИмя(), """" + хИсточник + """", "");
		ИначеЕсли хРеквизит.Имя = "Валюта" Тогда
			ТекстЗапроса_Дт = GUIDНайтиБитыеТекстЗапросаПоОбъектуМД(хИсточник+".ДвиженияССубконто", "ВалютаДт", хТипМетаданные.ПолноеИмя(), """" + хИсточник + """", "");
			ТекстЗапроса_Кт = GUIDНайтиБитыеТекстЗапросаПоОбъектуМД(хИсточник+".ДвиженияССубконто", "ВалютаКт", хТипМетаданные.ПолноеИмя(), """" + хИсточник + """", "");
			ТекстЗапроса = ТекстЗапроса_Дт + Символы.ПС + "ОБЪЕДИНИТЬ ВСЕ" + Символы.ПС + ТекстЗапроса_Кт;
		ИначеЕсли хРеквизит.Имя = "Подразделение" Тогда
			ТекстЗапроса_Дт = GUIDНайтиБитыеТекстЗапросаПоОбъектуМД(хИсточник+".ДвиженияССубконто", "ПодразделениеДт", хТипМетаданные.ПолноеИмя(), """" + хИсточник + """", "");
			ТекстЗапроса_Кт = GUIDНайтиБитыеТекстЗапросаПоОбъектуМД(хИсточник+".ДвиженияССубконто", "ПодразделениеКт", хТипМетаданные.ПолноеИмя(), """" + хИсточник + """", "");
			ТекстЗапроса = ТекстЗапроса_Дт + Символы.ПС + "ОБЪЕДИНИТЬ ВСЕ" + Символы.ПС + ТекстЗапроса_Кт;
		ИначеЕсли хРеквизит.Имя = "ПодразделениеОрганизации" Тогда
			ТекстЗапроса_Дт = GUIDНайтиБитыеТекстЗапросаПоОбъектуМД(хИсточник+".ДвиженияССубконто", "ПодразделениеОрганизацииДт", хТипМетаданные.ПолноеИмя(), """" + хИсточник + """", "");
			ТекстЗапроса_Кт = GUIDНайтиБитыеТекстЗапросаПоОбъектуМД(хИсточник+".ДвиженияССубконто", "ПодразделениеОрганизацииКт", хТипМетаданные.ПолноеИмя(), """" + хИсточник + """", "");
			ТекстЗапроса = ТекстЗапроса_Дт + Символы.ПС + "ОБЪЕДИНИТЬ ВСЕ" + Символы.ПС + ТекстЗапроса_Кт;
		Иначе
			ТекстЗапроса = GUIDНайтиБитыеТекстЗапросаПоОбъектуМД(хИсточник, хРеквизит.Имя, хТипМетаданные.ПолноеИмя(), """" + хИсточник + """", "");
		КонецЕсли;
	Иначе	
		ТекстЗапроса = GUIDНайтиБитыеТекстЗапросаПоОбъектуМД(хИсточник, хРеквизит.Имя, хТипМетаданные.ПолноеИмя(), """" + хИсточник + """", "");
	КонецЕсли;
	Если ЗначениеЗаполнено(ТекстЗапроса) Тогда
		тзРезультатаЗапроса = GUIDНайтиБитыеВыполнитьЗапрос(ТекстЗапроса);
		Если НЕ тзРезультатаЗапроса = Неопределено Тогда
			ЗаполнитьТаблицу(тзРезультатаЗапроса, ЭтотОбъект.БитыеСсылки);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Функция GUIDНайтиБитыеТекстЗапросаПоОбъектуМД(хИсточник, хРеквизит, ОбъектНеНайденОписаниеТипа, ИсточникОбъект = "хОбъект.Ссылка", Точки = "")
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	хОбъект." + хРеквизит + " КАК ОбъектНеНайденСсылка,
	|	""" + ОбъектНеНайденОписаниеТипа + """ КАК ОбъектНеНайденОписаниеТипа,
	|	""" + хИсточник + "." + хРеквизит + """ КАК ИсточникРеквизит,
	|	" + ИсточникОбъект + " КАК ИсточникОбъект
	|ИЗ
	|	" + хИсточник + " КАК хОбъект
	|ГДЕ
	|	((хОбъект." + хРеквизит + " ССЫЛКА " + ОбъектНеНайденОписаниеТипа + Точки + ")
	|	И (НЕ хОбъект." + хРеквизит + " = Значение(" + ОбъектНеНайденОписаниеТипа + ".ПустаяСсылка))
	|	И (хОбъект." + хРеквизит + ".Ссылка ЕСТЬ NULL))";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция GUIDНайтиБитыеВыполнитьЗапрос(ТекстЗапроса)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Попытка 
		РезультатЗапроса = Запрос.Выполнить();
		Если НЕ РезультатЗапроса.Пустой() Тогда
			тзРезультатаЗапроса = ЭтотОбъект.БитыеСсылки.ВыгрузитьКолонки();
			ЗаполнитьТаблицу(РезультатЗапроса.Выгрузить(), тзРезультатаЗапроса);
			Возврат тзРезультатаЗапроса;
		Иначе
			Возврат Неопределено;
		КонецЕсли;
	Исключение
	    Сообщить(НСтр("ru = '"+ОписаниеОшибки()+"'"), СтатусСообщения.Внимание);
		Возврат Неопределено;
	КонецПопытки;
	
	Возврат Неопределено;
	
КонецФункции

Функция ПолучитьКоличествоОбъектовТипаСсылка()
	
	// Значение ВАЖНО!
	СписокОбъектовТипаСсылка = Новый СписокЗначений;
	СписокОбъектовТипаСсылка.Добавить("Справочник"				, "Справочники ("+Метаданные.Справочники.Количество()+")");
	СписокОбъектовТипаСсылка.Добавить("Документ"				, "Документы ("+Метаданные.Документы.Количество()+")");
	СписокОбъектовТипаСсылка.Добавить("ПланСчетов"				, "Планы счетов ("+Метаданные.ПланыСчетов.Количество()+")");
	СписокОбъектовТипаСсылка.Добавить("ПланВидовРасчета"		, "Планы видов расчета ("+Метаданные.ПланыВидовРасчета.Количество()+")");
	СписокОбъектовТипаСсылка.Добавить("ПланВидовХарактеристик"	, "Планы видов характеристик ("+Метаданные.ПланыВидовХарактеристик.Количество()+")");
	СписокОбъектовТипаСсылка.Добавить("ПланОбмена"				, "Планы обмена ("+Метаданные.ПланыОбмена.Количество()+")");
	СписокОбъектовТипаСсылка.Добавить("БизнесПроцесс"			, "Бизнес-Процессы ("+Метаданные.БизнесПроцессы.Количество()+")");
	СписокОбъектовТипаСсылка.Добавить("Задача"					, "Задачи ("+Метаданные.Задачи.Количество()+")");
	
	Возврат СписокОбъектовТипаСсылка;
	
КонецФункции

Функция ПолучитьКоллекциюОбъектовМДТипаСсылка()
	
	КоллекцияОбъектовМДТипаСсылка = Новый СписокЗначений;
	
	// Представление ВАЖНО! СЛИТНО!
	СписокОбъектовМДТипаСсылка = Новый СписокЗначений;
	СписокОбъектовМДТипаСсылка.Добавить(Метаданные.Справочники				, "Справочник");
	СписокОбъектовМДТипаСсылка.Добавить(Метаданные.Документы				, "Документ");
	СписокОбъектовМДТипаСсылка.Добавить(Метаданные.ПланыСчетов				, "ПланСчетов");
	СписокОбъектовМДТипаСсылка.Добавить(Метаданные.ПланыВидовРасчета		, "ПланВидовРасчета");
	СписокОбъектовМДТипаСсылка.Добавить(Метаданные.ПланыВидовХарактеристик	, "ПланВидовХарактеристик");
	СписокОбъектовМДТипаСсылка.Добавить(Метаданные.ПланыОбмена				, "ПланОбмена");
	СписокОбъектовМДТипаСсылка.Добавить(Метаданные.БизнесПроцессы			, "БизнесПроцесс");
	СписокОбъектовМДТипаСсылка.Добавить(Метаданные.Задачи					, "Задача");
	
	// Считываются ВСЕ.
	Для Каждого ЭлементСписка ИЗ СписокОбъектовМДТипаСсылка Цикл
		КоллекцияОбъектовМД = ЭлементСписка.Значение;
		Для Каждого ОбъектМД ИЗ КоллекцияОбъектовМД Цикл
			КоллекцияОбъектовМДТипаСсылка.Добавить(ОбъектМД, ЭлементСписка.Представление);
		КонецЦикла;
	КонецЦикла;
	
	Возврат КоллекцияОбъектовМДТипаСсылка;
	
КонецФункции

Функция ПолучитьКоличествоОбъектовТипаРегистр()
	
	// Значение ВАЖНО!
	СписокОбъектовТипаРегистр = Новый СписокЗначений;
	СписокОбъектовТипаРегистр.Добавить("РегистрСведений"	, "Регистры сведений ("+Метаданные.РегистрыСведений.Количество()+")");
	СписокОбъектовТипаРегистр.Добавить("РегистрНакопления"	, "Регистры накопления ("+Метаданные.РегистрыНакопления.Количество()+")");
	СписокОбъектовТипаРегистр.Добавить("РегистрБухгалтерии"	, "Регистры бухгалтерии ("+Метаданные.РегистрыБухгалтерии.Количество()+")");
	СписокОбъектовТипаРегистр.Добавить("РегистрРасчета"		, "Регистры расчета ("+Метаданные.РегистрыРасчета.Количество()+")");
	
	Возврат СписокОбъектовТипаРегистр;
	
КонецФункции

Функция ПолучитьКоллекциюОбъектовМДТипаРегистр()
	
	КоллекцИЯОбъектовМДТипаРегистр = Новый СписокЗначений;
	
	// Представление ВАЖНО! СЛИТНО!
	СписокОбъектовМДТипаРегистр = Новый СписокЗначений;
	СписокОбъектовМДТипаРегистр.Добавить(Метаданные.РегистрыСведений	, "РегистрСведений");
	СписокОбъектовМДТипаРегистр.Добавить(Метаданные.РегистрыНакопления	, "РегистрНакопления");
	СписокОбъектовМДТипаРегистр.Добавить(Метаданные.РегистрыБухгалтерии	, "РегистрБухгалтерии");
	СписокОбъектовМДТипаРегистр.Добавить(Метаданные.РегистрыРасчета		, "РегистрРасчета");
	
	// Считываются ВСЕ.
	Для Каждого ЭлементСписка ИЗ СписокОбъектовМДТипаРегистр Цикл
		КоллекцияОбъектовМД = ЭлементСписка.Значение;
		Для Каждого ОбъектМД ИЗ КоллекцияОбъектовМД Цикл
			КоллекцИЯОбъектовМДТипаРегистр.Добавить(ОбъектМД, ЭлементСписка.Представление);
		КонецЦикла;
	КонецЦикла;
	
	Возврат КоллекцИЯОбъектовМДТипаРегистр;
	
КонецФункции

// Возвращает для Значение строку типа "Справочник.Номенклатура".
// Используется при формировании Таблицы Реквизитов.
//
Функция ОбъектБДПолучитьПолноеСтроковоеИмяТипа(Значение) Экспорт
	
	ИмяТипа = "";
	
	мдЗначения = МетаДанные.НайтиПоТипу(ТипЗнч(Значение));
	Если НЕ мдЗначения = Неопределено Тогда
		Тип = ИмяБазовогоТипаПоОбъектуМетаданных(мдЗначения);
		ИмяТипа = "" + Тип + "." + мдЗначения.Имя;
	ИначеЕсли Строка(Значение) = "ХранилищеЗначения" Тогда
		ИмяТипа = "ХранилищеЗначения";
	ИначеЕсли Строка(ТипЗнч(Значение)) = "Уникальный идентификатор" Тогда
		ИмяТипа = "УникальныйИдентификатор";
	ИначеЕсли Строка(ТипЗнч(Значение)) = "ВидСчета" Тогда
		ИмяТипа = "ВидСчета";
	КонецЕсли;
	
	Возврат ИмяТипа;
	
КонецФункции

// Возвращает для Значение строку типа "Справочник".
//
Функция ОбъектБДПолучитьТипОбъекта(ОбъектБД) Экспорт
	
	Если ОбъектБД = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	мдОбъектаБД		= ОбъектБД.Метаданные();
	ТипОбъектаБД	= ИмяБазовогоТипаПоОбъектуМетаданных(мдОбъектаБД);
	
	Возврат ТипОбъектаБД;
	
КонецФункции

// Возвращает для Значение строку типа "Номенклатура".
// Используется при формировании Таблицы Реквизитов.
//
Функция ОбъектБДПолучитьИмяОбъекта(Значение) Экспорт
	
	ИмяОбъекта = "";
	
	мдЗначения = МетаДанные.НайтиПоТипу(ТипЗнч(Значение));
	Если НЕ мдЗначения = Неопределено Тогда
		ИмяОбъекта = мдЗначения.Имя;
	ИначеЕсли Строка(Значение) = "ХранилищеЗначения" Тогда
		ИмяОбъекта = "ХранилищеЗначения";
	ИначеЕсли Строка(ТипЗнч(Значение)) = "Уникальный идентификатор" Тогда
		ИмяОбъекта = "УникальныйИдентификатор";
	КонецЕсли;
	
	Возврат ИмяОбъекта;
	
КонецФункции

// Возвращает для Описание ОбъектаБД.
//
Функция ОбъектБДПолучитьОписаниеОбъекта(ОбъектБД) Экспорт
	
	Если ОбъектБД = Неопределено Тогда
		Возврат "";
	КонецЕсли;
	
	мдОбъектаБД		= ОбъектБД.Метаданные();
	ТипОбъектаБД	= ИмяБазовогоТипаПоОбъектуМетаданных(мдОбъектаБД);
	
	ОписаниеОбъектаБД	= "";
	Если ТипОбъектаБД = ИмяТипаСправочники() Тогда
		ОписаниеОбъектаБД = ""+?(мдОбъектаБД.КонтрольУникальности, "Контроль уникальности", "Без контроля уникальности") + "," + ?(мдОбъектаБД.Автонумерация, "Автонумерация", "Без автонумерации") + ",Серии кодов: " + мдОбъектаБД.СерииКодов + "," + ?(мдОбъектаБД.Владельцы.Количество() > 0, "Подчиненный,", "") + ?(мдОбъектаБД.Иерархический, мдОбъектаБД.ВидИерархии, "Неиерархический");
	ИначеЕсли ТипОбъектаБД = ИмяТипаДокументы() Тогда
		ОписаниеОбъектаБД = ""+?(мдОбъектаБД.КонтрольУникальности, "Контроль уникальности", "Без контроля уникальности") + "," + ?(мдОбъектаБД.Автонумерация, "Автонумерация", "Без автонумерации") + "," + ?(НЕ СокрЛП(мдОбъектаБД.Нумератор) = "", "Нумератор: " + мдОбъектаБД.Нумератор, "Без нумератора") + ",Период: " + СокрЛП(мдОбъектаБД.ПериодичностьНомера) + ",Проведение: " + ?(мдОбъектаБД.Проведение = МетаДанные.СвойстваОбъектов.Проведение.Разрешить, "Разрешено", "ЗАПРЕЩЕНО");
	ИначеЕсли ТипОбъектаБД = ИмяТипаПланыОбмена() Тогда
		ОписаниеОбъектаБД = ""+?(мдОбъектаБД.РаспределеннаяИнформационнаяБаза, "Распределенная БД", "НЕРаспределенная БД") + "," + "Режим блокировки: " + мдОбъектаБД.РежимУправленияБлокировкойДанных;
	ИначеЕсли ТипОбъектаБД = ИмяТипаПланыВидовХарактеристик() Тогда
		ОписаниеОбъектаБД = ""+?(мдОбъектаБД.КонтрольУникальности, "Контроль уникальности", "Без контроля уникальности") + "," + ?(мдОбъектаБД.Автонумерация, "Автонумерация", "Без автонумерации") + ",Серии кодов: " + мдОбъектаБД.СерииКодов + "," + ?(мдОбъектаБД.Иерархический, "Иерархический", "Неиерархический");
	ИначеЕсли ТипОбъектаБД = ИмяТипаБизнесПроцессы() Тогда
		ОписаниеОбъектаБД = ""+?(мдОбъектаБД.КонтрольУникальности, "Контроль уникальности", "Без контроля уникальности") + "," + ?(мдОбъектаБД.Автонумерация, "Автонумерация", "Без автонумерации") + ",ПериодичностьНомера: " + мдОбъектаБД.ПериодичностьНомера;
	ИначеЕсли ТипОбъектаБД = ИмяТипаЗадачи() Тогда
		ОписаниеОбъектаБД = ""+?(мдОбъектаБД.КонтрольУникальности, "Контроль уникальности", "Без контроля уникальности") + "," + ?(мдОбъектаБД.Автонумерация, "Автонумерация", "Без автонумерации") + ",Автопрефикс: " + мдОбъектаБД.АвтоПрефиксНомераЗадачи + ",Адресация: " + мдОбъектаБД.Адресация + ",Основной реквизит адресации: " + мдОбъектаБД.ОсновнойРеквизитАдресации + ",Текущий исполнитель: " + мдОбъектаБД.ТекущийИсполнитель;
	ИначеЕсли ТипОбъектаБД = ИмяТипаПланыСчетов() Тогда
		ОписаниеОбъектаБД = ""+?(мдОбъектаБД.КонтрольУникальности, "Контроль уникальности", "Без контроля уникальности") + "," + "Серии кодов: " + мдОбъектаБД.СерииКодов + "," + ?(мдОбъектаБД.АвтопорядокПоКоду, "АвтопорядокПоКоду", "Без АвтопорядкаПоКоду") + "," + "МаскаКода: """ + мдОбъектаБД.МаскаКода + """(" + мдОбъектаБД.ДлинаПорядка + "),MAX субконто: " + мдОбъектаБД.МаксКоличествоСубконто + ",ВидыСубконто: " + мдОбъектаБД.ВидыСубконто;
	ИначеЕсли ТипОбъектаБД = ИмяТипаПланыВидовРасчета() Тогда
		ОписаниеОбъектаБД = ""+?(мдОбъектаБД.ИспользованиеПериодаДействия, "Использует Период Действия", "Ни использует Период Действия") + "," + "Зависимость от базы: " + мдОбъектаБД.ЗависимостьОтВидовРасчета + ",Базовые виды расчета:,";
		Для Каждого БазовыйВидРасчета ИЗ мдОбъектаБД.БазовыеВидыРасчета Цикл
			ОписаниеОбъектаБД = ОписаниеОбъектаБД + БазовыйВидРасчета.Синоним + ",";
		КонецЦикла;
	КонецЕсли;
	
	Возврат ОписаниеОбъектаБД;
	
КонецФункции

// Возвращает для Выбранного ОбъектаБД значение Свойства Предопределенный, Удаленный, Проведенный.
//
Функция ОбъектБДПолучитьСостояниеОбъекта(ОбъектБД) Экспорт
	Перем ИмяПредопределенного;
	
	Если ОбъектБД = Неопределено Тогда
		Возврат "";
	КонецЕсли;
	
	мдОбъектаБД  = ОбъектБД.МетаДанные();
	ТипОбъектаБД = ИмяБазовогоТипаПоОбъектуМетаданных(мдОбъектаБД);
	
	СостояниеОбъектаБД = "";
	Если ТипОбъектаБД = ИмяТипаСправочники() Тогда
		ИмяПредопределенного = ОбъектБДПолучитьИмяПредопределенного(ОбъектБД, ТипОбъектаБД, мдОбъектаБД.Имя);
		ИмяПредопределенного = ?(ИмяПредопределенного = "", "", "(Имя:" + ИмяПредопределенного + ")");
		СостояниеОбъектаБД = ?(ОбъектБД.Предопределенный, "(*) - Предопределенный " + ИмяПредопределенного , "Непредопределенный");
		СостояниеОбъектаБД = СостояниеОбъектаБД + ?(ОбъектБД.ПометкаУдаления, ", ~Удаленный", "");
	ИначеЕсли ТипОбъектаБД = ИмяТипаДокументы() Тогда
		СостояниеОбъектаБД = ?(ОбъектБД.Проведен,"Проведен","Не проведен");
		СостояниеОбъектаБД = СостояниеОбъектаБД + ?(ОбъектБД.ПометкаУдаления, ", ~Удаленный", "");
	ИначеЕсли ТипОбъектаБД = ИмяТипаПланыОбмена() Тогда
		СостояниеОбъектаБД = ?(ОбъектБДПолучитьПризнакПредопределенныйОбъекта(ОбъектБД), "(*) ~Предопределенный", "~Непредопределенный");
		СостояниеОбъектаБД = СостояниеОбъектаБД + ?(ОбъектБД.ПометкаУдаления, ", ~Удаленный", "");
	ИначеЕсли ТипОбъектаБД = ИмяТипаПланыВидовХарактеристик() Тогда
		ИмяПредопределенного = ОбъектБДПолучитьИмяПредопределенного(ОбъектБД, ТипОбъектаБД, мдОбъектаБД.Имя);
		ИмяПредопределенного = ?(ИмяПредопределенного = "", "", "(Имя:" + ИмяПредопределенного + ")");
		СостояниеОбъектаБД = ?(ОбъектБД.Предопределенный, "(*) - Предопределенный " + ИмяПредопределенного, "Непредопределенный");
		СостояниеОбъектаБД = СостояниеОбъектаБД + ?(ОбъектБД.ПометкаУдаления, ", ~Удаленный", "");
	ИначеЕсли ТипОбъектаБД = ИмяТипаБизнесПроцессы() Тогда
		СостояниеОбъектаБД = ?(ОбъектБД.Завершен, "Завершен", ?(ОбъектБД.Стартован, "Стартован", "Не стартован"));
		СостояниеОбъектаБД = СостояниеОбъектаБД + ?(ОбъектБД.ПометкаУдаления, ", ~Удаленный", "");
	ИначеЕсли ТипОбъектаБД = ИмяТипаЗадачи() Тогда
		СостояниеОбъектаБД = ?(ОбъектБД.Выполнена, "Выполнена", "Не выполнена");
		СостояниеОбъектаБД = СостояниеОбъектаБД + ?(ОбъектБД.ПометкаУдаления, ", ~Удаленный", "");
	ИначеЕсли ТипОбъектаБД = ИмяТипаПланыСчетов() Тогда
		ИмяПредопределенного = ОбъектБДПолучитьИмяПредопределенного(ОбъектБД, ТипОбъектаБД, мдОбъектаБД.Имя);
		ИмяПредопределенного = ?(ИмяПредопределенного = "", "", "(Имя:" + ИмяПредопределенного + ")");
		СостояниеОбъектаБД = ?(ОбъектБД.Предопределенный, "(*) - Предопределенный " + ИмяПредопределенного, "Непредопределенный");
		СостояниеОбъектаБД = СостояниеОбъектаБД + ?(ОбъектБД.ПометкаУдаления, ", ~Удаленный", "");
	ИначеЕсли ТипОбъектаБД = ИмяТипаПланыВидовРасчета() Тогда
		ИмяПредопределенного = ОбъектБДПолучитьИмяПредопределенного(ОбъектБД, ТипОбъектаБД, мдОбъектаБД.Имя);
		ИмяПредопределенного = ?(ИмяПредопределенного = "", "", "(Имя:" + ИмяПредопределенного + ")");
		СостояниеОбъектаБД = ?(ОбъектБД.Предопределенный, "(*) - Предопределенный " + ИмяПредопределенного, "Непредопределенный");
		СостояниеОбъектаБД = СостояниеОбъектаБД + ?(ОбъектБД.ПометкаУдаления, ", ~Удаленный", "");
	КонецЕсли;
	
	Возврат СостояниеОбъектаБД;
	
КонецФункции

// Возвращает для Выбранного ОбъектаБД значение Свойства Предопределенный, Удаленный, Проведенный.
//
Функция ОбъектБДПолучитьИмяПредопределенного(ОбъектБД, ТипОбъектаБД, мдИмяОбъекта) Экспорт
	
	Если ТипОбъектаБД = ИмяТипаСправочники() Тогда
		Возврат Справочники[мдИмяОбъекта].ПолучитьИмяПредопределенного(ОбъектБД);
	ИначеЕсли ТипОбъектаБД = ИмяТипаПланыВидовХарактеристик() Тогда
		Возврат ПланыВидовХарактеристик[мдИмяОбъекта].ПолучитьИмяПредопределенного(ОбъектБД);
	ИначеЕсли ТипОбъектаБД = ИмяТипаПланыСчетов() Тогда
		Возврат ПланыСчетов[мдИмяОбъекта].ПолучитьИмяПредопределенного(ОбъектБД);
	ИначеЕсли ТипОбъектаБД = ИмяТипаПланыВидовРасчета() Тогда
		Возврат ПланыВидовРасчета[мдИмяОбъекта].ПолучитьИмяПредопределенного(ОбъектБД);
	Иначе
		ВызватьИсключение НСтр("ru='Недопустимый тип объекта: %'" + ТипОбъектаБД);
	КонецЕсли;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ПЛАНЫ ОБМЕНА.
//

Функция ПолучитьСписокУзловОбменаДляОбъекта(ОбъектБД) Экспорт
	Перем мдПланыОбмена, мдПланаОбмена, СоставПланаОбмена, ЭлементСостава, мдОбъектаБД;
	Перем ВыборкаУзлаОбмена, УзелОбмена, СписокУзловОбмена;
	Перем ГлавныйУзел;
	
	ГлавныйУзел = ПланыОбмена.ГлавныйУзел();	// Если Неопределено - то это ГлавныйУзел.
	
	мдПланыОбмена = Метаданные.ПланыОбмена;
	мдОбъектаБД = ОбъектБД.Метаданные();
	СписокУзловОбмена = Новый СписокЗначений;
	
	Для Каждого мдПланаОбмена ИЗ мдПланыОбмена Цикл
		
		СоставПланаОбмена = мдПланаОбмена.Состав;
		
		Для Каждого ЭлементСостава ИЗ СоставПланаОбмена Цикл
			
			Если НЕ ЭлементСостава.Метаданные = мдОбъектаБД Тогда
				Продолжить;
			КонецЕсли;

			ВыборкаУзлаОбмена = ПланыОбмена[мдПланаОбмена.Имя].Выбрать();
			Пока ВыборкаУзлаОбмена.Следующий() Цикл
				
				УзелОбмена = ВыборкаУзлаОбмена.Ссылка;
				
				Если мдПланаОбмена.РаспределеннаяИнформационнаяБаза Тогда
					Если ГлавныйУзел = Неопределено И ПланыОбмена[мдПланаОбмена.Имя].ЭтотУзел() = УзелОбмена Тогда	// Исключена возможность регистрации в ЦБ для ГлавногоУзла.
						Если ЭтотОбъект.ПоказыватьСообщения Тогда
							Сообщить("Центральная БД: План обмена """ + мдПланаОбмена.Имя + """
							|Исключен ГлавныйУзел: """ + УзелОбмена + """.");
						КонецЕсли;
						Продолжить;
					КонецЕсли;
					Если НЕ ГлавныйУзел = Неопределено И ПланыОбмена[мдПланаОбмена.Имя].ЭтотУзел() = УзелОбмена Тогда	// Исключена возможность регистрации в ПБ для самой себя.
						Если ЭтотОбъект.ПоказыватьСообщения Тогда
							Сообщить("Периферийная БД: План обмена """ + мдПланаОбмена.Имя + """
							|Исключен ЭтотУзел: """ + УзелОбмена + """.");
						КонецЕсли;
						Продолжить;
					КонецЕсли;
				Иначе	
					Если ПланыОбмена[мдПланаОбмена.Имя].ЭтотУзел() = УзелОбмена Тогда	// Исключена возможность регистрации в ПБ для самой себя.
						Если ЭтотОбъект.ПоказыватьСообщения Тогда
							Сообщить("План обмена """ + мдПланаОбмена.Имя + """
							|Исключен ЭтотУзел: """ + УзелОбмена + """.");
						КонецЕсли;
						Продолжить;
					КонецЕсли;
				КонецЕсли;
				
				СписокУзловОбмена.Добавить(УзелОбмена, "План обмена: [" + мдПланаОбмена.Имя + "]  Узел: [" + УзелОбмена + "]");
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат СписокУзловОбмена;
		
КонецФункции

Функция ЗарегистрироватьИзменения_УдалитьРегистрациюИзменений_ИзменениеЗарегистрировано_ОбъектаВУзлахОбмена(ОбъектБД, СписокУзловОбмена, Действие = "ЗарегистрироватьИзменения") Экспорт
	Перем мдПланаОбмена, мдОбъектаБД, ЭтоДокумент;
	Перем ЭлементУзелОбмена, УзелОбмена;
	Перем ИзменениеЗарегистрировано;
	Перем ДействиеПроизведено, Отказ;
	
	УстановитьПривилегированныйРежим(Истина);
	
	мдОбъектаБД = ОбъектБД.МетаДанные();
	ЭтоДокумент = ЭтоДокумент(мдОбъектаБД);
	
	Если ЭтоПланОбмена(мдОбъектаБД) Тогда
		Сообщить("План обмена - нерегистрируемый объект.");
		Возврат Ложь;
	КонецЕсли;
	
	Отказ = Ложь;
	НачатьТранзакцию();
	
	ДействиеПроизведено = Истина;
	Для Каждого ЭлементУзелОбмена ИЗ СписокУзловОбмена Цикл
		
		Если НЕ ЭлементУзелОбмена.Пометка Тогда
			Продолжить;
		КонецЕсли;
		
		УзелОбмена = ЭлементУзелОбмена.Значение;
		мдПланаОбмена = УзелОбмена.МетаДанные();
		
		ИзменениеЗарегистрировано = Ложь;
		
		Попытка
			Если Действие = "ЗарегистрироватьИзменения" Тогда
				
				Если НЕ ПолучитьРазрешениеНаВыполнениеДействияДляОбъектаВУзлеОбмена(мдПланаОбмена, УзелОбмена, ОбъектБД, "ЗарегистрироватьИзменения") Тогда
					Продолжить;
				КонецЕсли;
				
				ПланыОбмена.ЗарегистрироватьИзменения(УзелОбмена, ОбъектБД);
				ИзменениеЗарегистрировано = ПланыОбмена.ИзменениеЗарегистрировано(УзелОбмена, ОбъектБД);
				Если НЕ ИзменениеЗарегистрировано Тогда
					Сообщить("Узел: """ + УзелОбмена + """
					|Объект: """ + ОбъектБД + """
					|Регистрация изменений не произведена.");
					Если ДействиеПроизведено Тогда
						ДействиеПроизведено = Ложь;
					КонецЕсли;
				Иначе
					ЗарегистрироватьИзмененияРеквизитовОбъектаВУзлахОбмена(ОбъектБД, УзелОбмена, Отказ);
					Если Отказ Тогда
						Сообщить("При регистрации подчиненных объектов основного объекта:
						|""" + ОбъектБД + """
						|на УзлеОбмена: """ + УзелОбмена + """
						|произошла ошибка.");
					КонецЕсли;
				КонецЕсли;
				
			ИначеЕсли Действие = "УдалитьРегистрациюИзменений" Тогда
				
				Если НЕ ПолучитьРазрешениеНаВыполнениеДействияДляОбъектаВУзлеОбмена(мдПланаОбмена, УзелОбмена, ОбъектБД, "УдалитьРегистрациюИзменений") Тогда
					Продолжить;
				КонецЕсли;
				
				ПланыОбмена.УдалитьРегистрациюИзменений(УзелОбмена, ОбъектБД);
				ИзменениеЗарегистрировано = ПланыОбмена.ИзменениеЗарегистрировано(УзелОбмена, ОбъектБД);
				Если ИзменениеЗарегистрировано Тогда
					Сообщить("Узел: """ + УзелОбмена + """
					|Объект: """ + ОбъектБД + """
					|Отмена регистрации изменений не произведена.");
					Если ДействиеПроизведено Тогда
						ДействиеПроизведено = Ложь;
					КонецЕсли;
				КонецЕсли;
				
			Иначе	// Проверка регистрациии изменений.
				
				Если НЕ ПолучитьРазрешениеНаВыполнениеДействияДляОбъектаВУзлеОбмена(мдПланаОбмена, УзелОбмена, ОбъектБД, "ИзменениеЗарегистрировано") Тогда
					Продолжить;
				КонецЕсли;
				
				ИзменениеЗарегистрировано = ПланыОбмена.ИзменениеЗарегистрировано(УзелОбмена, ОбъектБД);
				Если ИзменениеЗарегистрировано Тогда
					Сообщить("Узел: """ + УзелОбмена + """
					|Объект: """ + ОбъектБД + """
					|Изменения объекта зарегистрированы.");
				Иначе
					Сообщить("Узел: """ + УзелОбмена + """
					|Объект: """ + ОбъектБД + """
					|Изменения объекта не зарегистрированы.");
				КонецЕсли;
			КонецЕсли;
		Исключение
			Отказ = Истина;
		КонецПопытки;
		
	КонецЦикла;
	
	Если НЕ Отказ Тогда
		ЗафиксироватьТранзакцию();
	Иначе	
		ОтменитьТранзакцию();
	КонецЕсли;
	
	Возврат ДействиеПроизведено;
	
КонецФункции

Функция ЗарегистрироватьИзмененияРеквизитовОбъектаВУзлахОбмена(ОбъектБД, УзелОбмена, Отказ)
	Перем мдОбъектаБД, мдПланаОбмена;
	Перем Реквизит, ТЧасть, ЗначениеРеквизита;
	
	мдПланаОбмена = УзелОбмена.МетаДанные();
	мдОбъектаБД = ОбъектБД.Метаданные();
	мдТЧасти = мдОбъектаБД.ТабличныеЧасти;
	
	Для Каждого Реквизит ИЗ мдОбъектаБД.Реквизиты Цикл
		
		ЗначениеРеквизита = ОбъектБД[Реквизит.Имя];
		Если НЕ ПолучитьРазрешениеНаВыполнениеДействияДляОбъектаВУзлеОбмена(мдПланаОбмена, УзелОбмена, ЗначениеРеквизита, "ЗарегистрироватьИзменения") Тогда
			Продолжить;
		КонецЕсли;
		
		ПланыОбмена.ЗарегистрироватьИзменения(УзелОбмена, ЗначениеРеквизита);
		ИзменениеЗарегистрировано = ПланыОбмена.ИзменениеЗарегистрировано(УзелОбмена, ЗначениеРеквизита);
		Если НЕ ИзменениеЗарегистрировано Тогда
			Сообщить("Узел: """ + УзелОбмена + """
			|Объект: """ + ЗначениеРеквизита + """
			|Регистрация изменений не произведена.");
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого ТЧасть ИЗ мдТЧасти Цикл
		
		Для Каждого СтрокаТЧ ИЗ ОбъектБД[ТЧасть.Имя] Цикл
			
			Для Каждого Реквизит ИЗ ТЧасть.Реквизиты Цикл
				
				ЗначениеРеквизита = СтрокаТЧ[Реквизит.Имя];
				Если НЕ ПолучитьРазрешениеНаВыполнениеДействияДляОбъектаВУзлеОбмена(мдПланаОбмена, УзелОбмена, ЗначениеРеквизита, "ЗарегистрироватьИзменения") Тогда
					Продолжить;
				КонецЕсли;
				
				ПланыОбмена.ЗарегистрироватьИзменения(УзелОбмена, ЗначениеРеквизита);
				ИзменениеЗарегистрировано = ПланыОбмена.ИзменениеЗарегистрировано(УзелОбмена, ЗначениеРеквизита);
				Если НЕ ИзменениеЗарегистрировано Тогда
					Сообщить("Узел: """ + УзелОбмена + """
					|Объект: """ + ЗначениеРеквизита + """
					|Регистрация изменений не произведена.");
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецФункции

Функция СоставПланаОбменаСодержитТип(ИмяПланаОбмена, Тип)
	
	Возврат Метаданные.ПланыОбмена[ИмяПланаОбмена].Состав.Содержит(Метаданные.НайтиПоТипу(Тип));
	
КонецФункции

Функция ПолучитьРазрешениеНаВыполнениеДействияДляОбъектаВУзлеОбмена(мдПланаОбмена, УзелОбмена, Значение, Действие = "ЗарегистрироватьИзменения")
	
	Если НЕ ЗначениеЗаполнено(Значение) ИЛИ НЕ ЗначениеСсылочногоТипа(Значение) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если НЕ СоставПланаОбменаСодержитТип(мдПланаОбмена.Имя, ТипЗнч(Значение)) Тогда
		Если ЭтотОбъект.ПоказыватьСообщения ИЛИ Действие = "ИзменениеЗарегистрировано" Тогда
			Сообщить("В состав Плана обмена """ + мдПланаОбмена.Имя + """
			|не входит объект: """ + ИмяБазовогоТипаПоОбъектуМетаданных(Значение.Метаданные()) + "." + ТипЗнч(Значение) + """.");
		КонецЕсли;
		Возврат Ложь;
	КонецЕсли;
	
	Если мдПланаОбмена.РаспределеннаяИнформационнаяБаза Тогда
		Если ЭтоПеречисление(Значение.Метаданные()) Тогда
			Если ЭтотОбъект.ПоказыватьСообщения ИЛИ Действие = "ИзменениеЗарегистрировано" Тогда
				Если Действие = "ЗарегистрироватьИзменения" Тогда
					Сообщить("Узел РИБ: """ + УзелОбмена + """
					|Для перечисления [тип """ + ТипЗнч(Значение) + """] = """ + Значение + """
					|в РИБ регистрация изменений в планах обмена не требуется.");
				ИначеЕсли Действие = "УдалитьРегистрациюИзменений" Тогда
					Сообщить("Узел РИБ: """ + УзелОбмена + """
					|Для перечисления [тип """ + ТипЗнч(Значение) + """] = """ + Значение + """
					|в РИБ удаление регистрациии изменений в планах обмена невозможно.");
				Иначе
					Сообщить("Узел РИБ: """ + УзелОбмена + """
					|Для перечисления [тип """ + ТипЗнч(Значение) + """] = """ + Значение + """
					|в РИБ Регистрациия/Удаление регистрации изменений в планах обмена не требуется.");
				КонецЕсли;
			КонецЕсли;
			Возврат Ложь;
		КонецЕсли;
	Иначе
		// Обмен между различными ИБ.
		Возврат Истина;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

// Возвращает для ПланаОбмена Состав.
//
Функция ОбъектБДПолучитьСоставПланаОбмена(ОбъектБД) Экспорт
	
	Если ОбъектБД = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	мдОбъектаБД	 = ОбъектБД.МетаДанные();
	
	Список = Новый СписокЗначений;
	
	Для Каждого Элемент ИЗ мдОбъектаБД.Состав Цикл
		Список.Добавить(""+ИмяБазовогоТипаПоОбъектуМетаданных(Элемент.Метаданные)+"."+Элемент.Метаданные.Имя);
	КонецЦикла;
	Список.СортироватьПоЗначению();
	
	Возврат Список;
	
КонецФункции

// Возвращает для БД: "Центральная БД"/"Периферийная БД" .
//
Функция ОбъектБДПолучитьПоложениеБДвРИБ(ОбъектБД) Экспорт
	
	мдОбъектаБД	 = ОбъектБД.МетаДанные();
	
	Если НЕ мдОбъектаБД.РаспределеннаяИнформационнаяБаза Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	БДвРИБ = ?(ПланыОбмена.ГлавныйУзел() = Неопределено И НЕ ЗначениеЗаполнено(ГлавныйУзелПредыдущий), "Центральная БД", "Периферийная БД");
	
	Возврат БДвРИБ;
	
КонецФункции

// Возвращает для ПланаОбмена Главный Узел.
//
Функция ОбъектБДПолучитьГлавныйУзелВРИБ() Экспорт
	
	Если ЗначениеЗаполнено(ГлавныйУзелПредыдущий) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	мдОбъектаБД	 = ОбъектБД.МетаДанные();
	
	Если НЕ мдОбъектаБД.РаспределеннаяИнформационнаяБаза Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Выборка = ПланыОбмена[мдОбъектаБД.Имя].Выбрать();
	Пока Выборка.Следующий() Цикл
	
		Если ОбъектБДПроверитьЭтоГлавныйУзелПланаОбмена(Выборка.Ссылка) Тогда
			Возврат Выборка.Ссылка;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции

// Возвращает для ПланаОбмена Признак ГлавныйУзел().
//
Функция ОбъектБДПроверитьЭтоГлавныйУзелПланаОбмена(ОбъектБД) Экспорт
	
	Если ОбъектБД = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ГлавныйУзелПредыдущий) Тогда		// В Периферийной БД ОТКЛЮЧЕН ГлавнйУзел.
		Если ОбъектБД = ГлавныйУзелПредыдущий Тогда			// ГлавныйУзелПредыдущий - Сохраненное значение отключенного ГлавногоУзла.
			Возврат Истина;
		Иначе
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;
	
	// Если Значение ГлавныйУзелПредыдущий НЕ заполнено, то - СТАНДАРТНАЯ ПРОВЕРКА.
	
	мдОбъектаБД	 = ОбъектБД.МетаДанные();
	
	Если НЕ мдОбъектаБД.РаспределеннаяИнформационнаяБаза Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ТипОбъектаБД = ИмяБазовогоТипаПоОбъектуМетаданных(мдОбъектаБД);
	
	ЭтотУзелПланаОбмена = ПланыОбмена[мдОбъектаБД.Имя].ЭтотУзел();
	Если ПланыОбмена.ГлавныйУзел() = Неопределено Тогда		// ГлавныйУзел Распределеной БД. Для ГлавногоУзла на ГлавномУзле: ПланыОбмена.ГлавныйУзел() = Неопределено.
		Если ЭтотУзелПланаОбмена = ОбъектБД Тогда			// Для ПланаОбмена такой Объект считается ПРЕДОПРЕДЕЛЕННЫМ.
			Возврат Истина;									// ГлавныйУзел.
		КонецЕсли;
	Иначе													// ПодчиненныйУзел Распределеной БД.
		Возврат ПланыОбмена.ГлавныйУзел() = ОбъектБД;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

// Возвращает для Справочника/ПВХ/ПланаОбмена значение Свойства Предопределенный.
//
Функция ОбъектБДПолучитьПризнакПредопределенныйОбъекта(ОбъектБД) Экспорт
	
	Если ОбъектБД = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ТипОбъектаБД = ИмяБазовогоТипаПоОбъектуМетаданных(ОбъектБД.МетаДанные());
	
	Предопределенный = Ложь;
	
	Если ТипОбъектаБД = ИмяТипаСправочники() ИЛИ ТипОбъектаБД = ИмяТипаПланыВидовХарактеристик() ИЛИ ТипОбъектаБД = ИмяТипаПланыСчетов() ИЛИ ТипОбъектаБД = ИмяТипаПланыВидовРасчета() Тогда
		Предопределенный = ОбъектБД.Предопределенный;
	ИначеЕсли ТипОбъектаБД = ИмяТипаПланыОбмена() Тогда
		ТипИзменяемогоЗначения			= ТипЗнч(ОбъектБД);
		ИмяРеквизитаИзменяемогоЗначения = "ОбъектБД";
		ИмяТаблицы						= ":)";
		РезультатПроверки = ОбъектБДПроверитьВозможностьРедактированияЗаписиЗначения(ОбъектБД, ИмяТаблицы, ИмяРеквизитаИзменяемогоЗначения, ТипИзменяемогоЗначения, ОбъектБД, Истина);
		Предопределенный = РезультатПроверки.Отказ;
	КонецЕсли;
	
	Возврат Предопределенный;
	
КонецФункции

// Возвращает для Документа Свойство Проведение = Разрешено/Неразрешено.
//
Функция ОбъектБДПолучитьПризнакПроведениеРазрешено(ОбъектБД) Экспорт
	
	Возврат ОбъектБД.Метаданные().Проведение;
	
КонецФункции

// Возвращает для Документа Список Документов, для которых является Основанием.
//
Функция ОбъектБДПолучитьСписокДокументовДляКоторыхОбъектЯвляетсяОснованием(Знач мдДокумента)
	Перем мдДок;
	Перем СписокДокументов;
	
	Если НЕ ТипЗнч(мдДокумента) = Тип("ОбъектМетаданных") Тогда
		мдДокумента = мдДокумента.Метаданные();
	КонецЕсли;
	
	СписокДокументов = Новый СписокЗначений;
	
	Для Каждого мдДок ИЗ Метаданные.Документы Цикл
		
		Если мдДок.ВводитсяНаОсновании.Содержит(мдДокумента) Тогда
			СписокДокументов.Добавить(мдДок.Имя);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат СписокДокументов;
	
КонецФункции

Функция ОбъектБДПолучитьСписокДокументовПоКритериюОтбора(ЗначениеКритерияОтбора, ВозвращаемаяКоллекция = "Таблица", ИсключитьПомеченныеНаУдаление = Ложь)
	
	Если Метаданные.КритерииОтбора.СвязанныеДокументы.Тип.СодержитТип(ТипЗнч(ЗначениеКритерияОтбора))  Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СвязанныеДокументы.Ссылка
		|ИЗ
		|	КритерийОтбора.СвязанныеДокументы(&ЗначениеКритерияОтбора) КАК СвязанныеДокументы";
		
		Если ИсключитьПомеченныеНаУдаление Тогда
			Запрос.Текст = Запрос.Текст + "
			|
			|ГДЕ
			|	НЕ СвязанныеДокументы.Ссылка.ПометкаУдаления";
		КонецЕсли;
		
		Запрос.УстановитьПараметр("ЗначениеКритерияОтбора",ЗначениеКритерияОтбора);
		Если ВозвращаемаяКоллекция = "Таблица" Тогда
			Возврат Запрос.Выполнить().Выгрузить();
		Иначе
			Возврат Запрос.Выполнить().Выбрать();
		КонецЕсли;
		
	Иначе
		
		Возврат Неопределено;
		
	КонецЕсли;
	
КонецФункции

// Функция выполняет поиск подчиненных документов текущего документа.
//
Функция ОбъектБДПолучитьСписокПодчиненныхДокументов(ДокументОснование) Экспорт
		
	Запрос = Новый Запрос;
	ТекстЗапроса = "";
	
	Для Каждого ЭлементСостава ИЗ Метаданные.КритерииОтбора.СтруктураПодчиненности.Состав Цикл
		
		ПутьКДанным = ЭлементСостава.ПолноеИмя();
		СтруктураПутьКДанным = РазобратьПутьКОбъектуМетаданных(ПутьКДанным);
		
		ЕСли НЕ ПравоДоступа("Чтение", СтруктураПутьКДанным.Метаданные) Тогда
			Продолжить;
		КонецЕсли;
		
		ИмяОбъекта = СтруктураПутьКДанным.ТипОбъекта + "." + СтруктураПутьКДанным.ВидОбъекта;
		
		ТекущаяСтрокаГДЕ = "ГДЕ " + СтруктураПутьКДанным.ВидОбъекта + "." +СтруктураПутьКДанным.ИмяРеквизита + " = &ЗначениеКритерияОтбора";
			
		ИмяТЧ = Лев(СтруктураПутьКДанным.ИмяРеквизита, Найти(СтруктураПутьКДанным.ИмяРеквизита, ".")-1);
		ИмяРеквизита = Лев(СтруктураПутьКДанным.ИмяРеквизита, Найти(СтруктураПутьКДанным.ИмяРеквизита, ".")-1);
		ТекстЗапроса = ТекстЗапроса + ?(ТекстЗапроса = "", "ВЫБРАТЬ РАЗРЕШЕННЫЕ", "ОБЪЕДИНИТЬ
		|ВЫБРАТЬ") + "
		|" + СтруктураПутьКДанным.ВидОбъекта +".Ссылка ИЗ " + ИмяОбъекта + "." + СтруктураПутьКДанным.ИмяТаблЧасти + " КАК " + СтруктураПутьКДанным.ВидОбъекта + "
		|" + СтрЗаменить(ТекущаяСтрокаГДЕ, "..", ".") + "
		|";
		
	КонецЦикла;
	
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("ЗначениеКритерияОтбора", ДокументОснование);
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

// Функция возвращает путь к объекту метаданных
// ТипОбъектаМетаданных.ИмяДокумента.ТабличнаяЧасть.ИмяТабличнойЧасти.Реквизит.ИмяРеквизита.
// ТипОбъектаМетаданных должен быть Справочник или Документ.
//
// Параметры:
//  ПутьКДанным - строка.
//
// Возвращаемое значение:
//  Структура - путь к объекту метаданных
//
Функция РазобратьПутьКОбъектуМетаданных(ПутьКДанным) Экспорт
	
	Структура = Новый Структура;
	
	СоответствиеИмен = Новый Массив();
	СоответствиеИмен.Добавить("ТипОбъекта");
	СоответствиеИмен.Добавить("ВидОбъекта");
	СоответствиеИмен.Добавить("ПутьКДанным");
	СоответствиеИмен.Добавить("ИмяТаблЧасти");
	СоответствиеИмен.Добавить("ИмяРеквизита");
	
	Для индекс = 1 по 3 Цикл
		
		Точка = Найти(ПутьКДанным, ".");
		ТекущееЗначение = Лев(ПутьКДанным, Точка-1);
		Структура.Вставить(СоответствиеИмен[индекс-1], ТекущееЗначение);
		ПутьКДанным = Сред(ПутьКДанным, Точка+1);
		
	КонецЦикла;
	
	ПутьКДанным = СтрЗаменить(ПутьКДанным, "Реквизит.", "");
	
	Если Структура.ПутьКДанным = "ТабличнаяЧасть" Тогда
		
		Для индекс = 4 по 5  Цикл 
			
			Точка = Найти(ПутьКДанным, ".");
			Если Точка = 0 Тогда
				ТекущееЗначение = ПутьКДанным;
			Иначе
				ТекущееЗначение = Лев(ПутьКДанным, Точка-1);
			КонецЕсли;
			
			Структура.Вставить(СоответствиеИмен[индекс-1], ТекущееЗначение);
			ПутьКДанным = Сред(ПутьКДанным,  Точка+1);
			
		КонецЦикла;
		
	Иначе
		
		Структура.Вставить(СоответствиеИмен[3], "");
		Структура.Вставить(СоответствиеИмен[4], ПутьКДанным);
		
	КонецЕсли;
	
	Если Структура.ТипОбъекта = "Документ" Тогда
		Структура.Вставить("Метаданные", Метаданные.Документы[Структура.ВидОбъекта]);
	Иначе
		Структура.Вставить("Метаданные", Метаданные.Справочники[Структура.ВидОбъекта]);
	КонецЕсли;
	
	Возврат Структура;
	
КонецФункции // РазобратьПутьКОбъектуМетаданных()

// Возвращает для Документа Список Последовательностей, в которые он входит.
//
Функция ОбъектБДПолучитьПоследовательностиДокумента(ОбъектБД)
	
	мдОбъектаБД = ОбъектБД.Метаданные();
	
	Список = Новый СписокЗначений;
	
	Для Каждого Последовательность ИЗ МетаДанные.Последовательности Цикл
		Если Последовательность.Документы.Содержит(мдОбъектаБД) Тогда
			Список.Добавить(Последовательность.Имя);
		КонецЕсли;
	КонецЦикла;
		
	Возврат Список;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////////////////////////
// РЕГИСТРАЦИЯ ИЗМЕНЕНИЙ В ПЛАНАХ ОБМЕНА. ПРОГРАММНЫЙ ИНТЕРФЕЙС
//

// Возвращает дерево значений, заполненное данными для выбора узла обмена. В дереве 2 уровня: 
// план обмена->узлы обмена. Служебные узлы выброшены. 
//
// Параметры:
//    ОбъектДанных - Ссылка или структура со значениями измерений набор записей. Для этих данных 
//                   которых  анализируются узлы обмена. Если не указано, то для всех
//    ИмяТаблицы   - Если ОбъектДанных - структура, то имя таблицы для набора записей
//
// Колонки в результате:
//    - Наименование                  - Представление плана обмена или узла обмена
//    - ИндексКартинки                - 1=план обмена, 2=узел , 3=помеченный для удаления узел
//    - ИндексКартинкиАвторегистрация - Если не указан параметр ОбъектДанных, то Неопределено 
//                                      Иначе: 0=нет, 1=запрещена, 2=разрешена.
//                                      Неопределено для плана обмена
//    - ПланОбменаИмя                 - Имя плана обмена узла
//    - Ссылка                        - Ссылка узла, Неопределено для плана обмена
//    - Код                           - Код узла, Неопределено для плана обмена
//    - НомерОтправленного            - Данные узла
//    - НомерПринятого                - Данные узла
//    - НомерСообщения                - Если указан объект, то номер сообщения для него, иначе NULL
//    - НеВыгружалось                 - Если указан объект, то флаг выгрузки, иначе NULL
//    - Пометка                       - Если указан объект, то 0 = нет регистрации, 1 - есть, иначе всегда 0
//    - ИсходнаяПометка               - Копия "Пометка"
//    - ИдентификаторСтроки           - Индекс добавленной строки (обход дерева сверху вниз слева направо)
//
Функция СформироватьДеревоУзлов(ОбъектДанных=Неопределено, ИмяТаблицы=Неопределено) Экспорт
	
	Дерево = Новый ДеревоЗначений;
	Колонки = Дерево.Колонки;
	Строки  = Дерево.Строки;
	
	Колонки.Добавить("Наименование");
	Колонки.Добавить("ИндексКартинки");
	Колонки.Добавить("ИндексКартинкиАвторегистрация");
	Колонки.Добавить("ПланОбменаИмя");
	Колонки.Добавить("Ссылка");
	Колонки.Добавить("Код");
	Колонки.Добавить("НомерОтправленного");
	Колонки.Добавить("НомерПринятого");
	Колонки.Добавить("НомерСообщения");
	Колонки.Добавить("НеВыгружалось");
	Колонки.Добавить("Пометка");
	Колонки.Добавить("ИсходнаяПометка");
	Колонки.Добавить("ИдентификаторСтроки");
	
	Запрос = Новый Запрос;
	Если ОбъектДанных=Неопределено Тогда
		МетаОбъект = Неопределено;
		ТекстЗапроса = "
			|ВЫБРАТЬ
			|	ПРЕДСТАВЛЕНИЕССЫЛКИ(Ссылка) КАК Наименование,
			|	ВЫБОР 
			|		КОГДА ПометкаУдаления ТОГДА 2 ИНАЧЕ 1
			|	КОНЕЦ КАК ИндексКартинки,
			|
			|	""{0}""            КАК ПланОбменаИмя,
			|	Код                КАК Код,
			|	Ссылка             КАК Ссылка,
			|	НомерОтправленного КАК НомерОтправленного,
			|	НомерПринятого     КАК НомерПринятого,
			|	NULL               КАК НомерСообщения,
			|	NULL               КАК НеВыгружалось,
			|	0                  КАК Пометка,
			|	0                  КАК ИсходнаяПометка
			|ИЗ
			|	ПланОбмена.{0} КАК ПланОбмена
			|ГДЕ
			|	ПланОбмена.Ссылка<>&ФильтрУзлов
			|";
		
	Иначе
		Если ТипЗнч(ОбъектДанных)=Тип("Структура") Тогда
			ТекстЗапроса = "";
			Для Каждого КлючЗначение Из ОбъектДанных Цикл
				ТекИмя = КлючЗначение.Ключ;
				ТекстЗапроса = ТекстЗапроса + "
					|И ТаблицаИзменений." + ТекИмя + "=&" + ТекИмя;
				Запрос.УстановитьПараметр(ТекИмя, ОбъектДанных[ТекИмя]);
			КонецЦикла;
			ТекИмяТаблицы = ИмяТаблицы;
			МетаОбъект    = МетаданныеПоПолномуИмени(ИмяТаблицы);
			
		ИначеЕсли ТипЗнч(ОбъектДанных)=Тип("Строка") Тогда
			ТекстЗапроса  = "";
			ТекИмяТаблицы = ОбъектДанных;
			МетаОбъект    = МетаданныеПоПолномуИмени(ОбъектДанных);
			
		Иначе
			ТекстЗапроса = "
				|И ТаблицаИзменений.Ссылка=&ОбъектРегистрации";
			Запрос.УстановитьПараметр("ОбъектРегистрации", ОбъектДанных);
			
			МетаОбъект    = ОбъектДанных.Метаданные();
			ТекИмяТаблицы = МетаОбъект.ПолноеИмя();
		КонецЕсли;
		
		ТекстЗапроса = "
			|ВЫБРАТЬ
			|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ПланОбмена.Ссылка) КАК Наименование,
			|	ВЫБОР 
			|		КОГДА ПланОбмена.Ссылка.ПометкаУдаления ТОГДА 2 ИНАЧЕ 1
			|	КОНЕЦ КАК ИндексКартинки,
			|
			|	""{0}""                               КАК ПланОбменаИмя,
			|	ПланОбмена.Ссылка.Код                 КАК Код,
			|	ПланОбмена.Ссылка.Ссылка              КАК Ссылка,
			|	ПланОбмена.Ссылка.НомерОтправленного  КАК НомерОтправленного,
			|	ПланОбмена.Ссылка.НомерПринятого      КАК НомерПринятого,
			|	ТаблицаИзменений.НомерСообщения       КАК НомерСообщения,
			|	ВЫБОР 
			|		КОГДА ТаблицаИзменений.НомерСообщения ЕСТЬ NULL
			|		ТОГДА ИСТИНА
			|		ИНАЧЕ ЛОЖЬ
			|	КОНЕЦ КАК НеВыгружалось,
			|	ВЫБОР 
			|		КОГДА КОЛИЧЕСТВО(ТаблицаИзменений.Узел)>0 ТОГДА 1 
			|		ИНАЧЕ 0
			|	КОНЕЦ КАК Пометка,
			|	ВЫБОР 
			|		КОГДА КОЛИЧЕСТВО(ТаблицаИзменений.Узел)>0 ТОГДА 1 
			|		ИНАЧЕ 0
			|	КОНЕЦ КАК ИсходнаяПометка
			|ИЗ
			|	ПланОбмена.{0} КАК ПланОбмена
			|ЛЕВОЕ СОЕДИНЕНИЕ
			|	" + ТекИмяТаблицы + ".Изменения КАК ТаблицаИзменений
			|ПО
			|	ТаблицаИзменений.Узел=ПланОбмена.Ссылка
			|	" + ТекстЗапроса + "
			|ГДЕ
			|	ПланОбмена.Ссылка<>&ФильтрУзлов
			|СГРУППИРОВАТЬ ПО 
			|	ПланОбмена.Ссылка, 
			|	ТаблицаИзменений.НомерСообщения
			|";
	КонецЕсли;
	
	ТекНомерСтроки = 0;
	Для Каждого Мета Из Метаданные.ПланыОбмена Цикл
		
		ИмяПлана = Мета.Имя;
		Попытка
			ЭтотУзелПланаОбмена = ПланыОбмена[ИмяПлана].ЭтотУзел();
		Исключение
			// Разделенный режим, пропускаем узел
			Продолжить;
		КонецПопытки;
		
		Авторегистрация = Неопределено;
		Если МетаОбъект<>Неопределено Тогда
			ЭлементСостава = Мета.Состав.Найти(МетаОбъект);
			Если ЭлементСостава=Неопределено Тогда
				// Не входит в текущий план обмена
				Продолжить;
			КонецЕсли;
			Авторегистрация = ?(ЭлементСостава.Авторегистрация=АвтоРегистрацияИзменений.Запретить, 1, 2);
		КонецЕсли;
		
		ИмяПлана = Мета.Имя;
		Запрос.Текст = СтрЗаменить(ТекстЗапроса, "{0}", ИмяПлана);
		Запрос.УстановитьПараметр("ФильтрУзлов", ЭтотУзелПланаОбмена);
		Результат = Запрос.Выполнить();
		
		Если Не Результат.Пустой() Тогда
			СтрокаПлана = Строки.Добавить();
			СтрокаПлана.Наименование   = Мета.Представление();
			СтрокаПлана.ИндексКартинки = 0;
			СтрокаПлана.ПланОбменаИмя  = ИмяПлана;
			
			СтрокаПлана.ИдентификаторСтроки = ТекНомерСтроки;
			ТекНомерСтроки = ТекНомерСтроки + 1;
			
			// Сортировка по представлению, в запросе нельзя
			ВременнаяТаблица = Результат.Выгрузить();
			ВременнаяТаблица.Сортировать("Наименование");
			Для Каждого СтрокаУзла Из ВременнаяТаблица Цикл;
				НоваяСтрока = СтрокаПлана.Строки.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаУзла);
				
				НоваяСтрока.ИндексКартинкиАвторегистрация = Авторегистрация;
				
				НоваяСтрока.ИдентификаторСтроки = ТекНомерСтроки;
				ТекНомерСтроки = ТекНомерСтроки + 1;
			КонецЦикла;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Дерево;
КонецФункции

// Возвращает структуру, описывающую метаданные для плана обмена.
//
// Параметры:
//    ИмяПланаОбмена - Если передана строка, то она интерпретируется как имя метаданных 
//                     плана обмена, для которого строится дерево конфигурации.
//                   - Если передан узел обмена, то дерево конфигурации строится для его плана обмена.
//                   - Если параметр неопределен, то строится дерево всей конфигурации.
//
//    Возвращает структуру с полями "СтруктураИмен", "СтруктураПредставлений", "Дерево",
// описывающую метаданные. Объекты, не входящие в состав плана обмена, выбрасываются.  
//
//    "СтруктураИмен" - структура, где имя - группа метаданных (константы, справочники и т.п.),
// значение - массив полных имен.
//
//    "СтруктураПредставлений" - структура, где имя - группа метаданных (константы, справочники
// и т.п.), значение - массив представлений. Порядок представлений  в массиве совпадает с массивом 
// полных имен.
//
//    "СтруктураАвторегистрации" - структура, где имя - группа метаданных (константы, справочники
// и т.п.), значение - массив флагов авторегистрации на узле. Порядок данных в массиве совпадает 
// с массивом полных имен. Входят только те группы, которые не входят в дерево. 
//
//    "Дерево" - дерево значений, 3 уровня: конфигурация->вид объекта->объект. 
// Колонки дерева:
//    - Наименование        - Представление вида объекта метаданных
//    - МетаПолноеИмя       - Полное имя объекта метаданных
//    - ИндексКартинки      - Зависит от метаданных
//    - Пометка             - Неопределено
//    - ИдентификаторСтроки - Индекс добавленной строки (обход дерева сверху вниз слева направо)
//    - Авторегистрация     - Если указан ИмяПланаОбмена, то для листьев: 1-разрешена, 2-запрещена. Иначе Неопределено
//
//    - КоличествоИзменений        - Неопределено, нужно для дальнейшего расчета
//    - КоличествоВыгруженных      - Неопределено, нужно для дальнейшего расчета
//    - КоличествоНевыгруженных    - Неопределено, нужно для дальнейшего расчета
//    - КоличествоИзмененийСтрокой - Неопределено, нужно для дальнейшего расчета
//
Функция СформироватьСтруктуруМетаданных(ИмяПланаОбмена=Неопределено) Экспорт
	
	Дерево = Новый ДеревоЗначений;
	Колонки = Дерево.Колонки;
	Колонки.Добавить("Наименование");
	Колонки.Добавить("МетаПолноеИмя");
	Колонки.Добавить("ИндексКартинки");
	Колонки.Добавить("Пометка");
	Колонки.Добавить("ИдентификаторСтроки");
	
	Колонки.Добавить("Авторегистрация");
	Колонки.Добавить("КоличествоИзменений");
	Колонки.Добавить("КоличествоВыгруженных");
	Колонки.Добавить("КоличествоНевыгруженных");
	Колонки.Добавить("КоличествоИзмененийСтрокой");
	
	// Корень
	СтрокаКорень = Дерево.Строки.Добавить();
	СтрокаКорень.Наименование = Метаданные.Представление();
	СтрокаКорень.ИндексКартинки = 0;
	СтрокаКорень.ИдентификаторСтроки = 0;
	
	// Параметры
	ТекПараметры = Новый Структура("СтруктураИмен, СтруктураПредставлений, СтруктураАвторегистрации, Строки", 
		Новый Структура, Новый Структура, Новый Структура, СтрокаКорень.Строки);
	
	Если ИмяПланаОбмена=Неопределено Тогда
		ПланОбмена = Неопределено;
	ИначеЕсли ТипЗнч(ИмяПланаОбмена)=Тип("Строка") Тогда
		ПланОбмена = Метаданные.ПланыОбмена[ИмяПланаОбмена];
	Иначе
		ПланОбмена = ИмяПланаОбмена.Метаданные();
	КонецЕсли;
	ТекПараметры.Вставить("ПланОбмена", ПланОбмена);
	
	
	Результат = Новый Структура("Дерево, СтруктураИмен, СтруктураПредставлений, СтруктураАвторегистрации", 
		Дерево, ТекПараметры.СтруктураИмен, ТекПараметры.СтруктураПредставлений, ТекПараметры.СтруктураАвторегистрации);
	
	ТекНомерСтроки = 1;
	СформироватьУровеньМетаданных(ТекНомерСтроки, ТекПараметры, 1,  2,  Ложь,   "Константы",               НСтр("ru='Константы'"));
	СформироватьУровеньМетаданных(ТекНомерСтроки, ТекПараметры, 3,  4,  Истина, "Справочники",             НСтр("ru='Справочники'"));
	СформироватьУровеньМетаданных(ТекНомерСтроки, ТекПараметры, 5,  6,  Истина, "Последовательности",      НСтр("ru='Последовательности'"));
	СформироватьУровеньМетаданных(ТекНомерСтроки, ТекПараметры, 7,  8,  Истина, "Документы",               НСтр("ru='Документы'"));
	СформироватьУровеньМетаданных(ТекНомерСтроки, ТекПараметры, 9,  10, Истина, "ПланыВидовХарактеристик", НСтр("ru='Планы видов характеристик'"));
	СформироватьУровеньМетаданных(ТекНомерСтроки, ТекПараметры, 11, 12, Истина, "ПланыСчетов",             НСтр("ru='Планы счетов'"));
	СформироватьУровеньМетаданных(ТекНомерСтроки, ТекПараметры, 13, 14, Истина, "ПланыВидовРасчета",       НСтр("ru='Планы видов расчета'"));
	СформироватьУровеньМетаданных(ТекНомерСтроки, ТекПараметры, 15, 16, Истина, "РегистрыСведений",        НСтр("ru='Регистры сведений'"));
	СформироватьУровеньМетаданных(ТекНомерСтроки, ТекПараметры, 17, 18, Истина, "РегистрыНакопления",      НСтр("ru='Регистры накопления'"));
	СформироватьУровеньМетаданных(ТекНомерСтроки, ТекПараметры, 19, 20, Истина, "РегистрыБухгалтерии",     НСтр("ru='Регистры бухгалтерии'"));
	СформироватьУровеньМетаданных(ТекНомерСтроки, ТекПараметры, 21, 22, Истина, "РегистрыРасчета",         НСтр("ru='Регистры расчета'"));
	СформироватьУровеньМетаданных(ТекНомерСтроки, ТекПараметры, 23, 24, Истина, "БизнесПроцессы",          НСтр("ru='Бизнес-процессы'"));
	СформироватьУровеньМетаданных(ТекНомерСтроки, ТекПараметры, 25, 26, Истина, "Задачи",                  НСтр("ru='Задачи'"));
	
	Возврат Результат;
КонецФункции

// Вычисляет количества изменений для объектов метаданных для узлов обмена.
//
// Параметры:
//    - СписокТаблиц - Или массив или коллекция "ключ/значение" где "значение" - массивы имен
//    - СписокУзлов  - Узел или массив списков узлов
//
// Возвращает таблицу значений. Колонки:
//    - МетаПолноеИмя           - Полное имя метаданных, для которых рассчитываем количество
//    - УзелОбмена              - Ссылка на узел обмена, для которого рассчитываем количество
//    - КоличествоИзменений     - Число
//    - КоличествоВыгруженных   - Число
//    - КоличествоНеВыгруженных - Число
//
Функция ПолучитьКоличествоИзменений(СписокТаблиц, СписокУзлов) Экспорт
	
	Результат = Новый ТаблицаЗначений;
	Колонки = Результат.Колонки;
	Колонки.Добавить("МетаПолноеИмя");
	Колонки.Добавить("УзелОбмена");
	Колонки.Добавить("КоличествоИзменений");
	Колонки.Добавить("КоличествоВыгруженных");
	Колонки.Добавить("КоличествоНеВыгруженных");
	
	Результат.Индексы.Добавить("МетаПолноеИмя");
	Результат.Индексы.Добавить("УзелОбмена");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СписокУзлов", СписокУзлов);
	
	// На входе или массив или структура/соответствие со многими массивами
	Если СписокТаблиц=Неопределено Тогда
		Возврат Результат;
	ИначеЕсли ТипЗнч(СписокТаблиц)=Тип("Массив") Тогда
		Источник = Новый Структура("_", СписокТаблиц);
	Иначе
		Источник = СписокТаблиц;
	КонецЕсли;
	
	// Пачками по 200 таблиц в запросе
	Текст = "";
	Номер = 0;
	Для Каждого КлючЗначение Из Источник Цикл
		Если ТипЗнч(КлючЗначение.Значение)<>Тип("Массив") Тогда
			Продолжить;
		КонецЕсли;
		
		Для Каждого Элемент Из КлючЗначение.Значение Цикл
			Если ПустаяСтрока(Элемент) Тогда
				Продолжить;
			КонецЕсли;
			
			Текст = Текст + ?(Текст="", "", "ОБЪЕДИНИТЬ ВСЕ") + " 
				|ВЫБРАТЬ 
				|	""" + Элемент + """ КАК МетаПолноеИмя,
				|	Узел                КАК УзелОбмена,
				|	КОЛИЧЕСТВО(*)              КАК КоличествоИзменений,
				|	КОЛИЧЕСТВО(НомерСообщения) КАК КоличествоВыгруженных,
				|	КОЛИЧЕСТВО(*) - КОЛИЧЕСТВО(НомерСообщения) КАК КоличествоНеВыгруженных
				|ИЗ
				|	" + Элемент + ".Изменения
				|ГДЕ
				|	Узел В (&СписокУзлов)
				|СГРУППИРОВАТЬ ПО
				|	Узел
				|";
				
			Номер = Номер + 1;
			Если Номер=200	Тогда
				Запрос.Текст = Текст;
				Выборка = Запрос.Выполнить().Выбрать();
				Пока Выборка.Следующий() Цикл
					ЗаполнитьЗначенияСвойств(Результат.Добавить(), Выборка);
				КонецЦикла;
				Текст = "";
				Номер = 0;
			КонецЕсли;
			
		КонецЦикла;
	КонецЦикла;
	
	// Дочитываем хвосты
	Если Текст<>"" Тогда
		Запрос.Текст = Текст;
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			ЗаполнитьЗначенияСвойств(Результат.Добавить(), Выборка);
		КонецЦикла;
	КонецЕсли;
	
	Возврат Результат;
КонецФункции	

// Возвращает объект метаданных по его полному имени. Пустая строка обозначает конфигурацию.
//
// Параметры:
//    - ИмяМетаданных - Имя объекта метаданных, например "Справочник.Валюты" или "Константы"
//
Функция МетаданныеПоПолномуИмени(ИмяМетаданных) Экспорт
	
	Если ПустаяСтрока(ИмяМетаданных) Тогда
		// Вся конфигурация
		Возврат Метаданные;
	КонецЕсли;
		
	Значение = Метаданные.НайтиПоПолномуИмени(ИмяМетаданных);
	Если Значение=Неопределено Тогда
		Значение = Метаданные[ИмяМетаданных];
	КонецЕсли;
	
	Возврат Значение;
КонецФункции	

// Возвращает флаг регистрации объекта на узле
//
// Параметры:
//    - Узел              - Узел плана обмена для которого получаем информацию, 
//    - ОбъектРегистрации - Объект, для которого получаем информацию. Может быть строкой - 
//                          обрабатываем метаданные, ссылкой или структурой со значениями
//                          изменений набора записей
//    - ИмяТаблицы        - Если ОбъектРегистрации - структура, то содержит имя таблицы для набора измерений
//
Функция ОбъектЗарегистрированНаУзле(Узел, ОбъектРегистрации, ИмяТаблицы=Неопределено) Экспорт
	ТипПараметра = ТипЗнч(ОбъектРегистрации);
	Если ТипПараметра=Тип("Строка") Тогда
		// Константа как метаданные
		Описание = ХарактеристикиПоМетаданным(ОбъектРегистрации);
		ТекущийОбъект = Описание.Менеджер.СоздатьМенеджерЗначения();
		
	ИначеЕсли ТипПараметра=Тип("Структура") Тогда
		// Набор измерений, ИмяТаблицы - чего
		Описание = ХарактеристикиПоМетаданным(ИмяТаблицы);
		ТекущийОбъект = Описание.Менеджер.СоздатьНаборЗаписей();
		Для Каждого КлючЗначение Из ОбъектРегистрации Цикл
			ТекущийОбъект.Отбор[КлючЗначение.Ключ].Установить(КлючЗначение.Значение);
		КонецЦикла;
		
	Иначе
		ТекущийОбъект = ОбъектРегистрации;
	КонецЕсли;
	
	Возврат ПланыОбмена.ИзменениеЗарегистрировано(Узел, ТекущийОбъект);
КонецФункции

// Изменяет регистрацию переданного.
//
// Параметры:
//    - Команда                 - Истина, если надо добавлять, Ложь, если удалять
//    - БезУчетаАвторегистрации - Истина, если не надо анализировать флаг авторегистрации
//    - Узел                    - Ссылка на узел плана обмена
//    - Данные                  - Ссылка, строка (полное имя метаданных), структура (измерения набора)
//                                или массив таких данных.
//    - ИмяТаблицы              - Если Данные является структурой, то содержит имя таблицы
//
// Возвращает структуру с общим числом объектов и числом успешно обработанных объектов
//
Функция ИзменитьРегистрациюНаСервере(Команда, БезУчетаАвторегистрации, Узел, Данные, ИмяТаблицы=Неопределено) Экспорт
	
	ПрочитатьНастройки();
	Результат = Новый Структура("Всего, Успешно", 0, 0);
	
	// Только при добавлении и работе в составе БСП
	НадоФильтрБСП = ТипЗнч(Команда)=Тип("Булево") И Команда И КонфигурацияПоддерживаетБСП И НастройкаКонтрольВыгрузкиОбъектов;
	
	Если ТипЗнч(Данные)=Тип("Массив") Тогда
		ДанныеРегистрации = Данные;
	Иначе
		ДанныеРегистрации = Новый Массив;
		ДанныеРегистрации.Добавить(Данные);
	КонецЕсли;
	
	Для Каждого Элемент Из ДанныеРегистрации Цикл
		
		Тип = ТипЗнч(Элемент);
		Значения = Новый Массив;
		
		Если Элемент=Неопределено Тогда
			// Вся конфигурация
			Если НадоФильтрБСП Тогда
				ДобавитьРезультаты(Результат, БСП_РегистрацияИзмененийМетаданных(Узел, ХарактеристикиПоМетаданным("Константы"), БезУчетаАвторегистрации) );
				ДобавитьРезультаты(Результат, БСП_РегистрацияИзмененийМетаданных(Узел, ХарактеристикиПоМетаданным("Справочники"), БезУчетаАвторегистрации) );
				ДобавитьРезультаты(Результат, БСП_РегистрацияИзмененийМетаданных(Узел, ХарактеристикиПоМетаданным("Документы"), БезУчетаАвторегистрации) );
				ДобавитьРезультаты(Результат, БСП_РегистрацияИзмененийМетаданных(Узел, ХарактеристикиПоМетаданным("Последовательности"), БезУчетаАвторегистрации) );
				ДобавитьРезультаты(Результат, БСП_РегистрацияИзмененийМетаданных(Узел, ХарактеристикиПоМетаданным("ПланыВидовХарактеристик"), БезУчетаАвторегистрации) );
				ДобавитьРезультаты(Результат, БСП_РегистрацияИзмененийМетаданных(Узел, ХарактеристикиПоМетаданным("ПланыСчетов"), БезУчетаАвторегистрации) );
				ДобавитьРезультаты(Результат, БСП_РегистрацияИзмененийМетаданных(Узел, ХарактеристикиПоМетаданным("ПланыВидовРасчета"), БезУчетаАвторегистрации) );
				ДобавитьРезультаты(Результат, БСП_РегистрацияИзмененийМетаданных(Узел, ХарактеристикиПоМетаданным("РегистрыСведений"), БезУчетаАвторегистрации) );
				ДобавитьРезультаты(Результат, БСП_РегистрацияИзмененийМетаданных(Узел, ХарактеристикиПоМетаданным("РегистрыНакопления"), БезУчетаАвторегистрации) );
				ДобавитьРезультаты(Результат, БСП_РегистрацияИзмененийМетаданных(Узел, ХарактеристикиПоМетаданным("РегистрыБухгалтерии"), БезУчетаАвторегистрации) );
				ДобавитьРезультаты(Результат, БСП_РегистрацияИзмененийМетаданных(Узел, ХарактеристикиПоМетаданным("РегистрыРасчета"), БезУчетаАвторегистрации) );
				ДобавитьРезультаты(Результат, БСП_РегистрацияИзмененийМетаданных(Узел, ХарактеристикиПоМетаданным("БизнесПроцессы"), БезУчетаАвторегистрации) );
				ДобавитьРезультаты(Результат, БСП_РегистрацияИзмененийМетаданных(Узел, ХарактеристикиПоМетаданным("Задачи"), БезУчетаАвторегистрации) );
				Продолжить;
				
			ИначеЕсли Не БезУчетаАвторегистрации Тогда
				// Регистрируем по группам с отсечением неподходящего
				ДобавитьРезультаты(Результат, ИзменитьРегистрациюНаСервере(Команда, Ложь, Узел, "Константы", ИмяТаблицы) );
				ДобавитьРезультаты(Результат, ИзменитьРегистрациюНаСервере(Команда, Ложь, Узел, "Справочники", ИмяТаблицы) );
				ДобавитьРезультаты(Результат, ИзменитьРегистрациюНаСервере(Команда, Ложь, Узел, "Документы", ИмяТаблицы) );
				ДобавитьРезультаты(Результат, ИзменитьРегистрациюНаСервере(Команда, Ложь, Узел, "Последовательности", ИмяТаблицы) );
				ДобавитьРезультаты(Результат, ИзменитьРегистрациюНаСервере(Команда, Ложь, Узел, "ПланыВидовХарактеристик", ИмяТаблицы) );
				ДобавитьРезультаты(Результат, ИзменитьРегистрациюНаСервере(Команда, Ложь, Узел, "ПланыСчетов", ИмяТаблицы) );
				ДобавитьРезультаты(Результат, ИзменитьРегистрациюНаСервере(Команда, Ложь, Узел, "ПланыВидовРасчета", ИмяТаблицы) );
				ДобавитьРезультаты(Результат, ИзменитьРегистрациюНаСервере(Команда, Ложь, Узел, "РегистрыСведений", ИмяТаблицы) );
				ДобавитьРезультаты(Результат, ИзменитьРегистрациюНаСервере(Команда, Ложь, Узел, "РегистрыНакопления", ИмяТаблицы) );
				ДобавитьРезультаты(Результат, ИзменитьРегистрациюНаСервере(Команда, Ложь, Узел, "РегистрыБухгалтерии", ИмяТаблицы) );
				ДобавитьРезультаты(Результат, ИзменитьРегистрациюНаСервере(Команда, Ложь, Узел, "РегистрыРасчета", ИмяТаблицы) );
				ДобавитьРезультаты(Результат, ИзменитьРегистрациюНаСервере(Команда, Ложь, Узел, "БизнесПроцессы", ИмяТаблицы) );
				ДобавитьРезультаты(Результат, ИзменитьРегистрациюНаСервере(Команда, Ложь, Узел, "Задачи", ИмяТаблицы) );
				Продолжить;
			Иначе
				// Регистрируем сразу все
				Значения.Добавить(Неопределено);
			КонецЕсли;
			
		ИначеЕсли Тип=Тип("Строка") Тогда
			// Метаданные, возможно как коллекция, так и конкретный вид, на авторегистрацию смотрим
			Описание = ХарактеристикиПоМетаданным(Элемент);
			Если НадоФильтрБСП Тогда
				ДобавитьРезультаты(Результат, БСП_РегистрацияИзмененийМетаданных(Узел, Описание, БезУчетаАвторегистрации) );
				Продолжить;
				
			ИначеЕсли БезУчетаАвторегистрации Тогда
				Если Описание.ЭтоКоллекция Тогда
					Для Каждого Мета Из Описание.Метаданные Цикл
						ДобавитьРезультаты(Результат, ИзменитьРегистрациюНаСервере(Команда, БезУчетаАвторегистрации, Узел, Мета.ПолноеИмя(), ИмяТаблицы) );
					КонецЦикла;
					Продолжить;
				Иначе
					Мета = Описание.Метаданные;
					ЭлементСостава = Узел.Метаданные().Состав.Найти(Мета);
					Если ЭлементСостава=Неопределено Тогда
						Продолжить;
					КонецЕсли;
					Если Описание.ЭтоКонстанта Тогда
						Значения.Добавить(Описание.Менеджер.СоздатьМенеджерЗначения());
					Иначе
						Значения.Добавить(Описание.Метаданные);
					КонецЕсли;
				КонецЕсли;
				
			Иначе
				// Отсеиваем неподходящие по авторегистрации
				Если Описание.ЭтоКоллекция Тогда
					// Регистрируем поодиночке
					Для Каждого Мета Из Описание.Метаданные Цикл
						ДобавитьРезультаты(Результат, ИзменитьРегистрациюНаСервере(Команда, БезУчетаАвторегистрации, Узел, Мета.ПолноеИмя(), ИмяТаблицы) );
					КонецЦикла;
					Продолжить;
				Иначе
					Мета = Описание.Метаданные;
					ЭлементСостава = Узел.Метаданные().Состав.Найти(Мета);
					Если ЭлементСостава=Неопределено Или ЭлементСостава.Авторегистрация<>АвтоРегистрацияИзменений.Разрешить Тогда
						Продолжить;
					КонецЕсли;
					Если Описание.ЭтоКонстанта Тогда
						Значения.Добавить(Описание.Менеджер.СоздатьМенеджерЗначения());
					Иначе
						Значения.Добавить(Мета);
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
			// Смотрим опциональные варианты, Значения[0] - метаданные конкретного вида с именем "Элемент"
			Для Каждого ТекЭлемент Из ПолучитьДополнительныеОбъектыРегистрации(Элемент, Узел, БезУчетаАвторегистрации) Цикл
				Значения.Добавить(ТекЭлемент);
			КонецЦикла;
			
		ИначеЕсли Тип=Тип("Структура") Тогда
			// Это или конкретный набор записей, или результат выбора ссылочного типа отбором
			Описание = ХарактеристикиПоМетаданным(ИмяТаблицы);
			Если Описание.ЭтоСсылка Тогда
				ДобавитьРезультаты(Результат, ИзменитьРегистрациюНаСервере(Команда, БезУчетаАвторегистрации, Узел, Элемент.Ссылка) );
				Продолжить;
			КонецЕсли;
			// Конкретный набор записей, на авторегистрацию уже не смотрим
			Если НадоФильтрБСП Тогда
				ДобавитьРезультаты(Результат, БСП_РегистрацияИзмененийНабора(Узел, Элемент, Описание) );
				Продолжить;
			КонецЕсли;
			
			Набор = Описание.Менеджер.СоздатьНаборЗаписей();
			Для Каждого КлючЗначение Из Элемент Цикл
				Если КлючЗначение.Ключ = "ОбластьДанныхОсновныеДанные" Тогда
					Продолжить;
				КонецЕсли;
				Набор.Отбор[КлючЗначение.Ключ].Установить(КлючЗначение.Значение);
			КонецЦикла;
			Значения.Добавить(Набор);
			// Смотрим опциональные варианты
			Для Каждого ТекЭлемент Из ПолучитьДополнительныеОбъектыРегистрации(Элемент, Узел, БезУчетаАвторегистрации, ИмяТаблицы) Цикл
				Значения.Добавить(ТекЭлемент);
			КонецЦикла;
			
		Иначе
			// Конкретная ссылка, на авторегистрацию уже не смотрим
			Если НадоФильтрБСП Тогда
				ДобавитьРезультаты(Результат, БСП_РегистрацияИзмененийСсылки(Узел, Элемент) );
				Продолжить;
				
			КонецЕсли;
			Значения.Добавить(Элемент);
			// Смотрим опциональные варианты
			Для Каждого ТекЭлемент Из ПолучитьДополнительныеОбъектыРегистрации(Элемент, Узел, БезУчетаАвторегистрации) Цикл
				Значения.Добавить(ТекЭлемент);
			КонецЦикла;
			
		КонецЕсли;
		
		// Собственно регистрация, уже без фильтра
		Для Каждого ТекЗначение Из Значения Цикл
			ВыполнитьКомандуРегистрацииОбъекта(Команда, Узел, ТекЗначение);
			Результат.Успешно = Результат.Успешно + 1;
			Результат.Всего   = Результат.Всего   + 1;
		КонецЦикла;
		
	КонецЦикла; // Перебор объектов в массиве данных для регистрации
	
	Возврат Результат;
КонецФункции

// Возвращает начало полного имени формы для открытия по переданному объекту
//
Функция ПолучитьИмяФормы(ТекущийОбъект=Неопределено) Экспорт
	
	Тип = ТипЗнч(ТекущийОбъект);
	Если Тип=Тип("ДинамическийСписок") Тогда
		Возврат ТекущийОбъект.ОсновнаяТаблица + ".";
	ИначеЕсли Тип=Тип("Строка") Тогда
		Возврат ТекущийОбъект + ".";
	КонецЕсли;
	
	Мета = ?(ТекущийОбъект=Неопределено, Метаданные(), ТекущийОбъект.Метаданные());
	Возврат Мета.ПолноеИмя() + ".";
КонецФункции	

// Рекурсивное обслуживание иерархических пометок с тремя состояниями в дереве. 
//
// Параметры:
//    - ДанныеСтроки - ДанныеФормыЭлементДерева. Пометка хранится в числовой колонке "Пометка"  
//
Процедура ИзменениеПометки(ДанныеСтроки) Экспорт
	ДанныеСтроки.Пометка = ДанныеСтроки.Пометка % 2;
	ПроставитьПометкиВниз(ДанныеСтроки);
	ПроставитьПометкиВверх(ДанныеСтроки);
КонецПроцедуры

// Рекурсивное обслуживание иерархических пометок с тремя состояниями в дереве. 
//
// Параметры:
//    - ДанныеСтроки - ДанныеФормыЭлементДерева. Пометка хранится в числовой колонке "Пометка"  
//
Процедура ПроставитьПометкиВниз(ДанныеСтроки) Экспорт
	Значение = ДанныеСтроки.Пометка;
	Для Каждого Потомок Из ДанныеСтроки.ПолучитьЭлементы() Цикл
		Потомок.Пометка = Значение;
		ПроставитьПометкиВниз(Потомок);
	КонецЦикла;
КонецПроцедуры

// Рекурсивное обслуживание иерархических пометок с тремя состояниями в дереве. 
//
// Параметры:
//    - ДанныеСтроки - ДанныеФормыЭлементДерева. Пометка хранится в числовой колонке "Пометка"  
//
Процедура ПроставитьПометкиВверх(ДанныеСтроки) Экспорт
	РодительСтроки = ДанныеСтроки.ПолучитьРодителя();
	Если РодительСтроки<>Неопределено Тогда
		ВсеИстина = Истина;
		НеВсеЛожь = Ложь;
		Для Каждого Потомок Из РодительСтроки.ПолучитьЭлементы() Цикл
			ВсеИстина = ВсеИстина И (Потомок.Пометка = 1);
			НеВсеЛожь = НеВсеЛожь Или Булево(Потомок.Пометка);
		КонецЦикла;
		Если ВсеИстина Тогда
			РодительСтроки.Пометка = 1;
		ИначеЕсли НеВсеЛожь Тогда
			РодительСтроки.Пометка = 2;
		Иначе
			РодительСтроки.Пометка = 0;
		КонецЕсли;
		ПроставитьПометкиВверх(РодительСтроки);
	КонецЕсли;
КонецПроцедуры

// Чтение реквизитов узла обмена.
//
// Параметры:
//    - Ссылка - Ссылка на узел обмена
//    - Данные - Список имен реквизитов для чтения через запятую
//
// Возвращает структуру с данными или Неопределено, если нет данных по переданной ссылке
//
Функция ПолучитьПараметрыУзлаОбмена(Ссылка, Данные) Экспорт
	Запрос = Новый Запрос("
		|ВЫБРАТЬ " + Данные + " ИЗ " + Ссылка.Метаданные().ПолноеИмя() + "
		|ГДЕ Ссылка=&Ссылка
		|");
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Времянка = Запрос.Выполнить().Выгрузить();
	Если Времянка.Количество()=0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Результат = Новый Структура(Данные);
	ЗаполнитьЗначенияСвойств(Результат, Времянка[0]);
	Возврат Результат;
КонецФункции	

// Запись реквизитов узла обмена.
//
// Параметры:
//    - Ссылка - Ссылка на узел обмена
//    - Данные - Список имен реквизитов для чтения через запятую
//
Процедура УстановитьПараметрыУзлаОбмена(Ссылка, Данные) Экспорт
	
	ОбъектУзла = Ссылка.ПолучитьОбъект();
	Если ОбъектУзла=Неопределено Тогда
		// Ссылка на удаленный объект
		Возврат;
	КонецЕсли;
	
	Изменен = Ложь;
	Для Каждого Элемент Из Данные Цикл
		Если ОбъектУзла[Элемент.Ключ]<>Элемент.Значение Тогда
			Изменен = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если Изменен Тогда
		ЗаполнитьЗначенияСвойств(ОбъектУзла, Данные);
		ОбъектУзла.Записать();
	КонецЕсли;
КонецПроцедуры

// Возвращает описание данных по имени таблицы/полному имени метаданных или метаданным
//
// Параметры:
//    - ИмяТаблицы - Имя таблицы, например "Справочник.Валюты"
//
Функция ХарактеристикиПоМетаданным(ИмяТаблицыМетаданных) Экспорт
	
	ЭтоПоследовательность = Ложь;
	ЭтоКоллекция          = Ложь;
	ЭтоКонстанта          = Ложь;
	ЭтоСсылка             = Ложь;
	ЭтоНабор              = Ложь;
	Менеджер              = Неопределено;
	ИмяТаблицы            = "";
	
	Если ТипЗнч(ИмяТаблицыМетаданных)=Тип("Строка") Тогда
		Мета = МетаданныеПоПолномуИмени(ИмяТаблицыМетаданных);
		ИмяТаблицы = ИмяТаблицыМетаданных;
	ИначеЕсли ТипЗнч(ИмяТаблицы)=Тип("Тип") Тогда
		Мета = Метаданные.НайтиПоТипу(ИмяТаблицыМетаданных);
		ИмяТаблицы = Мета.ПолноеИмя();
	Иначе 		
		Мета = ИмяТаблицыМетаданных;
		ИмяТаблицы = Мета.ПолноеИмя();
	КонецЕсли;
	
	Если Мета=Метаданные.Константы Тогда
		ЭтоКоллекция = Истина;
		ЭтоКонстанта = Истина;
		Менеджер     = Константы;
		
	ИначеЕсли Мета=Метаданные.Справочники Тогда
		ЭтоКоллекция = Истина;
		ЭтоСсылка    = Истина;
		Менеджер      = Справочники;
		
	ИначеЕсли Мета=Метаданные.Документы Тогда
		ЭтоКоллекция = Истина;
		ЭтоСсылка    = Истина;
		Менеджер     = Документы;
		
	ИначеЕсли Мета=Метаданные.Перечисления Тогда
		ЭтоКоллекция = Истина;
		ЭтоСсылка    = Истина;
		Менеджер     = Перечисления;
		
	ИначеЕсли Мета=Метаданные.ПланыВидовХарактеристик Тогда
		ЭтоКоллекция = Истина;
		ЭтоСсылка    = Истина;
		Менеджер     = ПланыВидовХарактеристик;
		
	ИначеЕсли Мета=Метаданные.ПланыСчетов Тогда
		ЭтоКоллекция = Истина;
		ЭтоСсылка    = Истина;
		Менеджер     = ПланыСчетов;
		
	ИначеЕсли Мета=Метаданные.ПланыВидовРасчета Тогда
		ЭтоКоллекция = Истина;
		ЭтоСсылка    = Истина;
		Менеджер     = ПланыВидовРасчета;
		
	ИначеЕсли Мета=Метаданные.БизнесПроцессы Тогда
		ЭтоКоллекция = Истина;
		ЭтоСсылка    = Истина;
		Менеджер     = БизнесПроцессы;
		
	ИначеЕсли Мета=Метаданные.Задачи Тогда
		ЭтоКоллекция = Истина;
		ЭтоСсылка    = Истина;
		Менеджер     = Задачи;
		
	ИначеЕсли Мета=Метаданные.Последовательности Тогда
		ЭтоНабор              = Истина;
		ЭтоПоследовательность = Истина;
		ЭтоКоллекция          = Истина;
		Менеджер              = Последовательности;
		
	ИначеЕсли Мета=Метаданные.РегистрыСведений Тогда
		ЭтоКоллекция = Истина;
		ЭтоНабор     = Истина;
		Менеджер 	 = РегистрыСведений;
		
	ИначеЕсли Мета=Метаданные.РегистрыНакопления Тогда
		ЭтоКоллекция = Истина;
		ЭтоНабор     = Истина;
		Менеджер     = РегистрыНакопления;
		
	ИначеЕсли Мета=Метаданные.РегистрыБухгалтерии Тогда
		ЭтоКоллекция = Истина;
		ЭтоНабор     = Истина;
		Менеджер     = РегистрыБухгалтерии;
		
	ИначеЕсли Мета=Метаданные.РегистрыРасчета Тогда
		ЭтоКоллекция = Истина;
		ЭтоНабор     = Истина;
		Менеджер     = РегистрыРасчета;
		
	ИначеЕсли Метаданные.Константы.Содержит(Мета) Тогда
		ЭтоКонстанта = Истина;
		Менеджер     = Константы[Мета.Имя];
		
	ИначеЕсли Метаданные.Справочники.Содержит(Мета) Тогда
		ЭтоСсылка = Истина;
		Менеджер  = Справочники[Мета.Имя];
		
	ИначеЕсли Метаданные.Документы.Содержит(Мета) Тогда
		ЭтоСсылка = Истина;
		Менеджер  = Документы[Мета.Имя];
		
	ИначеЕсли Метаданные.Последовательности.Содержит(Мета) Тогда
		ЭтоНабор              = Истина;
		ЭтоПоследовательность = Истина;
		Менеджер              = Последовательности[Мета.Имя];
		
	ИначеЕсли Метаданные.Перечисления.Содержит(Мета) Тогда
		ЭтоСсылка = Истина;
		Менеджер  = Перечисления[Мета.Имя];
		
	ИначеЕсли Метаданные.ПланыВидовХарактеристик.Содержит(Мета) Тогда
		ЭтоСсылка = Истина;
		Менеджер  = ПланыВидовХарактеристик[Мета.Имя];
		
	ИначеЕсли Метаданные.ПланыСчетов.Содержит(Мета) Тогда
		ЭтоСсылка = Истина;
		Менеджер = ПланыСчетов[Мета.Имя];
		
	ИначеЕсли Метаданные.ПланыВидовРасчета.Содержит(Мета) Тогда
		ЭтоСсылка = Истина;
		Менеджер  = ПланыВидовРасчета[Мета.Имя];
		
	ИначеЕсли Метаданные.РегистрыСведений.Содержит(Мета) Тогда
		ЭтоНабор = Истина;
		Менеджер = РегистрыСведений[Мета.Имя];
		
	ИначеЕсли Метаданные.РегистрыНакопления.Содержит(Мета) Тогда
		ЭтоНабор = Истина;
		Менеджер = РегистрыНакопления[Мета.Имя];
		
	ИначеЕсли Метаданные.РегистрыБухгалтерии.Содержит(Мета) Тогда
		ЭтоНабор = Истина;
		Менеджер = РегистрыБухгалтерии[Мета.Имя];
		
	ИначеЕсли Метаданные.РегистрыРасчета.Содержит(Мета) Тогда
		ЭтоНабор = Истина;
		Менеджер = РегистрыРасчета[Мета.Имя];
		
	ИначеЕсли Метаданные.БизнесПроцессы.Содержит(Мета) Тогда
		ЭтоСсылка = Истина;
		Менеджер = БизнесПроцессы[Мета.Имя];
		
	ИначеЕсли Метаданные.Задачи.Содержит(Мета) Тогда
		ЭтоСсылка = Истина;
		Менеджер = Задачи[Мета.Имя];
		
	Иначе
		МетаРодитель = Мета.Родитель();
		Если МетаРодитель<>Неопределено И Метаданные.РегистрыРасчета.Содержит(МетаРодитель) Тогда
			// Перерасчет
			ЭтоНабор = Истина;
			Менеджер = РегистрыРасчета[МетаРодитель.Имя].Перерасчеты[Мета.Имя];
		КонецЕсли;
		
	КонецЕсли;
		
	Возврат Новый Структура("ИмяТаблицы, Метаданные, Менеджер, ЭтоНабор, ЭтоСсылка, ЭтоКонстанта, ЭтоПоследовательность, ЭтоКоллекция",
		ИмяТаблицы, Мета, Менеджер, 
		ЭтоНабор, ЭтоСсылка, ЭтоКонстанта, ЭтоПоследовательность, ЭтоКоллекция);
	
КонецФункции

// Возвращает таблицу, описывающую измерения для регистрации изменений набора данных
//
// Параметры:
//    - ИмяТаблицы   - Имя таблицы, например "РегистрСведений.КурсыВалют"
//    - ВсеИзмерения - Флаг того, что для регистра сведений получаем все измерения, а не 
//                     только основные и ведущие
//
// Возвращает таблицу с колонками:
//    - Имя         - Строка имени измерения
//    - ТипЗначения - ОписаниеТипов
//    - Заголовок   - Представление для измерения
//
Функция ИзмеренияНабораЗаписей(ИмяТаблицы, ВсеИзмерения=Ложь) Экспорт
	
	Если ТипЗнч(ИмяТаблицы)=Тип("Строка") Тогда
		Мета = МетаданныеПоПолномуИмени(ИмяТаблицы);
	Иначе
		Мета = ИмяТаблицы;
	КонецЕсли;
	
	// Определяем ключевые поля
	Измерения = Новый ТаблицаЗначений;
	Колонки = Измерения.Колонки;
	Колонки.Добавить("Имя");
	Колонки.Добавить("ТипЗначения");
	Колонки.Добавить("Заголовок");
	
	Если Не ВсеИзмерения Тогда
		// Что-то регистрируемое
		НеУчитывать = "НомерСообщения, Узел,";
		
		Запрос = Новый Запрос("ВЫБРАТЬ * ИЗ " + Мета.ПолноеИмя() + ".Изменения ГДЕ ЛОЖЬ");
		ПустойРезультат = Запрос.Выполнить();
		Для Каждого КолонкаРезультата Из ПустойРезультат.Колонки Цикл
			ИмяКолонки = КолонкаРезультата.Имя;
			Если (Найти(НеУчитывать, ИмяКолонки + ",")=0 И НЕ Мета.Измерения.Найти(ИмяКолонки) = Неопределено) 
				ИЛИ ИмяКолонки = "Регистратор" Тогда
				Строка = Измерения.Добавить();
				Строка.Имя         = ИмяКолонки;
				Строка.ТипЗначения = КолонкаРезультата.ТипЗначения;
				
				МетаИзм = Мета.Измерения.Найти(ИмяКолонки);
				Строка.Заголовок = ?(МетаИзм=Неопределено, ИмяКолонки, МетаИзм.Представление());
			КонецЕсли;
		КонецЦикла;
		
		Возврат Измерения;
	КонецЕсли;
	
	// Все измерения
	
	ЭтоРегистрСведений = Метаданные.РегистрыСведений.Содержит(Мета);
	
	// Регистратор
	Если Метаданные.РегистрыНакопления.Содержит(Мета)
	 Или Метаданные.РегистрыБухгалтерии.Содержит(Мета)
	 Или Метаданные.РегистрыРасчета.Содержит(Мета)
	 Или (ЭтоРегистрСведений И Мета.РежимЗаписи=Метаданные.СвойстваОбъектов.РежимЗаписиРегистра.ПодчинениеРегистратору)
	 Или Метаданные.Последовательности.Содержит(Мета)
	Тогда
		Строка = Измерения.Добавить();
		Строка.Имя         = "Регистратор";
		Строка.ТипЗначения = Документы.ТипВсеСсылки();
		Строка.Заголовок   = "Регистратор";
	КонецЕсли;
	
	// Период
	Если ЭтоРегистрСведений И Мета.ОсновнойОтборПоПериоду Тогда
		Строка = Измерения.Добавить();
		Строка.Имя         = "Период";
		Строка.ТипЗначения = Новый ОписаниеТипов("Дата");
		Строка.Заголовок   = "Период";
	КонецЕсли;
	
	// Измерения
	Если ЭтоРегистрСведений Тогда
		Для Каждого МетаИзм Из Мета.Измерения Цикл
			Строка = Измерения.Добавить();
			Строка.Имя         = МетаИзм.Имя;
			Строка.ТипЗначения = МетаИзм.Тип;
			Строка.Заголовок   = МетаИзм.Представление();
		КонецЦикла;
	КонецЕсли;
	
	// Перерасчет
	Если Метаданные.РегистрыРасчета.Содержит(Мета.Родитель()) Тогда
		Строка = Измерения.Добавить();
		Строка.Имя         = "ОбъектПерерасчета";
		Строка.ТипЗначения = Документы.ТипВсеСсылки();
		Строка.Заголовок   = "Объект перерасчета";
	КонецЕсли;
	
	Возврат Измерения;
КонецФункции

// Модифицирует таблицу формы, добавляя туда колонки
//
// Параметры:
//    - ТаблицаФормы   - Элемент, связанный с данными, в который будут добавлены колонки данных
//    - СохранятьИмена - Список имен колонок, которые будут сохранены, через запятую.
//    - Добавлять      - Коллекция добавляемых колонок  или перечислимое с атрибутами Имя, ТипЗначения, Заголовок
//    - ГруппаКолонок  - Группа колонок, в которую происходит добавление
//
Процедура ДобавитьКолонкиВТаблицуФормы(ТаблицаФормы, СохранятьИмена, Добавлять, ГруппаКолонок=Неопределено) Экспорт
	
	Форма = ФормаЭлементаФормы(ТаблицаФормы);
	ЭлементыФормы = Форма.Элементы;
	ИмяРеквизитаТаблицы = ТаблицаФормы.ПутьКДанным;
	
	Сохраняемые = Новый Структура(СохранятьИмена);
	СохраняемыеПутиДанных = Новый Соответствие;
	Для Каждого Элемент Из Сохраняемые Цикл
		СохраняемыеПутиДанных.Вставить(ИмяРеквизитаТаблицы + "." + Элемент.Ключ, Истина);
	КонецЦикла;
	
	ЭтоДинамическийСписок = Ложь;
	Для Каждого Реквизит Из Форма.ПолучитьРеквизиты() Цикл
		Если Реквизит.Имя = ИмяРеквизитаТаблицы И Реквизит.ТипЗначения.СодержитТип(Тип("ДинамическийСписок")) Тогда
			ЭтоДинамическийСписок = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;

	// Динамический пересоздает реквизиты сам
	Если Не ЭтоДинамическийСписок Тогда
		УдаляемыеИмена = Новый Массив;
		
		// Удаляем все реквизиты, которые не перечислены в СохранятьИмена
		Для Каждого Реквизит Из Форма.ПолучитьРеквизиты(ИмяРеквизитаТаблицы) Цикл
			ТекИмя = Реквизит.Имя;
			Если Не Сохраняемые.Свойство(ТекИмя) Тогда
				УдаляемыеИмена.Добавить(Реквизит.Путь + "." + ТекИмя);
			КонецЕсли;
		КонецЦикла;
		
		Добавляемые = Новый Массив;
		Для Каждого Колонка Из Добавлять Цикл
			ТекИмя = Колонка.Имя;
			Если Не Сохраняемые.Свойство(ТекИмя) Тогда
				Добавляемые.Добавить( Новый РеквизитФормы(ТекИмя, Колонка.ТипЗначения, ИмяРеквизитаТаблицы, Колонка.Заголовок) );
			КонецЕсли;
		КонецЦикла;
		
		Форма.ИзменитьРеквизиты(Добавляемые, УдаляемыеИмена);
	КонецЕсли;
	
	// Удаляем элементы
	Родитель = ?(ГруппаКолонок=Неопределено, ТаблицаФормы, ГруппаКолонок);
	
	Удалять = Новый Массив;
	Для Каждого Элемент Из Родитель.ПодчиненныеЭлементы Цикл
		Удалять.Добавить(Элемент);
	КонецЦикла;
	Для Каждого Элемент Из Удалять Цикл
		Если ТипЗнч(Элемент)<>Тип("ГруппаФормы") И СохраняемыеПутиДанных[Элемент.ПутьКДанным]=Неопределено Тогда
			ЭлементыФормы.Удалить(Элемент);
		КонецЕсли;
	КонецЦикла;
	
	// Создаем элементы
	Префикс = ТаблицаФормы.Имя;
	Для Каждого Колонка Из Добавлять Цикл
		ТекИмя = Колонка.Имя;
		ЭлФормы = ЭлементыФормы.Вставить(Префикс + ТекИмя, Тип("ПолеФормы"), Родитель);
		ЭлФормы.Вид = ВидПоляФормы.ПолеВвода;
		ЭлФормы.ПутьКДанным = ИмяРеквизитаТаблицы + "." + ТекИмя;
		ЭлФормы.Заголовок = Колонка.Заголовок;
	КонецЦикла;
	
КонецПроцедуры	

// Возвращает подробное представление объекта.
//
// Параметры:
//    - ОбъектПредставления - Объект, представление которого получаем
//
Функция ПредставлениеСсылки(ОбъектПредставления) Экспорт
	
	Если ТипЗнч(ОбъектПредставления)=Тип("Строка") Тогда
		// Метаданные 
		Мета = Метаданные.НайтиПоПолномуИмени(ОбъектПредставления);
		Результат = Мета.Представление();
		Если Метаданные.Константы.Содержит(Мета) Тогда
			Результат = Результат + " (константа)";
		КонецЕсли;
		Возврат Результат;
	КонецЕсли;
	
	// Ссылка
	Результат = "";
	Если Метаданные.ОбщиеМодули.Найти("ОбщегоНазначения")<>Неопределено Тогда
		Попытка
			Результат = Вычислить("ОбщегоНазначения.ПредметСтрокой(ОбъектПредставления)");
		Исключение
		КонецПопытки;
	КонецЕсли;
	
	Если ПустаяСтрока(Результат) И ОбъектПредставления<>Неопределено И Не ОбъектПредставления.Пустая() Тогда
		Мета = ОбъектПредставления.Метаданные();
		Если Метаданные.Документы.Содержит(Мета) Тогда
			Результат = Строка(ОбъектПредставления);
		Иначе
			Представление = Мета.ПредставлениеОбъекта;
			Если ПустаяСтрока(Представление) Тогда
				Представление = Мета.Представление();
			КонецЕсли;
			Результат = Строка(ОбъектПредставления);
			Если Не ПустаяСтрока(Представление) Тогда
				Результат = Результат + " (" + Представление + ")";
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если ПустаяСтрока(Результат) Тогда
		Результат = НСтр("ru = 'не задано'");
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

// Возвращает флаг того, что работа происходит в файловой базе
//
Функция ЭтоФайловаяБаза() Экспорт
	Возврат ИнформационнаяБазаФайловая(СтрокаСоединенияИнформационнойБазы());
КонецФункции

// Функция ИнформационнаяБазаФайловая определяет режим эксплуатации
// информационной базы файловый (Истина) или Серверный (Ложь).
//  При проверке используется СтрокаСоединенияИнформационнойБазы, которую
// можно указать явно.
//
// Параметры:
//  СтрокаСоединенияИнформационнойБазы - Строка - параметр используется, если
//                 нужно проверить строку соединения не текущей информационной базы.
//
// Возвращаемое значение:
//  Булево.
//
Функция ИнформационнаяБазаФайловая(Знач СтрокаСоединенияИнформационнойБазы = "") Экспорт
			
	Если ПустаяСтрока(СтрокаСоединенияИнформационнойБазы) Тогда
		СтрокаСоединенияИнформационнойБазы =  СтрокаСоединенияИнформационнойБазы();
	КонецЕсли;
	Возврат Найти(Врег(СтрокаСоединенияИнформационнойБазы), "FILE=") = 1;
	
КонецФункции 

// Возвращает Истина, если клиентское приложение подключено к базе через веб-сервер.
//
Функция КлиентПодключенЧерезВебСервер() Экспорт
	
	Возврат Найти(Врег(СтрокаСоединенияИнформационнойБазы()), "WS=") = 1;
	
КонецФункции

//  Читает текущие данные из динамического списка по его настройкам и возвращает в виде таблицы значений
//
// Параметры:
//    - ИсточникДанных - ДинамическийСписок, реквизит формы
//
Функция ТекущиеДанныеДинамическогоСписка(ИсточникДанных) Экспорт
	
	СхемаКомпоновки = Новый СхемаКомпоновкиДанных;
	
	Источник = СхемаКомпоновки.ИсточникиДанных.Добавить();
	Источник.Имя = "Источник";
	Источник.ТипИсточникаДанных = "local";
	
	Набор = СхемаКомпоновки.НаборыДанных.Добавить(Тип("НаборДанныхЗапросСхемыКомпоновкиДанных"));
	Набор.Запрос = ИсточникДанных.ТекстЗапроса;
	Набор.АвтоЗаполнениеДоступныхПолей = Истина;
	Набор.ИсточникДанных = Источник.Имя;
	Набор.Имя = Источник.Имя;
	
	ИсточникНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновки);
	Компоновщик = Новый КомпоновщикНастроекКомпоновкиДанных;
	Компоновщик.Инициализировать(ИсточникНастроек);
	
	ТекНастройки = Компоновщик.Настройки;
	
	// Выбранные поля
	Для Каждого Элемент из ТекНастройки.Выбор.ДоступныеПоляВыбора.Элементы Цикл
		Если Не Элемент.Папка Тогда
			Поле = ТекНастройки.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
			Поле.Использование = Истина;
			Поле.Поле = Элемент.Поле;
		КонецЕсли;
	КонецЦикла;
	Группа = ТекНастройки.Структура.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
	Группа.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));

	// Отбор
	СкопироватьОтборКомпоновкиДанных(ТекНастройки.Отбор, ИсточникДанных.Отбор);

	// Выводим
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	Макет = КомпоновщикМакета.Выполнить(СхемаКомпоновки, ТекНастройки, , , Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	Процессор = Новый ПроцессорКомпоновкиДанных;
	Процессор.Инициализировать(Макет);
	Вывод  = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	
	Результат = Новый ТаблицаЗначений;
	Вывод.УстановитьОбъект(Результат); 
	Вывод.Вывести(Процессор);
	
	Возврат Результат;
КонецФункции

// Читаем настройки из общего хранилища
//
Процедура ПрочитатьНастройки(КлючНастройки="") Экспорт
	
	КлючОбъекта = Метаданные().ПолноеИмя() + ".Форма.РегистрацияИзменений";
	
	ТекущиеНастройки = ХранилищеОбщихНастроек.Загрузить(КлючОбъекта);
	Если ТипЗнч(ТекущиеНастройки)<>Тип("Соответствие") Тогда
		// Умолчания
		ТекущиеНастройки = Новый Соответствие;
		ТекущиеНастройки.Вставить("НастройкаАвторегистрацияДвижений",            Ложь);
		ТекущиеНастройки.Вставить("НастройкаАвторегистрацияПоследовательностей", Ложь);
		ТекущиеНастройки.Вставить("НастройкаАдресВнешнейОбработкиЗапросов",      "");
		ТекущиеНастройки.Вставить("НастройкаКонтрольВыгрузкиОбъектов",           Истина); // Проверять через БСП
		ТекущиеНастройки.Вставить("НастройкаВариантНомераСообщения",              0);     // Регистрировать как новое
	КонецЕсли;
	
	НастройкаАвторегистрацияДвижений            = ТекущиеНастройки["НастройкаАвторегистрацияДвижений"];
	НастройкаАвторегистрацияПоследовательностей = ТекущиеНастройки["НастройкаАвторегистрацияПоследовательностей"];
	НастройкаАдресВнешнейОбработкиЗапросов      = ТекущиеНастройки["НастройкаАдресВнешнейОбработкиЗапросов"];
	НастройкаКонтрольВыгрузкиОбъектов           = ТекущиеНастройки["НастройкаКонтрольВыгрузкиОбъектов"];
	НастройкаВариантНомераСообщения             = ТекущиеНастройки["НастройкаВариантНомераСообщения"];

	КонфигурацияПоддерживаетБСП = БСП_ДоступнаТребуемаяВерсия();
	
	ПроверитьКорректностьНастроек(КлючНастройки);
КонецПроцедуры	

// Пишем настройки в общее хранилище
//
Процедура СохранитьНастройки(КлючНастройки="") Экспорт
	
	КлючОбъекта = Метаданные().ПолноеИмя() + ".Форма.РегистрацияИзменений";
	
	ТекущиеНастройки = Новый Соответствие;
	ТекущиеНастройки.Вставить("НастройкаАвторегистрацияДвижений",            НастройкаАвторегистрацияДвижений);
	ТекущиеНастройки.Вставить("НастройкаАвторегистрацияПоследовательностей", НастройкаАвторегистрацияПоследовательностей);
	ТекущиеНастройки.Вставить("НастройкаАдресВнешнейОбработкиЗапросов",      НастройкаАдресВнешнейОбработкиЗапросов);
	ТекущиеНастройки.Вставить("НастройкаКонтрольВыгрузкиОбъектов",           НастройкаКонтрольВыгрузкиОбъектов);
	ТекущиеНастройки.Вставить("НастройкаВариантНомераСообщения",             НастройкаВариантНомераСообщения);
	
	ХранилищеОбщихНастроек.Сохранить(КлючОбъекта, "", ТекущиеНастройки)
КонецПроцедуры	

// Проверяем настройки на корректность, сбрасываем в случае нарушения.
//    Возвращает структуру с ключом - именем настройки, значением содержит описанием ошибки или Неопределено
// при отсутствии ошибки для данного параметра
//
Функция ПроверитьКорректностьНастроек(КлючНастройки="") Экспорт
	
	Результат = Новый Структура("ЕстьОшибки,
		|НастройкаАвторегистрацияДвижений, НастройкаАвторегистрацияПоследовательностей, 
		|НастройкаАдресВнешнейОбработкиЗапросов, НастройкаКонтрольВыгрузкиОбъектов,
		|НастройкаВариантНомераСообщения",
		Ложь);
		
	// 1. НастройкаКонтрольВыгрузкиОбъектов возможно только если работам в нужной БСП
	Если НЕ	КонфигурацияПоддерживаетБСП Тогда
		НастройкаКонтрольВыгрузкиОбъектов = Ложь;
		Результат.НастройкаКонтрольВыгрузкиОбъектов = НСтр("ru='Текущая конфигурация не поддерживает БСП версии 2.1.2 или старше.'");
			
		Результат.ЕстьОшибки = Истина;
	КонецЕсли;
	
	// 2. Доступность внешней обработки
	Если ПустаяСтрока(НастройкаАдресВнешнейОбработкиЗапросов) Тогда
		// Убираем возможные пробелы, вариант отключен
		НастройкаАдресВнешнейОбработкиЗапросов = "";
		
	ИначеЕсли НРег(Прав(СокрЛП(НастройкаАдресВнешнейОбработкиЗапросов), 4))=".epf" Тогда
		// Файл обработки
		Файл = Новый Файл(НастройкаАдресВнешнейОбработкиЗапросов);
		Если Не Файл.Существует() Тогда
			Текст = НСтр("ru='Файл ""%1"" не доступен %2'");
				
			Текст = СтрЗаменить(Текст, "%1", НастройкаАдресВнешнейОбработкиЗапросов);
			Если ЭтоФайловаяБаза() Тогда
				РасположениеФайла = "";
			Иначе
				РасположениеФайла = НСтр("ru='на сервере'");
			КонецЕсли;
				
			Текст = СтрЗаменить(Текст, "%2", РасположениеФайла);
			Результат.НастройкаАдресВнешнейОбработкиЗапросов = Текст;
			
			Результат.ЕстьОшибки = Истина;
		КонецЕсли;
		
	Иначе
		// В составе конфигурации
		Если Метаданные.Обработки.Найти(НастройкаАдресВнешнейОбработкиЗапросов)=Неопределено Тогда
			Текст = НСтр("ru='Обработка ""%1"" не найдена в составе конфигурации'");
			Результат.НастройкаАдресВнешнейОбработкиЗапросов = СтрЗаменить(Текст, "%1", НастройкаАдресВнешнейОбработкиЗапросов);
			
			Результат.ЕстьОшибки = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

////////////////////////////////////////////////////////////////////////////////////////////////////
// РЕГИСТРАЦИЯ ИЗМЕНЕНИЙ В ПЛАНАХ ОБМЕНА. СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ
//

//
// Копирует отбор компоновки данных
//
Процедура СкопироватьОтборКомпоновкиДанных(ГруппаПриемник, ГруппаИсточник) 
	
	КоллекцияИсточник = ГруппаИсточник.Элементы;
	КоллекцияПриемник = ГруппаПриемник.Элементы;
	Для Каждого Элемент Из КоллекцияИсточник Цикл
		ТипЭлемента  = ТипЗнч(Элемент);
		НовыйЭлемент = КоллекцияПриемник.Добавить(ТипЭлемента);
		
		ЗаполнитьЗначенияСвойств(НовыйЭлемент, Элемент);
		Если ТипЭлемента=Тип("ГруппаЭлементовОтбораКомпоновкиДанных") Тогда
			СкопироватьОтборКомпоновкиДанных(НовыйЭлемент, Элемент) 
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Выполняет непосредственное действие с конечным объектом
//
Процедура ВыполнитьКомандуРегистрацииОбъекта(Команда, Узел, ОбъектРегистрации)
	
	Если ТипЗнч(Команда)=Тип("Булево") Тогда
		Если Команда Тогда
			// Регистрация
			Если НастройкаВариантНомераСообщения=1 Тогда
				// Как отправленного
				Команда = 1 + Узел.НомерОтправленного;
			Иначе
				// Как нового
				ПланыОбмена.ЗарегистрироватьИзменения(Узел, ОбъектРегистрации);	
			КонецЕсли;
		Иначе
			// Отмена регистрации
			ПланыОбмена.УдалитьРегистрациюИзменений(Узел, ОбъектРегистрации);
		КонецЕсли;
	КонецЕсли;
	
	Если ТипЗнч(Команда)=Тип("Число") Тогда
		// Одиночная регистрация с указанным номером сообщения
		Если Команда = 0 Тогда
			// Аналогично регистрации нового
			ПланыОбмена.ЗарегистрироватьИзменения(Узел, ОбъектРегистрации);
			ИзменениеЗарегистрировано = ПланыОбмена.ИзменениеЗарегистрировано(Узел, ОбъектРегистрации);
			Если НЕ ИзменениеЗарегистрировано Тогда
				Сообщить("Регистрация изменений на узле <" + Узел + "> объекта <" + ОбъектРегистрации + "> не произведена.");
			КонецЕсли;
		Иначе
			// Изменение номера регистрации, БСП не проверяем
			ПланыОбмена.ЗарегистрироватьИзменения(Узел, ОбъектРегистрации);
			ИзменениеЗарегистрировано = ПланыОбмена.ИзменениеЗарегистрировано(Узел, ОбъектРегистрации);
			Если НЕ ИзменениеЗарегистрировано Тогда
				Сообщить("Регистрация изменений на узле <" + Узел + "> объекта <" + ОбъектРегистрации + "> не произведена.");
			КонецЕсли;
			Если Найти(ТипЗнч(ОбъектРегистрации), "Константа менеджер значения") = 0 Тогда
				Выборка = ПланыОбмена.ВыбратьИзменения(Узел, Команда, ОбъектРегистрации);
			Иначе
				Выборка = ПланыОбмена.ВыбратьИзменения(Узел, Команда, ОбъектРегистрации.Метаданные());
			КонецЕсли;
			Пока Выборка.Следующий() Цикл
				// Выбираем изменения для простановки номера сообщения обмена данными
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Возвращает управляемую форму, которой принадлежит элемент
//
Функция ФормаЭлементаФормы(ЭлементФормы)
	Результат = ЭлементФормы;
	ТипыФормы = Новый ОписаниеТипов("УправляемаяФорма");
	Пока Не ТипыФормы.СодержитТип(ТипЗнч(Результат)) Цикл
		Результат = Результат.Родитель;
	КонецЦикла;
	Возврат Результат;
КонецФункции	

// Внутренняя для формирования группы метаданных (например справочников) в дереве метаданных
//
Процедура СформироватьУровеньМетаданных(ТекущийНомерСтроки, Параметры, ИндексКартинки, ИндексКартинкиУзлов, ДобавлятьПодчиненные, ИмяМета, ПредставлениеМета)
	
	ПредставленияУровня = Новый Массив;
	Авторегистрации     = Новый Массив;
	ИменаУровня         = Новый Массив;
	
	ВсеСтроки = Параметры.Строки;
	МетаПлан  = Параметры.ПланОбмена;
	
	СтрокаГруппа = ВсеСтроки.Добавить();
	СтрокаГруппа.ИдентификаторСтроки = ТекущийНомерСтроки;
	
	СтрокаГруппа.МетаПолноеИмя  = ИмяМета;
	СтрокаГруппа.Наименование   = ПредставлениеМета;
	СтрокаГруппа.ИндексКартинки = ИндексКартинки;
	
	Строки = СтрокаГруппа.Строки;
	БылиПодчиненные = Ложь;
	
	Для Каждого Мета Из Метаданные[ИмяМета] Цикл
		
		Если МетаПлан=Неопределено Тогда
			// Без учета плана обмена
			БылиПодчиненные = Истина;
			МетаПолноеИмя   = Мета.ПолноеИмя();
			Наименование    = Мета.Представление();
			Если ДобавлятьПодчиненные Тогда
				НовСтрока = Строки.Добавить();
				НовСтрока.МетаПолноеИмя  = МетаПолноеИмя;
				НовСтрока.Наименование   = Наименование ;
				НовСтрока.ИндексКартинки = ИндексКартинкиУзлов;
				
				ТекущийНомерСтроки = ТекущийНомерСтроки + 1;
				НовСтрока.ИдентификаторСтроки = ТекущийНомерСтроки;
			КонецЕсли;	
			ИменаУровня.Добавить(МетаПолноеИмя);
			ПредставленияУровня.Добавить(Наименование);
			
		Иначе
			Элемент = МетаПлан.Состав.Найти(Мета);
			Если Элемент<>Неопределено Тогда
				БылиПодчиненные = Истина;
				МетаПолноеИмя   = Мета.ПолноеИмя();
				Наименование    = Мета.Представление();
				Авторегистрация = ?(Элемент.Авторегистрация=АвтоРегистрацияИзменений.Запретить, 1, 2);
				Если ДобавлятьПодчиненные Тогда
					НовСтрока = Строки.Добавить();
					НовСтрока.МетаПолноеИмя   = МетаПолноеИмя;
					НовСтрока.Наименование    = Наименование ;
					НовСтрока.ИндексКартинки  = ИндексКартинкиУзлов;
					НовСтрока.Авторегистрация = Авторегистрация;
					
					ТекущийНомерСтроки = ТекущийНомерСтроки + 1;
					НовСтрока.ИдентификаторСтроки = ТекущийНомерСтроки;
				КонецЕсли;	
				ИменаУровня.Добавить(МетаПолноеИмя);
				ПредставленияУровня.Добавить(Наименование);
				Авторегистрации.Добавить(Авторегистрация);
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	Если БылиПодчиненные Тогда
		Строки.Сортировать("Наименование");
		Параметры.СтруктураИмен.Вставить(ИмяМета, ИменаУровня);
		Параметры.СтруктураПредставлений.Вставить(ИмяМета, ПредставленияУровня);
		Если Не ДобавлятьПодчиненные Тогда
			Параметры.СтруктураАвторегистрации.Вставить(ИмяМета, Авторегистрации);
		КонецЕсли;
	Иначе
		// Виды объектов без регистрации не вставляем
		ВсеСтроки.Удалить(СтрокаГруппа);
	КонецЕсли;
	
КонецПроцедуры

// Накапливаем результаты регистраций
//
Процедура ДобавитьРезультаты(Приемник, Источник)
	Приемник.Успешно = Приемник.Успешно + Источник.Успешно;
	Приемник.Всего   = Приемник.Всего   + Источник.Всего;
КонецПроцедуры	

// Возвращает массив дополнительно регистрируемых объектов согласно флагам
//
Функция ПолучитьДополнительныеОбъектыРегистрации(ОбъектРегистрации, УзелКонтроляАвторегистрации, БезАвторегистрации, ИмяТаблицы=Неопределено)
	Результат = Новый Массив;
	
	// Смотрим на глобальные параметры
	Если (Не НастройкаАвторегистрацияДвижений) И (Не НастройкаАвторегистрацияПоследовательностей) Тогда
		Возврат Результат;
	КонецЕсли;
	
	ТипЗначения = ТипЗнч(ОбъектРегистрации);
	НаВходеИмя = ТипЗначения=Тип("Строка");
	Если НаВходеИмя Тогда
		Описание = ХарактеристикиПоМетаданным(ОбъектРегистрации);
	ИначеЕсли ТипЗначения=Тип("Структура") Тогда
		Описание = ХарактеристикиПоМетаданным(ИмяТаблицы);
		Если Описание.ЭтоПоследовательность Тогда
			Возврат Результат;
		КонецЕсли;
	Иначе
		Описание = ХарактеристикиПоМетаданным(ОбъектРегистрации.Метаданные());
	КонецЕсли;
	
	МетаОбъект = Описание.Метаданные;
	
	// Коллекцию рекурсивно	
	Если Описание.ЭтоКоллекция Тогда
		Для Каждого Мета Из МетаОбъект Цикл
			ДополнительныйНабор = ПолучитьДополнительныеОбъектыРегистрации(Мета.ПолноеИмя(), УзелКонтроляАвторегистрации, БезАвторегистрации, ИмяТаблицы);
			Для Каждого Элемент Из ДополнительныйНабор Цикл
				Результат.Добавить(Элемент);
			КонецЦикла;
		КонецЦикла;
		Возврат Результат;
	КонецЕсли;
	
	// Одиночное
	СоставУзла = УзелКонтроляАвторегистрации.Метаданные().Состав;
	
	// Документы. Могут влиять на последовательности и движения
	Если Метаданные.Документы.Содержит(МетаОбъект) Тогда
		
		Если НастройкаАвторегистрацияДвижений Тогда
			Для Каждого Мета Из МетаОбъект.Движения Цикл
				
				ЭлементСостава = СоставУзла.Найти(Мета);
				Если ЭлементСостава<>Неопределено И (БезАвторегистрации Или ЭлементСостава.Авторегистрация=АвтоРегистрацияИзменений.Разрешить) Тогда
					Если НаВходеИмя Тогда
						Результат.Добавить(Мета);
					Иначе
						Описание = ХарактеристикиПоМетаданным(Мета);
						Набор = Описание.Менеджер.СоздатьНаборЗаписей();
						Набор.Отбор.Регистратор.Установить(ОбъектРегистрации);
						Набор.Прочитать();
						Результат.Добавить(Набор);
						// И проверим полученный набор рекурсивно
						ДополнительныйНабор = ПолучитьДополнительныеОбъектыРегистрации(Набор, УзелКонтроляАвторегистрации, БезАвторегистрации, ИмяТаблицы);
						Для Каждого Элемент Из ДополнительныйНабор Цикл
							Результат.Добавить(Элемент);
						КонецЦикла;
					КонецЕсли;
				КонецЕсли;
				
			КонецЦикла;
		КонецЕсли;
		
		Если НастройкаАвторегистрацияПоследовательностей Тогда
			Для Каждого Мета Из Метаданные.Последовательности Цикл
				
				Описание = ХарактеристикиПоМетаданным(Мета);
				Если Мета.Документы.Содержит(МетаОбъект) Тогда
					// Последовательность регистрируется для данного документа
					ЭлементСостава = СоставУзла.Найти(Мета);
					Если ЭлементСостава<>Неопределено И (БезАвторегистрации Или ЭлементСостава.Авторегистрация=АвтоРегистрацияИзменений.Разрешить) Тогда
						// Регистрируется на этом узле
						Если НаВходеИмя Тогда
							Результат.Добавить(Мета);
						Иначе
							Набор = Описание.Менеджер.СоздатьНаборЗаписей();
							Набор.Отбор.Регистратор.Установить(ОбъектРегистрации);
							Набор.Прочитать();
							Результат.Добавить(Набор);
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
	// Записи регистров. Могут влиять на последовательности
	ИначеЕсли НастройкаАвторегистрацияПоследовательностей И (
		Метаданные.РегистрыСведений.Содержит(МетаОбъект)
		Или Метаданные.РегистрыНакопления.Содержит(МетаОбъект)
		Или Метаданные.РегистрыБухгалтерии.Содержит(МетаОбъект)
		Или Метаданные.РегистрыРасчета.Содержит(МетаОбъект)
	) Тогда
		Для Каждого Мета Из Метаданные.Последовательности Цикл
			Если Мета.Движения.Содержит(МетаОбъект) Тогда
				// Последовательность регистрируется для набора записей
				ЭлементСостава = СоставУзла.Найти(Мета);
				Если ЭлементСостава<>Неопределено И (БезАвторегистрации Или ЭлементСостава.Авторегистрация=АвтоРегистрацияИзменений.Разрешить) Тогда
					Результат.Добавить(Мета);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

// Возвращает флаг контроля объекта в БСП
//
Функция БСП_КонтрольВыгрузкиОбъекта(Узлы, ОбъектРегистрации)
	Отправка = ОтправкаЭлементаДанных.Авто;
	Выполнить("ОбменДаннымиСобытия.ПриОтправкеДанныхКорреспонденту(ОбъектРегистрации, Отправка, , Узлы)");
	Возврат Отправка<>ОтправкаЭлементаДанных.Удалить;
КонецФункции

// Проверяет ссылку на возможность регистрации изменения в БСП.
// Возвращает структуру с полями "Всего" и "Успешно", описывающей количества регистраций
//
Функция БСП_РегистрацияИзмененийСсылки(Узел, Ссылка, БезУчетаАвторегистрации=Истина)
	
	Результат = Новый Структура("Всего, Успешно", 0, 0);
	
	Если БезУчетаАвторегистрации Тогда
		СоставУзла = Неопределено;
	Иначе
		СоставУзла = Узел.Метаданные().Состав;
	КонецЕсли;
	
	ЭлементСостава = ?(СоставУзла=Неопределено, Неопределено, СоставУзла.Найти(Ссылка.Метаданные()));
	Если ЭлементСостава=Неопределено Или ЭлементСостава.Авторегистрация=АвтоРегистрацияИзменений.Разрешить Тогда
		// Сам объект
		Результат.Всего = 1;
		ОбъектРегистрации = Ссылка.ПолучитьОбъект();
		// Для битых ссылок ОбъектРегистрации будет Неопределено
		Если ОбъектРегистрации=Неопределено Или БСП_КонтрольВыгрузкиОбъекта(Узел, ОбъектРегистрации) Тогда
			ВыполнитьКомандуРегистрацииОбъекта(Истина, Узел, Ссылка);
			Результат.Успешно = 1;
		КонецЕсли;
		ОбъектРегистрации = Неопределено;
	КонецЕсли;	
	
	// Смотрим опциональные варианты
	Если Результат.Успешно>0 Тогда
		Для Каждого Элемент Из ПолучитьДополнительныеОбъектыРегистрации(Ссылка, Узел, БезУчетаАвторегистрации) Цикл
			Результат.Всего = Результат.Всего + 1;
			Если БСП_КонтрольВыгрузкиОбъекта(Узел, Элемент) Тогда
				ВыполнитьКомандуРегистрацииОбъекта(Истина, Узел, Элемент);
				Результат.Успешно = Результат.Успешно + 1;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

// Проверяет набор значений на возможность регистрации изменения в БСП.
// Возвращает структуру с полями "Всего" и "Успешно", описывающей количества регистраций
//
Функция БСП_РегистрацияИзмененийНабора(Узел, СтруктураПолей, Описание, БезУчетаАвторегистрации=Истина)
	
	Результат = Новый Структура("Всего, Успешно", 0, 0);
	
	Если БезУчетаАвторегистрации Тогда
		СоставУзла = Неопределено;
	Иначе
		СоставУзла = Узел.Метаданные().Состав;
	КонецЕсли;
	
	ЭлементСостава = ?(СоставУзла=Неопределено, Неопределено, СоставУзла.Найти(Описание.Метаданные));
	Если ЭлементСостава=Неопределено Или ЭлементСостава.Авторегистрация=АвтоРегистрацияИзменений.Разрешить Тогда
		Результат.Всего = 1;
		
		Набор = Описание.Менеджер.СоздатьНаборЗаписей();
		Для Каждого КлючЗначение Из СтруктураПолей Цикл
			Набор.Отбор[КлючЗначение.Ключ].Установить(КлючЗначение.Значение);
		КонецЦикла;
		Набор.Прочитать();
		
		Если БСП_КонтрольВыгрузкиОбъекта(Узел, Набор) Тогда
			ВыполнитьКомандуРегистрацииОбъекта(Истина, Узел, Набор);
			Результат.Успешно = 1;
		КонецЕсли;
		
	КонецЕсли;
	
	// Смотрим опциональные варианты
	Если Результат.Успешно>0 Тогда
		Для Каждого Элемент Из ПолучитьДополнительныеОбъектыРегистрации(Набор, Узел, БезУчетаАвторегистрации) Цикл
			Результат.Всего = Результат.Всего + 1;
			Если БСП_КонтрольВыгрузкиОбъекта(Узел, Элемент) Тогда
				ВыполнитьКомандуРегистрацииОбъекта(Истина, Узел, Элемент);
				Результат.Успешно = Результат.Успешно + 1;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

// Проверяет константу на возможность регистрации изменения в БСП.
// Возвращает структуру с полями "Всего" и "Успешно", описывающей количества регистраций
//
Функция БСП_РегистрацияИзмененийКонстанты(Узел, Описание, БезУчетаАвторегистрации=Истина)
	
	Результат = Новый Структура("Всего, Успешно", 0, 0);
	
	Если БезУчетаАвторегистрации Тогда
		СоставУзла = Неопределено;
	Иначе
		СоставУзла = Узел.Метаданные().Состав;
	КонецЕсли;
	
	ЭлементСостава = ?(СоставУзла=Неопределено, Неопределено, СоставУзла.Найти(Описание.Метаданные));
	Если ЭлементСостава=Неопределено Или ЭлементСостава.Авторегистрация=АвтоРегистрацияИзменений.Разрешить Тогда
		Результат.Всего = 1;
		ОбъектРегистрации = Описание.Менеджер.СоздатьМенеджерЗначения();
		Если БСП_КонтрольВыгрузкиОбъекта(Узел, ОбъектРегистрации) Тогда
			ВыполнитьКомандуРегистрацииОбъекта(Истина, Узел, ОбъектРегистрации);
			Результат.Успешно = 1;
		КонецЕсли;
		
	КонецЕсли;	
	
	Возврат Результат;
КонецФункции

// Проверяет набор метаданных на возможность регистрации изменения в БСП.
// Возвращает структуру с полями "Всего" и "Успешно", описывающей количества регистраций
//
Функция БСП_РегистрацияИзмененийМетаданных(Узел, Описание, БезУчетаАвторегистрации)
	
	Результат = Новый Структура("Всего, Успешно", 0, 0);
	
	Если Описание.ЭтоКоллекция Тогда
		Для Каждого МетаВид Из Описание.Метаданные Цикл
			ТекОписание = ХарактеристикиПоМетаданным(МетаВид);
			ДобавитьРезультаты(Результат, БСП_РегистрацияИзмененийМетаданных(Узел, ТекОписание, БезУчетаАвторегистрации) );
		КонецЦикла;
	Иначе;
		ДобавитьРезультаты(Результат, БСП_РегистрацияИзмененийОбъектаМетаданных(Узел, Описание, БезУчетаАвторегистрации) );
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

// Проверяет объект метаданных на возможность регистрации изменения в БСП.
// Возвращает структуру с полями "Всего" и "Успешно", описывающей количества регистраций
//
Функция БСП_РегистрацияИзмененийОбъектаМетаданных(Узел, Описание, БезУчетаАвторегистрации)
	
	Результат = Новый Структура("Всего, Успешно", 0, 0);
	
	ЭлементСостава = Узел.Метаданные().Состав.Найти(Описание.Метаданные);
	Если ЭлементСостава=Неопределено Тогда
		// Вообще не регистрируется
		Возврат Результат;
	КонецЕсли;
	
	Если (Не БезУчетаАвторегистрации) И ЭлементСостава.Авторегистрация<>АвтоРегистрацияИзменений.Разрешить Тогда
		// Отсечение по авторегистрации
		Возврат Результат;
	КонецЕсли;
	
	ТекИмяТаблицы = Описание.ИмяТаблицы;
	Если Описание.ЭтоКонстанта Тогда
		ДобавитьРезультаты(Результат, БСП_РегистрацияИзмененийКонстанты(Узел, Описание) );
		Возврат Результат;
		
	ИначеЕсли Описание.ЭтоСсылка Тогда
		ПоляИзмерений = "Ссылка";
		
	ИначеЕсли Описание.ЭтоНабор Тогда
		ПоляИзмерений = "";
		Для Каждого Строка Из ИзмеренияНабораЗаписей(ТекИмяТаблицы, Истина) Цикл
			ПоляИзмерений = ПоляИзмерений + "," + Строка.Имя
		КонецЦикла;
		ПоляИзмерений = Сред(ПоляИзмерений, 2);
		
	Иначе
		Возврат Результат;
	КонецЕсли;
	
	Запрос = Новый Запрос("
		|ВЫБРАТЬ РАЗЛИЧНЫЕ 
		|	" + ?(ПустаяСтрока(ПоляИзмерений), "*", ПоляИзмерений) + "
		|ИЗ 
		|	" + ТекИмяТаблицы + "
		|");
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Описание.ЭтоНабор Тогда
			Данные = Новый Структура(ПоляИзмерений);
			ЗаполнитьЗначенияСвойств(Данные, Выборка);
			ДобавитьРезультаты(Результат, БСП_РегистрацияИзмененийНабора(Узел, Данные, Описание) );
		ИначеЕсли Описание.ЭтоСсылка Тогда
			ДобавитьРезультаты(Результат, БСП_РегистрацияИзмененийСсылки(Узел, Выборка.Ссылка, БезУчетаАвторегистрации) );
		КонецЕсли;
	КонецЦикла;

	Возврат Результат;
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ДЕЙСТВИЯ С ТИПАМИ ОБЪЕКТОВ 1С.
//
// Возвращает менеджер объекта по полному имени объекта метаданных.
// Ограничение: не обрабатываются точки маршрутов бизнес-процессов.
//
// Параметры:
//  ПолноеИмя - Строка - полное имя объекта метаданных. Пример: "Справочник.Организации".
//
// Возвращаемое значение:
//  СправочникМенеджер, ДокументМенеджер.
// 

Функция МенеджерОбъектаПоПолномуИмени(ПолноеИмя) Экспорт
	Перем КлассОМ, ИмяОМ, Менеджер;
	
	ЧастиИмени = РазложитьСтрокуВМассивПодстрок(ПолноеИмя, ".");
	
	Если ЧастиИмени.Количество() >= 2 Тогда
		КлассОМ = ЧастиИмени[0];
		ИмяОМ  = ЧастиИмени[1];
	КонецЕсли;
	
	Если      ВРег(КлассОМ) = "ПЛАНОБМЕНА" Тогда
		Менеджер = ПланыОбмена;
		
	ИначеЕсли ВРег(КлассОМ) = "СПРАВОЧНИК" Тогда
		Менеджер = Справочники;
		
	ИначеЕсли ВРег(КлассОМ) = "ДОКУМЕНТ" Тогда
		Менеджер = Документы;
		
	ИначеЕсли ВРег(КлассОМ) = "ЖУРНАЛДОКУМЕНТОВ" Тогда
		Менеджер = ЖурналыДокументов;
		
	ИначеЕсли ВРег(КлассОМ) = "ПЕРЕЧИСЛЕНИЕ" Тогда
		Менеджер = Перечисления;
		
	ИначеЕсли ВРег(КлассОМ) = "ОТЧЕТ" Тогда
		Менеджер = Отчеты;
		
	ИначеЕсли ВРег(КлассОМ) = "ОБРАБОТКА" Тогда
		Менеджер = Обработки;
		
	ИначеЕсли ВРег(КлассОМ) = "ПЛАНВИДОВХАРАКТЕРИСТИК" Тогда
		Менеджер = ПланыВидовХарактеристик;
		
	ИначеЕсли ВРег(КлассОМ) = "ПЛАНСЧЕТОВ" Тогда
		Менеджер = ПланыСчетов;
		
	ИначеЕсли ВРег(КлассОМ) = "ПЛАНВИДОВРАСЧЕТА" Тогда
		Менеджер = ПланыВидовРасчета;
		
	ИначеЕсли ВРег(КлассОМ) = "РЕГИСТРСВЕДЕНИЙ" Тогда
		Менеджер = РегистрыСведений;
		
	ИначеЕсли ВРег(КлассОМ) = "РЕГИСТРНАКОПЛЕНИЯ" Тогда
		Менеджер = РегистрыНакопления;
		
	ИначеЕсли ВРег(КлассОМ) = "РЕГИСТРБУХГАЛТЕРИИ" Тогда
		Менеджер = РегистрыБухгалтерии;
		
	ИначеЕсли ВРег(КлассОМ) = "РЕГИСТРРАСЧЕТА" Тогда
		Если ЧастиИмени.Количество() = 2 Тогда
			// Регистр расчета
			Менеджер = РегистрыРасчета;
		Иначе
			КлассПодчиненногоОМ = ЧастиИмени[2];
			ИмяПодчиненногоОМ = ЧастиИмени[3];
			Если ВРег(КлассПодчиненногоОМ) = "ПЕРЕРАСЧЕТ" Тогда
				// Перерасчет
				Попытка
					Менеджер = РегистрыРасчета[ИмяОМ].Перерасчеты;
					ИмяОм = ИмяПодчиненногоОМ;
				Исключение
					Менеджер = Неопределено;
				КонецПопытки;
			КонецЕсли;
		КонецЕсли;
		
	ИначеЕсли ВРег(КлассОМ) = "БИЗНЕСПРОЦЕСС" Тогда
		Менеджер = БизнесПроцессы;
		
	ИначеЕсли ВРег(КлассОМ) = "ЗАДАЧА" Тогда
		Менеджер = Задачи;
		
	ИначеЕсли ВРег(КлассОМ) = "КОНСТАНТА" Тогда
		Менеджер = Константы;
		
	ИначеЕсли ВРег(КлассОМ) = "ПОСЛЕДОВАТЕЛЬНОСТЬ" Тогда
		Менеджер = Последовательности;
	КонецЕсли;
	
	Если Менеджер <> Неопределено Тогда
		Попытка
			Возврат Менеджер[ИмяОМ];
		Исключение
			Менеджер = Неопределено;
		КонецПопытки;
	КонецЕсли;
	
	ВызватьИсключение ПодставитьПараметрыВСтроку(НСтр("ru = 'Неизвестный тип объекта метаданных ""%1""'"), ПолноеИмя);
	
КонецФункции

// Создает и возвращает экземпляр объекта по полному имени объекта метаданных.
// Ограничение: поддерживаются только отчеты и обработки.
//
// Параметры:
//   ПолноеИмя - Строка - полное имя объекта метаданных. Пример: "Отчет.БизнесПроцессы".
//
// Возвращаемое значение:
//   ОтчетОбъект, ОбработкаОбъект.
// 
Функция ОбъектПоПолномуИмени(ПолноеИмя) Экспорт
	
	МассивСтрок = РазложитьСтрокуВМассивПодстрок(ПолноеИмя, ".");
	
	Если МассивСтрок.Количество() >= 2 Тогда
		Вид = ВРег(МассивСтрок[0]);
		Имя = МассивСтрок[1];
	Иначе
		ВызватьИсключение СтрЗаменить(НСтр("ru = 'Некорректное полное имя отчета или обработки ""%1"".'"), "%1", ПолноеИмя);
	КонецЕсли;
	
	Если Вид = "ОТЧЕТ" Тогда
		Возврат Отчеты[Имя].Создать();
	ИначеЕсли Вид = "ОБРАБОТКА" Тогда
		Возврат Обработки[Имя].Создать();
	ИначеЕсли Вид = "ВНЕШНИЙОТЧЕТ" Тогда
		Возврат ВнешниеОтчеты.Создать(Имя);
	ИначеЕсли Вид = "ВНЕШНЯЯОБРАБОТКА" Тогда
		Возврат ВнешниеОбработки.Создать(Имя);
	Иначе
		ВызватьИсключение СтрЗаменить(НСтр("ru = '""%1"" не является отчетом или обработкой.'"), "%1", ПолноеИмя);
	КонецЕсли;
КонецФункции

// Возвращает объект ОписаниеТипов, содержащий Тип Значения.
//
// Параметры:
//  ЗначениеТипа - строка с именем типа или значение типа Тип.
//  
// Возвращаемое значение:
//  ОписаниеТипов
//
Функция вОписаниеТипа(ЗначениеТипа) Экспорт

	МассивТипов = Новый Массив;
	Если ТипЗнч(ЗначениеТипа) = Тип("Строка") Тогда
		МассивТипов.Добавить(Тип(ЗначениеТипа));
	Иначе
		МассивТипов.Добавить(ЗначениеТипа);
	КонецЕсли; 
	ОписаниеТипов	= Новый ОписаниеТипов(МассивТипов);

	Возврат ОписаниеТипов;

КонецФункции // вОписаниеТипа()

// Возвращает имя базового типа по переданному значению объекта метаданных
//
// Параметры:
//  ОбъектМетаданных - объект метаданных, по которому необходимо определить базовый тип
// 
// Возвращаемое значение:
//  Строка - имя базового типа по переданному значению объекта метаданных
//
Функция ИмяБазовогоТипаПоОбъектуМетаданных(ОбъектМетаданных) Экспорт
	
	Если ОбъектМетаданных = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если Метаданные.Справочники.Содержит(ОбъектМетаданных) Тогда
		Возврат ИмяТипаСправочники();
		
	ИначеЕсли Метаданные.Документы.Содержит(ОбъектМетаданных) Тогда
		Возврат ИмяТипаДокументы();
		
	ИначеЕсли Метаданные.ПланыВидовХарактеристик.Содержит(ОбъектМетаданных) Тогда
		Возврат ИмяТипаПланыВидовХарактеристик();
		
	ИначеЕсли Метаданные.ПланыОбмена.Содержит(ОбъектМетаданных) Тогда
		Возврат ИмяТипаПланыОбмена();
		
	ИначеЕсли Метаданные.БизнесПроцессы.Содержит(ОбъектМетаданных) Тогда
		Возврат ИмяТипаБизнесПроцессы();
		
	ИначеЕсли Метаданные.Задачи.Содержит(ОбъектМетаданных) Тогда
		Возврат ИмяТипаЗадачи();
		
	ИначеЕсли Метаданные.ПланыВидовРасчета.Содержит(ОбъектМетаданных) Тогда
		Возврат ИмяТипаПланыВидовРасчета();
		
	ИначеЕсли Метаданные.ПланыСчетов.Содержит(ОбъектМетаданных) Тогда
		Возврат ИмяТипаПланыСчетов();
		
	ИначеЕсли Метаданные.Константы.Содержит(ОбъектМетаданных) Тогда
		Возврат ИмяТипаКонстанты();
		
	ИначеЕсли Метаданные.Перечисления.Содержит(ОбъектМетаданных) Тогда
		Возврат ИмяТипаПеречисления();
		
	ИначеЕсли Метаданные.РегистрыСведений.Содержит(ОбъектМетаданных) Тогда
		Возврат ИмяТипаРегистрыСведений();
		
	ИначеЕсли Метаданные.РегистрыНакопления.Содержит(ОбъектМетаданных) Тогда
		Возврат ИмяТипаРегистрыНакопления();
		
	ИначеЕсли Метаданные.РегистрыБухгалтерии.Содержит(ОбъектМетаданных) Тогда
		Возврат ИмяТипаРегистрыБухгалтерии();
		
	ИначеЕсли Метаданные.РегистрыРасчета.Содержит(ОбъектМетаданных) Тогда
		Возврат ИмяТипаРегистрыРасчета();
		
	Иначе
		
		Возврат Неопределено;
		
	КонецЕсли;
	
КонецФункции

// Функция-свойство: возвращает значение для идентификации общего типа "Справочники"
//
// Тип: Строка
//
Функция ИмяТипаСправочники() Экспорт
	
	Возврат "Справочник";
	
КонецФункции

// Функция-свойство: возвращает значение для идентификации общего типа "Документы"
//
// Тип: Строка
//
Функция ИмяТипаДокументы() Экспорт
	
	Возврат "Документ";
	
КонецФункции

// Функция-свойство: возвращает значение для идентификации общего типа "ПланыОбмена"
//
// Тип: Строка
//
Функция ИмяТипаПланыОбмена() Экспорт
	
	Возврат "ПланОбмена";
	
КонецФункции

// Функция-свойство: возвращает значение для идентификации общего типа "Планы видов характеристик"
//
// Тип: Строка
//
Функция ИмяТипаПланыВидовХарактеристик() Экспорт
	
	Возврат "ПланВидовХарактеристик";
	
КонецФункции

// Функция-свойство: возвращает значение для идентификации общего типа "Бизнес процессы"
//
// Тип: Строка
//
Функция ИмяТипаБизнесПроцессы() Экспорт
	
	Возврат "БизнесПроцесс";
	
КонецФункции

// Функция-свойство: возвращает значение для идентификации общего типа "Задачи"
//
// Тип: Строка
//
Функция ИмяТипаЗадачи() Экспорт
	
	Возврат "Задача";
	
КонецФункции

// Функция-свойство: возвращает значение для идентификации общего типа "Планы видов расчета"
//
// Тип: Строка
//
Функция ИмяТипаПланыВидовРасчета() Экспорт
	
	Возврат "ПланВидовРасчета";
	
КонецФункции

// Функция-свойство: возвращает значение для идентификации общего типа "Планы счетов"
//
// Тип: Строка
//
Функция ИмяТипаПланыСчетов() Экспорт
	
	Возврат "ПланСчетов";
	
КонецФункции

// Функция-свойство: возвращает значение для идентификации общего типа "Константы"
//
// Тип: Строка
//
Функция ИмяТипаКонстанты() Экспорт
	
	Возврат "Константа";
	
КонецФункции

// Функция-свойство: возвращает значение для идентификации общего типа "Перечисление"
//
// Тип: Строка
//
Функция ИмяТипаПеречисления() Экспорт
	
	Возврат "Перечисление";
	
КонецФункции

// Функция-свойство: возвращает значение для идентификации общего типа "Регистры сведений"
//
// Тип: Строка
//
Функция ИмяТипаРегистрыСведений() Экспорт
	
	Возврат "РегистрСведений";
	
КонецФункции

// Функция-свойство: возвращает значение для идентификации общего типа "Регистры накопления"
//
// Тип: Строка
//
Функция ИмяТипаРегистрыНакопления() Экспорт
	
	Возврат "РегистрНакопления";
	
КонецФункции

// Функция-свойство: возвращает значение для идентификации общего типа "Регистры бухгалтерии"
//
// Тип: Строка
//
Функция ИмяТипаРегистрыБухгалтерии() Экспорт
	
	Возврат "РегистрБухгалтерии";
	
КонецФункции

// Функция-свойство: возвращает значение для идентификации общего типа "Регистры расчета"
//
// Тип: Строка
//
Функция ИмяТипаРегистрыРасчета() Экспорт
	
	Возврат "РегистрРасчета";
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ПРОВЕРИТЬ ПРИНАДЛЕЖНОСТЬ К ТИПУ.
//

// Определяет принадлежность объекта метаданных к общему типу "Справочник"
//
// Параметры:
//  ОбъектМетаданных – объект метаданных, для которого необходимо определить принадлежность к заданному типу
// 
//  Возвращаемое значение:
//  Тип: Булево. Истина – объект метаданных принадлежит заданному типу; Ложь – нет.
//
Функция ЭтоСправочник(ОбъектМетаданных) Экспорт
	
	Возврат ИмяБазовогоТипаПоОбъектуМетаданных(ОбъектМетаданных) = ИмяТипаСправочники();
	
КонецФункции

// Определяет принадлежность объекта метаданных к общему типу "Документ"
//
// Параметры:
//  ОбъектМетаданных – объект метаданных, для которого необходимо определить принадлежность к заданному типу
// 
//  Возвращаемое значение:
//  Тип: Булево. Истина – объект метаданных принадлежит заданному типу; Ложь – нет.
//
Функция ЭтоДокумент(ОбъектМетаданных) Экспорт
	
	Возврат ИмяБазовогоТипаПоОбъектуМетаданных(ОбъектМетаданных) = ИмяТипаДокументы();
	
КонецФункции

// Определяет принадлежность объекта метаданных к общему типу "План видов характеристик"
//
// Параметры:
//  ОбъектМетаданных – объект метаданных, для которого необходимо определить принадлежность к заданному типу
// 
//  Возвращаемое значение:
//  Тип: Булево. Истина – объект метаданных принадлежит заданному типу; Ложь – нет.
//
Функция ЭтоПланВидовХарактеристик(ОбъектМетаданных) Экспорт
	
	Возврат ИмяБазовогоТипаПоОбъектуМетаданных(ОбъектМетаданных) = ИмяТипаПланыВидовХарактеристик();
	
КонецФункции

// Определяет принадлежность объекта метаданных к общему типу "План обмена"
//
// Параметры:
//  ОбъектМетаданных – объект метаданных, для которого необходимо определить принадлежность к заданному типу
// 
//  Возвращаемое значение:
//  Тип: Булево. Истина – объект метаданных принадлежит заданному типу; Ложь – нет.
//
Функция ЭтоПланОбмена(ОбъектМетаданных) Экспорт
	
	Возврат ИмяБазовогоТипаПоОбъектуМетаданных(ОбъектМетаданных) = ИмяТипаПланыОбмена();
	
КонецФункции

// Определяет принадлежность объекта метаданных к общему типу "Бизнес-процесс"
//
// Параметры:
//  ОбъектМетаданных – объект метаданных, для которого необходимо определить принадлежность к заданному типу
// 
//  Возвращаемое значение:
//  Тип: Булево. Истина – объект метаданных принадлежит заданному типу; Ложь – нет.
//
Функция ЭтоБизнесПроцесс(ОбъектМетаданных) Экспорт
	
	Возврат ИмяБазовогоТипаПоОбъектуМетаданных(ОбъектМетаданных) = ИмяТипаБизнесПроцессы();
	
КонецФункции

// Определяет принадлежность объекта метаданных к общему типу "Задачи"
//
// Параметры:
//  ОбъектМетаданных – объект метаданных, для которого необходимо определить принадлежность к заданному типу
// 
//  Возвращаемое значение:
//  Тип: Булево. Истина – объект метаданных принадлежит заданному типу; Ложь – нет.
//
Функция ЭтоЗадача(ОбъектМетаданных) Экспорт
	
	Возврат ИмяБазовогоТипаПоОбъектуМетаданных(ОбъектМетаданных) = ИмяТипаЗадачи();
	
КонецФункции

// Определяет принадлежность объекта метаданных к общему типу "Планы видов расчета"
//
// Параметры:
//  ОбъектМетаданных – объект метаданных, для которого необходимо определить принадлежность к заданному типу
// 
//  Возвращаемое значение:
//  Тип: Булево. Истина – объект метаданных принадлежит заданному типу; Ложь – нет.
//
Функция ЭтоПланВидовРасчета(ОбъектМетаданных) Экспорт
	
	Возврат ИмяБазовогоТипаПоОбъектуМетаданных(ОбъектМетаданных) = ИмяТипаПланыВидовРасчета();
	
КонецФункции

// Определяет принадлежность объекта метаданных к общему типу "Планы счетов"
//
// Параметры:
//  ОбъектМетаданных – объект метаданных, для которого необходимо определить принадлежность к заданному типу
// 
//  Возвращаемое значение:
//  Тип: Булево. Истина – объект метаданных принадлежит заданному типу; Ложь – нет.
//
Функция ЭтоПланСчетов(ОбъектМетаданных) Экспорт
	
	Возврат ИмяБазовогоТипаПоОбъектуМетаданных(ОбъектМетаданных) = ИмяТипаПланыСчетов();
	
КонецФункции

// Определяет принадлежность объекта метаданных к общему типу "Перечисление"
//
// Параметры:
//  ОбъектМетаданных – объект метаданных, для которого необходимо определить принадлежность к заданному типу
// 
//  Возвращаемое значение:
//  Тип: Булево. Истина – объект метаданных принадлежит заданному типу; Ложь – нет.
//
Функция ЭтоПеречисление(ОбъектМетаданных) Экспорт
	
	Возврат ИмяБазовогоТипаПоОбъектуМетаданных(ОбъектМетаданных) = ИмяТипаПеречисления();
	
КонецФункции

Функция ЭтоПримитивныйТип(хТип)

	Если хТип = Тип("Строка") ИЛИ хТип = Тип("Число") ИЛИ хТип = Тип("Дата") ИЛИ хТип = Тип("Булево") Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// Процедуры и функции для работы с типами, объектами метаданных и их строковыми представлениями.

// Проверка того, что тип имеет ссылочный тип данных
//
Функция ЭтоСсылка(Тип) Экспорт
	
	Возврат Справочники.ТипВсеСсылки().СодержитТип(Тип)
		ИЛИ Документы.ТипВсеСсылки().СодержитТип(Тип)
		ИЛИ Перечисления.ТипВсеСсылки().СодержитТип(Тип)
		ИЛИ ПланыВидовХарактеристик.ТипВсеСсылки().СодержитТип(Тип)
		ИЛИ ПланыСчетов.ТипВсеСсылки().СодержитТип(Тип)
		ИЛИ ПланыВидовРасчета.ТипВсеСсылки().СодержитТип(Тип)
		ИЛИ БизнесПроцессы.ТипВсеСсылки().СодержитТип(Тип)
		ИЛИ БизнесПроцессы.ТипВсеСсылкиТочекМаршрутаБизнесПроцессов().СодержитТип(Тип)
		ИЛИ Задачи.ТипВсеСсылки().СодержитТип(Тип)
		ИЛИ ПланыОбмена.ТипВсеСсылки().СодержитТип(Тип);
	
КонецФункции

// Проверяет физическое наличие записи в информационной базе данных о переданном значении ссылки.
//
// Параметры:
//  ЛюбаяСсылка - значение любой ссылки информационной базы данных.
// 
// Возвращаемое значение:
//  Булево.
//
Функция СсылкаСуществует(ЛюбаяСсылка) Экспорт
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	Ссылка КАК Ссылка
	|ИЗ
	|	[ИмяТаблицы]
	|ГДЕ
	|	Ссылка = &Ссылка
	|";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "[ИмяТаблицы]", ИмяТаблицыПоСсылке(ЛюбаяСсылка));
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Ссылка", ЛюбаяСсылка);
	
	УстановитьПривилегированныйРежим(Истина);
	
	Возврат НЕ Запрос.Выполнить().Пустой();
	
КонецФункции

// Возвращает полное имя объекта метаданных по переданному значению ссылки.
// Примеры:
//  "Справочник.Номенклатура";
//  "Документ.ПриходнаяНакладная".
//
// Параметры:
//  Ссылка - ЛюбаяСсылка - объект, для которого необходимо получить имя таблицы ИБ.
// 
// Возвращаемое значение:
//  Строка - полное имя объекта метаданных для указанного объекта.
//
Функция ИмяТаблицыПоСсылке(Ссылка) Экспорт
	
	Возврат Ссылка.Метаданные().ПолноеИмя();
	
КонецФункции

// Проверить, что значение имеет ссылочный тип данных.
//
// Параметры:
//  Значение       - ссылка на объект, - элемент справочника, документ, ...
//
// Возвращаемое значение:
//  Булево       - Истина, если тип значения ссылочный.
//
Функция ЗначениеСсылочногоТипа(Значение) Экспорт
	
	Если Значение = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если Справочники.ТипВсеСсылки().СодержитТип(ТипЗнч(Значение)) Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если Документы.ТипВсеСсылки().СодержитТип(ТипЗнч(Значение)) Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если Перечисления.ТипВсеСсылки().СодержитТип(ТипЗнч(Значение)) Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если ПланыВидовХарактеристик.ТипВсеСсылки().СодержитТип(ТипЗнч(Значение)) Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если ПланыСчетов.ТипВсеСсылки().СодержитТип(ТипЗнч(Значение)) Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если ПланыВидовРасчета.ТипВсеСсылки().СодержитТип(ТипЗнч(Значение)) Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если БизнесПроцессы.ТипВсеСсылки().СодержитТип(ТипЗнч(Значение)) Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если БизнесПроцессы.ТипВсеСсылкиТочекМаршрутаБизнесПроцессов().СодержитТип(ТипЗнч(Значение)) Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если Задачи.ТипВсеСсылки().СодержитТип(ТипЗнч(Значение)) Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если ПланыОбмена.ТипВсеСсылки().СодержитТип(ТипЗнч(Значение)) Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

//+yuraos, 10.09.2015
Функция ОТДСодержитТип(ОТД, ЗначениеИлиТип, ЭтоПростойТип=Null) Экспорт
	
	// Проверка того, описание типа содержит указанный тип
	Если ТипЗнч(ОТД) <> Тип("ОписаниеТипов") Тогда
		ЭтоПростойТип = Null;
		Возврат Ложь;
	КонецЕсли;
	ЭтоПростойТип = ОТД.Типы().Количество() <= 1;
	
	Возврат ОТД.СодержитТип(?(ТипЗнч(ЗначениеИлиТип) = Тип("Тип"), ЗначениеИлиТип, ТипЗнч(ЗначениеИлиТип)));
	
КонецФункции

//+yuraos, 10.09.2015
Функция ОТДСодержитСсылки(ОТД, ЭтоПростойТип=Null) Экспорт
	
	// Проверка того, описание типа содержит ссылочные типы
	ЭтоПростойТип = Null;
	Если ТипЗнч(ОТД) = Тип("ОписаниеТипов") Тогда
		ЭтоПростойТип = ОТД.Типы().Количество() <= 1;
		Для Каждого Тип Из ОТД.Типы() Цикл
			Если ЭтоСсылка(Тип) Тогда
				Возврат Истина;
			КонецЕсли; 
		КонецЦикла; 
	КонецЕсли; 
	
	Возврат Ложь;
	
КонецФункции
 
//+yuraos, 10.09.2015
Функция СписокПустыхСсылокйПолучить(мсСсылки) Экспорт
	
	тзСписок = Новый ТаблицаЗначений;
	тзСписок.Колонки.Добавить("Значение");
	тзСписок.Колонки.Добавить("ТипЧисло");
	тзСписок.Колонки.Добавить("Тип");
	тзСписок.Колонки.Добавить("Вид");
	Для Каждого ЗначениеСсылка ИЗ мсСсылки Цикл
		ЗначениеТип = ТипЗнч(ЗначениеСсылка);
		Если ЗначениеТип = Тип("Неопределено") Тогда
			Продолжить;
		КонецЕсли;
		Если ЭтоСсылка(ЗначениеТип) Тогда
			ПустаяСсылка = Новый(ЗначениеТип);
			Если тзСписок.Найти(ПустаяСсылка,"Значение") <> Неопределено Тогда
				Продолжить;
			КонецЕсли; 
			ЗначениеМД = ЗначениеСсылка.Метаданные();
			Стр = тзСписок.Добавить();
			Стр.Значение = ПустаяСсылка;
			Стр.Тип = ИмяБазовогоТипаПоОбъектуМетаданных(ЗначениеМД);
			Стр.Вид = ЗначениеМД.Имя;
			Если Стр.Тип = ИмяТипаПланыОбмена() Тогда
				Стр.ТипЧисло = 0;
			ИначеЕсли Стр.Тип = ИмяТипаСправочники() Тогда
				Стр.ТипЧисло = 1;
			ИначеЕсли Стр.Тип = ИмяТипаДокументы() Тогда
				Стр.ТипЧисло = 2;
			ИначеЕсли Стр.Тип = ИмяТипаПланыВидовХарактеристик() Тогда
				Стр.ТипЧисло = 3;
			ИначеЕсли Стр.Тип = ИмяТипаПланыСчетов() Тогда
				Стр.ТипЧисло = 4;
			ИначеЕсли Стр.Тип = ИмяТипаПланыВидовРасчета() Тогда
				Стр.ТипЧисло = 5;
			ИначеЕсли Стр.Тип = ИмяТипаБизнесПроцессы() Тогда
				Стр.ТипЧисло = 6;
			ИначеЕсли Стр.Тип = ИмяТипаЗадачи() Тогда
				Стр.ТипЧисло = 7;
			Иначе
				Стр.ТипЧисло = 999;
			КонецЕсли; 
		КонецЕсли; 
	КонецЦикла;
	
	//тзСписок.Сортировать("ТипЧисло asc, Тип asc, Вид asc");
	сзСписок = Новый СписокЗначений;
	Для Каждого Стр Из тзСписок Цикл
		сзСписок.Добавить(Стр.Значение, "Пустое значение <<" + Стр.Тип + "." + Стр.Вид + ">>", , );
	КонецЦикла;
	
	Возврат сзСписок;
	
КонецФункции

//+yuraos, 10.09.2015
Процедура СписокПустыхСсылокВставить(сзСписок, ЗначениеСсылка, Знач МаксДлина=10) Экспорт
	Если ТипЗнч(сзСписок) <> Тип("СписокЗначений") Тогда
		сзСписок = Новый СписокЗначений;
	КонецЕсли; 
	Если ТипЗнч(МаксДлина) <> Тип("Число") ИЛИ МаксДлина <= 0 Тогда
		МаксДлина = 10;
	КонецЕсли;
	ЗначениеТип = ТипЗнч(ЗначениеСсылка);
	Если ЭтоСсылка(ЗначениеТип) Тогда
		ПустаяСсылка = Новый(ЗначениеТип);
		Элемент = сзСписок.НайтиПоЗначению(ПустаяСсылка);
		Если Элемент = Неопределено Тогда
			// добавим строку в список
			ЗначениеМД = ЗначениеСсылка.Метаданные();
			Тип = ИмяБазовогоТипаПоОбъектуМетаданных(ЗначениеМД);
			Вид = ЗначениеМД.Имя;
			Элемент = сзСписок.Вставить(0, ПустаяСсылка, "Пустое значение <<" + Тип + "." + Вид + ">>", , );
			Пока сзСписок.Количество() > МаксДлина Цикл
				сзСписок.Удалить(сзСписок[МаксДлина]);
			КонецЦикла; 
		Иначе
			// сдвинем строку в начало списка
			сзСписок.Сдвинуть(Элемент,-сзСписок.Индекс(Элемент));
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

//+yuraos, 10.09.2015
Процедура СписокПустыхСсылокУстановитьКартинки(сзСписок) Экспорт
	Для Каждого Элемент ИЗ сзСписок Цикл
		Тип = ИмяБазовогоТипаПоОбъектуМетаданных(Элемент.Значение.Метаданные());
		Попытка
			Картинка = БиблиотекаКартинок[Тип];
		Исключение
			Картинка = Неопределено;
		КонецПопытки;
		Элемент.Картинка = Картинка;
	КонецЦикла; 
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// РОДИТЕЛЬ ВЕРХНЕГО УРОВНЯ.
//

Функция РодительВерхнегоУровняПоГруппе(ЭлементСправочника, ИскомыйРодитель)
    Если НЕ ИскомыйРодитель = Неопределено И ЭлементСправочника = ИскомыйРодитель Тогда
        Возврат ЭлементСправочника;
	Иначе
        Возврат РодительВерхнегоУровня(ЭлементСправочника.Родитель);
	КонецЕсли;
КонецФункции

Функция РодительВерхнегоУровня(ЭлементСправочника)
    Если ЭлементСправочника.Родитель.Пустая() Тогда
        Возврат ЭлементСправочника;
    Иначе
        Возврат РодительВерхнегоУровня(ЭлементСправочника.Родитель);
    КонецЕсли;
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// РЕКВИЗИТЫ ОБЪЕКТА/ФОРМЫ.

// Получить Реквизит ОбъектаБД по Имени.
//
Функция ОбъектБДПолучитьМДРеквизита(ИмяРеквизита, ОбъектБД) Экспорт
	
	мдОбъектаБД = ОбъектБД.Метаданные();
	
	Результат = Новый Структура;
	Результат.Вставить("Реквизит");
	Результат.Вставить("Группа");
	
	Группа = "реквизиты";
	Реквизит = мдОбъектаБД.Реквизиты.Найти(ИмяРеквизита);
	
	Если Реквизит = Неопределено Тогда
		
		Группа = "стдартные";
		Попытка
			Реквизит = мдОбъектаБД.СтандартныеРеквизиты[ИмяРеквизита];
		Исключение
			Группа = Неопределено;
			Реквизит = Неопределено;
		КонецПопытки;
		
		
		Если Реквизит = Неопределено Тогда
			Группа = "адресации";
			Попытка
				Реквизит = мдОбъектаБД.РеквизитыАдресации[ИмяРеквизита];
			Исключение
				Группа = Неопределено;
				Реквизит = Неопределено;
			КонецПопытки;
		КонецЕсли;

		Если Реквизит = Неопределено Тогда
			Группа = "общие";
			Попытка
				Реквизит = Метаданные.ОбщиеРеквизиты[ИмяРеквизита];
			Исключение
				Группа = Неопределено;
				Реквизит = Неопределено;
			КонецПопытки;
		КонецЕсли;
		
		Если ЭтотОбъект.ТипОбъектаБД = ИмяТипаПланыСчетов() И Реквизит = Неопределено Тогда
			Группа = "пр.учета";
			Попытка
				Реквизит = мдОбъектаБД.ПризнакиУчета[ИмяРеквизита];
			Исключение
				Группа = Неопределено;
				Реквизит = Неопределено;
			КонецПопытки;
		КонецЕсли;
		
	КонецЕсли;
	
	Результат.Группа = Группа;
	Результат.Реквизит = Реквизит;
	
	Возврат Результат;
	
КонецФункции 

// Возвращает Имя Реквизита Формы, связанного с ТЧ.
//
Функция ФормаПолучитьИмяРеквизитаТабличнаяЧасть(ТЧИмя) Экспорт
	
	Возврат "ТЧасть" + ТЧИмя;
	
КонецФункции

// Возвращает Имя Реквизита Формы, связанного с Регистром.
//
Функция ФормаПолучитьИмяРеквизитаРегистр(ТЧИмя) Экспорт
	
	Возврат "ТДвижений" + ТЧИмя;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// НЕЧЕТКОЕ СРАВНЕНИЕ СТРОК.

Функция СтрокиПодобны(Знач Строка1, Знач Строка2, Знач Процент = 75, ПроцентПодобия = 0)
	ПроцентПодобия = ПроцентПодобияСтрок(Строка1, Строка2);
	Возврат ПроцентПодобия >= Процент;
КонецФункции

// Возвращает процент похожести: 0 - не похоже, 100 - полное совпадение для строк
Функция ПроцентПодобияСтрок(Знач Строка1, Знач Строка2) Экспорт
	Перем ВсеСлова, ПерваяСтрока, ВтораяСтрока, Сортировщик1, Сортировщик2;
	Перем КлючЗначение, Метрика;
	
	Если Строка1 = Строка2 Тогда
		Возврат 100;
	КонецЕсли;
	
	ВсеСлова = Новый Соответствие;
	ВхожденияСлов(ВсеСлова, Строка1, 1);
	ВхожденияСлов(ВсеСлова, Строка2, 2);
	
	// Только различные слова
	Сортировщик1 = Новый СписокЗначений;
	Сортировщик2 = Новый СписокЗначений;
	Для Каждого КлючЗначение ИЗ ВсеСлова Цикл
		Если КлючЗначение.Значение = 1 Тогда
			Сортировщик1.Добавить(КлючЗначение.Ключ);
		ИначеЕсли КлючЗначение.Значение = 2 Тогда
			Сортировщик2.Добавить(КлючЗначение.Ключ);
		КонецЕсли;
	КонецЦикла;
	
	ПерваяСтрока = СловаИзСписка(Сортировщик1);
	ВтораяСтрока = СловаИзСписка(Сортировщик2);
	Если ПерваяСтрока = ВтораяСтрока Тогда 
		Возврат 100;
	КонецЕсли;
	
	Метрика = МетрикаРедактирования(ПерваяСтрока, ВтораяСтрока);
	
	Возврат 100 - Метрика * 100 / Макс(СтрДлина(Строка1), СтрДлина(Строка2));
	
КонецФункции

Процедура ВхожденияСлов(Результат, Знач ИсходнаяСтрока, Знач Приращение)
	Перем РабочаяСтрока, ТекущаяСтрока;
	Перем Позиция, Значение;
	
	
	РабочаяСтрока = СокрЛП(ИсходнаяСтрока);
	Пока Истина Цикл
		Позиция = Найти(РабочаяСтрока, " ");
		Если Позиция = 0 Тогда 
			Прервать;
		КонецЕсли;
		
		ТекущаяСтрока = Лев(РабочаяСтрока, Позиция - 1);
		Если НЕ ПустаяСтрока(ТекущаяСтрока) Тогда
			Значение = Результат[ТекущаяСтрока];
			Если Значение = Неопределено Тогда
				Значение = 0;
			КонецЕсли;
			Результат.Вставить(ТекущаяСтрока, Значение + Приращение);
		КонецЕсли;
		
		РабочаяСтрока = Сред(РабочаяСтрока, Позиция + 1);
	КонецЦикла;
	
	Если НЕ ПустаяСтрока(РабочаяСтрока) Тогда
		Значение = Результат[РабочаяСтрока];
		Если Значение = Неопределено Тогда
			Значение = 0;
		КонецЕсли;
		Результат.Вставить(РабочаяСтрока, Значение + Приращение);
	КонецЕсли;
	
КонецПроцедуры

Функция СловаИзСписка(Знач СписокСлов)
	Перем Результат;
	
	Результат = "";
	
	СписокСлов.СортироватьПоЗначению();
	Для Каждого Элемент ИЗ СписокСлов Цикл
		Результат = Результат + " " + Элемент.Значение;
	КонецЦикла;
	
	Возврат Сред(Результат, 2);
	
КонецФункции

Функция МетрикаРедактирования(Знач Строка1, Знач Строка2)
	Перем Длина1, Длина2, Позиция1, Позиция2;
	Перем ПредПозиция1, Символ1, ПредПозиция2, Символ2;
	Перем Коэффициенты, Стоимость;
	
	Если Строка1 = Строка2 Тогда
		Возврат 0;
	КонецЕсли;
	
	Длина1 = СтрДлина(Строка1);
	Длина2 = СтрДлина(Строка2);
	
	Если Длина1 = 0 Тогда
		Если Длина2 = 0 Тогда
			Возврат 0;
		КонецЕсли;
		Возврат Длина2;
		
	ИначеЕсли Длина2 = "" Тогда
		Возврат Длина1;
		
	КонецЕсли;
	
	// Инициализация
	Коэффициенты = Новый Массив(Длина1 + 1, Длина2 + 1);
	Для Позиция1 = 0 ПО Длина1 Цикл
		Коэффициенты[Позиция1][0] = Позиция1;
	КонецЦикла;
	Для Позиция2 = 0 ПО Длина2 Цикл
		Коэффициенты[0][Позиция2] = Позиция2
	КонецЦикла;
	
	// Расчет
	Для Позиция1 = 1 ПО Длина1 Цикл
		ПредПозиция1 = Позиция1 - 1;
		Символ1      = Сред(Строка1, Позиция1, 1);
		
		Для Позиция2 = 1 ПО Длина2 Цикл
			ПредПозиция2 = Позиция2 - 1;
			Символ2      = Сред(Строка2, Позиция2, 1);
			
			Стоимость = ?(Символ1 = Символ2, 0, 1); // Стоимость замены
			
			Коэффициенты[Позиция1][Позиция2] = Мин(
				Коэффициенты[ПредПозиция1][Позиция2]     + 1,	// Стоимость удаления,
				Коэффициенты[Позиция1]    [ПредПозиция2] + 1,	// Стоимость вставки,
				Коэффициенты[ПредПозиция1][ПредПозиция2] + Стоимость
			);
			
			Если Позиция1 > 1 И Позиция2 > 1 И Символ1 = Сред(Строка2, ПредПозиция2, 1) И Сред(Строка1, ПредПозиция1, 1) = Символ2 Тогда
				Коэффициенты[Позиция1][Позиция2] = Мин(
					Коэффициенты[Позиция1][Позиция2],
					Коэффициенты[Позиция1 - 2][Позиция2 - 2] + Стоимость	// Стоимость перестановки
				);
			КонецЕсли;
			
		КонецЦикла;
	КонецЦикла;
	
	Возврат Коэффициенты[Длина1][Длина2];
	
КонецФункции

// НЕЧЕТКОЕ СРАВНЕНИЕ СТРОК.
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// ОБЩЕГО НАЗНАЧЕНИЯ.
//

Функция НСтр1С(Знач Строка)
	Возврат НСтр("ru = '" + Строка + "'");
КонецФункции

// Функция "расщепляет" строку на подстроки, используя заданный
//      разделитель. Разделитель может иметь любую длину.
//      Если в качестве разделителя задан пробел, рядом стоящие пробелы
//      считаются одним разделителем, а ведущие и хвостовые пробелы параметра Стр
//      игнорируются.
//      Например,
//      РазложитьСтрокуВМассивПодстрок(",один,,,два", ",") возвратит массив значений из пяти элементов,
//      три из которых - пустые строки, а
//      РазложитьСтрокуВМассивПодстрок(" один   два", " ") возвратит массив значений из двух элементов
//
//  Параметры:
//      Стр -           строка, которую необходимо разложить на подстроки.
//                      Параметр передается по значению.
//      Разделитель -   строка-разделитель, по умолчанию - запятая.
//
//  Возвращаемое значение:
//      массив значений, элементы которого - подстроки
//
Функция РазложитьСтрокуВМассивПодстрок(Знач Стр, Разделитель = ",") Экспорт
	Перем МассивСтрок;
	
	МассивСтрок = Новый Массив();
	Если Разделитель = " " Тогда
		Стр = СокрЛП(Стр);
		Пока 1 = 1 Цикл
			Поз = Найти(Стр, Разделитель);
			Если Поз = 0 Тогда
				МассивСтрок.Добавить(СокрЛП(Стр));
				Возврат МассивСтрок;
			КонецЕсли;
			МассивСтрок.Добавить(СокрЛП(Лев(Стр, Поз - 1)));
			Стр = СокрЛ(Сред(Стр, Поз));
		КонецЦикла;
	Иначе
		ДлинаРазделителя = СтрДлина(Разделитель);
		Пока 1 = 1 Цикл
			Поз = Найти(Стр, Разделитель);
			Если Поз = 0 Тогда
				Если (СокрЛП(Стр) <> "") Тогда
					МассивСтрок.Добавить(СокрЛП(Стр));
				КонецЕсли;
				Возврат МассивСтрок;
			КонецЕсли;
			МассивСтрок.Добавить(СокрЛП(Лев(Стр,Поз - 1)));
			Стр = Сред(Стр, Поз + ДлинаРазделителя);
		КонецЦикла;
	КонецЕсли;
	
	Возврат МассивСтрок;
	
КонецФункции

// Возвращает строку, полученную из массива элементов, разделенных символом разделителя
//
// Параметры:
//  Массив - Массив - массив элементов из которых необходимо получить строку
//  Разделитель - Строка - любой набор символов, который будет использован как разделитель между элементами в строке
//
// Возвращаемое значение:
//  Результат - Строка - строка, полученная из массива элементов, разделенных символом разделителя
// 
Функция ПолучитьСтрокуИзМассиваПодстрок(Массив, Разделитель = ",")
	
	// возвращаемое значение функции
	Результат = "";
	Для Каждого Элемент ИЗ Массив Цикл
		Подстрока = ?(ТипЗнч(Элемент) = Тип("Строка"), Элемент, Строка(Элемент));
		РазделительПодстрок = ?(ПустаяСтрока(Результат), "", Разделитель);
		Результат = Результат + РазделительПодстрок + Подстрока;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Удаляет двойные кавычки с начала и конца строки, если они есть.
//
// Параметры:
//  Строка - входная строка;
//
// Возвращаемое значение:
//  Строка - строка без двойных кавычек.
// 
Функция СократитьДвойныеКавычки(Знач Строка) Экспорт
	
	Пока Лев(Строка, 1) = """" Цикл
		Строка = Сред(Строка, 2); 
	КонецЦикла; 
	
	Пока Прав(Строка, 1) = """" Цикл
		Строка = Лев(Строка, СтрДлина(Строка) - 1);
	КонецЦикла;
	
	Возврат Строка;
	
КонецФункции 

// Подставляет параметры в строку. Максимально возможное число параметров - 9.
// Параметры в строке задаются как %<номер параметра>. Нумерация параметров
// начинается с единицы.
//
// Параметры
//  СтрокаПодстановки  – Строка – шаблон строки с параметрами (вхождениями вида "%ИмяПараметра").
// Параметр<n>         - Строка - параметр
// Возвращаемое значение:
//   Строка   – текстовая строка с подставленными параметрами
//
// Пример:
// Строка = ПодставитьПараметрыВСтроку(НСтр("ru='%1 пошел в %2'"), "Вася", "Зоопарк");
//
Функция ПодставитьПараметрыВСтроку(Знач СтрокаПодстановки,
	Знач Параметр1,	Знач Параметр2 = Неопределено, Знач Параметр3 = Неопределено,
	Знач Параметр4 = Неопределено, Знач Параметр5 = Неопределено, Знач Параметр6 = Неопределено,
	Знач Параметр7 = Неопределено, Знач Параметр8 = Неопределено, Знач Параметр9 = Неопределено) Экспорт
	
	Если СтрокаПодстановки = Неопределено ИЛИ СтрДлина(СтрокаПодстановки) = 0 Тогда
		Возврат "";
	КонецЕсли;
	
	Результат = "";
	НачПозиция = 1;
	Позиция = 1;
	Пока Позиция <= СтрДлина(СтрокаПодстановки) Цикл
		СимволСтроки = Сред(СтрокаПодстановки, Позиция, 1);
		Если СимволСтроки <> "%" Тогда
			Позиция = Позиция + 1;
			Продолжить;
		КонецЕсли;
		Результат = Результат + Сред(СтрокаПодстановки, НачПозиция, Позиция - НачПозиция);
		Позиция = Позиция + 1;
		СимволСтроки = Сред(СтрокаПодстановки, Позиция, 1);
		
		Если СимволСтроки = "%" Тогда
			Позиция = Позиция + 1;
			НачПозиция = Позиция;
			Результат = Результат + "%";
			Продолжить;
		КонецЕсли;
		
		Попытка
			НомерПараметра = Число(СимволСтроки);
		Исключение
			ВызватьИсключение НСтр("ru='Входная строка СтрокаПодстановки имеет неверный формат: %'" + СимволСтроки);
		КонецПопытки;
		
		Если СимволСтроки = "1" Тогда
			ЗначениеПараметра = Параметр1;
		ИначеЕсли СимволСтроки = "2" Тогда
			ЗначениеПараметра = Параметр2;
		ИначеЕсли СимволСтроки = "3" Тогда
			ЗначениеПараметра = Параметр3;
		ИначеЕсли СимволСтроки = "4" Тогда
			ЗначениеПараметра = Параметр4;
		ИначеЕсли СимволСтроки = "5" Тогда
			ЗначениеПараметра = Параметр5;
		ИначеЕсли СимволСтроки = "6" Тогда
			ЗначениеПараметра = Параметр6;
		ИначеЕсли СимволСтроки = "7" Тогда
			ЗначениеПараметра = Параметр7;
		ИначеЕсли СимволСтроки = "8" Тогда
			ЗначениеПараметра = Параметр8;
		ИначеЕсли СимволСтроки = "9" Тогда
			ЗначениеПараметра = Параметр9;
		Иначе
			ВызватьИсключение НСтр("ru='Входная строка СтрокаПодстановки имеет неверный формат: %'" + ЗначениеПараметра);
		КонецЕсли;
		Если ЗначениеПараметра = Неопределено Тогда
			ЗначениеПараметра = "";
		Иначе
			ЗначениеПараметра = Строка(ЗначениеПараметра);
		КонецЕсли;
		Результат = Результат + ЗначениеПараметра;
		Позиция = Позиция + 1;
		НачПозиция = Позиция;
	
	КонецЦикла;
	
	Если (НачПозиция <= СтрДлина(СтрокаПодстановки)) Тогда
		Результат = Результат + Сред(СтрокаПодстановки, НачПозиция, СтрДлина(СтрокаПодстановки) - НачПозиция + 1);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Удаляет цифры из строки, оставляя символы.
//
Функция УдалитьЦифрыВСтроке(НомерСЦифрами)
	
	Массив = Новый Массив;
	Массив.Добавить("0");
	Массив.Добавить("1");
	Массив.Добавить("2");
	Массив.Добавить("3");
	Массив.Добавить("4");
	Массив.Добавить("5");
	Массив.Добавить("6");
	Массив.Добавить("7");
	Массив.Добавить("8");
	Массив.Добавить("9");
	
	НомерБезЦифр = НомерСЦифрами;
	Для нМ = 0 По 9 Цикл
		Пока Найти(НомерБезЦифр, Массив[нМ]) > 0 Цикл
			НомерБезЦифр = СтрЗаменить(НомерБезЦифр, Массив[нМ], "");
		КонецЦикла;
	КонецЦикла;
	НомерБезЦифр = СокрЛП(НомерБезЦифр);
	
	Возврат НомерБезЦифр;
	
КонецФункции

// Сервисное сообщение.
//
Процедура СообщитьОбОшибкеПриЗаписи(Информация)
	
	Причина = ?(Информация.Причина = Неопределено, Информация, Информация.Причина);
	Сообщить("МО: " + Причина.Описание, СтатусСообщения.Важное);
	
КонецПроцедуры

// Удаляет из строки указанное количество символов справа.
//
// Параметры:
//  Текст         - Строка - строка, в которой необходимо удалить последние символы;
//  ЧислоСимволов - Число  - количество удаляемых символов.
//
Процедура УдалитьПоследнийСимволВСтроке(Текст, ЧислоСимволов)
	
	Текст = Лев(Текст, СтрДлина(Текст) - ЧислоСимволов);
	
КонецПроцедуры 

// Преобразует строку в число
//
// Параметры:
//     Текст - Строка - строковое представление числа.
// 
// Возвращаемое значение:
//     Число        - преобразованная строка.
//     Неопределено - если строка не может быть преобразована.
//
Функция СтрокаВЧисло(Знач Текст) Экспорт
	ТекстЧисла = СокрЛП(СтрЗаменить(Текст, Символы.НПП, ""));
	
	Если ПустаяСтрока(ТекстЧисла) Тогда
		Возврат 0;
	КонецЕсли;
	
	// Ведущие нули
	Позиция = 1;
	Пока Сред(ТекстЧисла, Позиция, 1) = "0" Цикл
		Позиция = Позиция + 1;
	КонецЦикла;
	ТекстЧисла = Сред(ТекстЧисла, Позиция);
	
	// Проверяем на результат по умолчанию.
	Если ТекстЧисла = "0" Тогда
		Результат = 0;
	Иначе
		ТипЧисло = Новый ОписаниеТипов("Число");
		Результат = ТипЧисло.ПривестиЗначение(ТекстЧисла);
		Если Результат = 0 Тогда
			// Результат по умолчанию обработан выше, это ошибка преобразования.
			Результат = Неопределено;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

//////////////////////////////////////////////////////////////////////////////
// ДОКУМЕНТЫ. Статистика документов.

Функция ПолучитьСтатистикуДокументовНаСервере(ТаблицаСтатистика, СтатДатаНач, СтатДатаКон, СтатОрганизация) Экспорт
	
	ТаблицаСтатистика.Очистить();
	
	Если СтатДатаКон = Дата("00010101") Тогда
		СтатДатаКон = ТекущаяДата();
	КонецЕсли;
	
	ИндексДокумента = 0;
	Для Каждого мдДокумента ИЗ Метаданные.Документы Цикл
		ИндексДокумента = ИндексДокумента + 1;
		
		Комментарий = "";
		ЕстьРеквизитОрганизация = НЕ мдДокумента.Реквизиты.Найти("Организация") = Неопределено;
		
		Периодичность = Строка(мдДокумента.ПериодичностьНомера);
		
		ПроведениеРазрешено = мдДокумента.Проведение = Метаданные.СвойстваОбъектов.Проведение.Разрешить;
		КоличествоДвижений 	= мдДокумента.Движения.Количество();
		
		Комментарий = "" + ?(НЕ СокрЛП(мдДокумента.Нумератор) = "", "Нумератор: " + мдДокумента.Нумератор, "Без нумератора") + ", " + ?(мдДокумента.КонтрольУникальности, "Контроль уникальности", "Без контроля уникальности") + ", " + ?(мдДокумента.Автонумерация, "Автонумерация", "Без автонумерации");
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	" + ИндексДокумента + " КАК Нпп,
		|	""" + МДдокумента.Имя + """ КАК Документ,
		|	""" + МДдокумента.Синоним + """ КАК Синоним,
		|	ЕСТЬNULL(КОЛИЧЕСТВО(*), 0) КАК Количество,
		|	ЕСТЬNULL(МАКСИМУМ(ЗапросПоПроведенным.КоличествоПроведенных), 0) КАК КоличествоПроведенных,
		|	МИНИМУМ(ДокументОСНОВНОЙ.Дата) КАК ДатаПервого,
		|	МАКСИМУМ(ДокументОСНОВНОЙ.Дата) КАК ДатаПоследнего,
		|	РАЗНОСТЬДАТ(МИНИМУМ(ДокументОСНОВНОЙ.Дата),МАКСИМУМ(ДокументОСНОВНОЙ.Дата),ДЕНЬ)+1 КАК ПериодДни,
		|	ВЫРАЗИТЬ(КОЛИЧЕСТВО(*)/(РАЗНОСТЬДАТ(МИНИМУМ(ДокументОСНОВНОЙ.Дата),МАКСИМУМ(ДокументОСНОВНОЙ.Дата),ДЕНЬ)+1) КАК ЧИСЛО(15,3)) КАК СреднееЗаДень,
		|	""" + Комментарий + """ КАК Комментарий,
		|	""" + ПроведениеРазрешено + """ КАК ПроведениеРазрешено,
		|	""" + КоличествоДвижений + """ КАК КоличествоДвижений,
		|	""" + ЕстьРеквизитОрганизация + """ КАК ЕстьРеквизитОрганизация,
		|	""" + Периодичность + """ КАК Периодичность
		|ИЗ
		|	Документ." + МДдокумента.Имя + " КАК ДокументОСНОВНОЙ,
		|	(ВЫБРАТЬ
		|		ЕСТЬNULL(КОЛИЧЕСТВО(*), 0) КАК КоличествоПроведенных
		|	ИЗ
		|		Документ." + МДдокумента.Имя + " КАК ДокументПРОВЕДЕННЫЙ
		|	ГДЕ
		|		ДокументПРОВЕДЕННЫЙ.Проведен
		|		И ДокументПРОВЕДЕННЫЙ.Дата Между &ДатаНач И &ДатаКон
		|		И &УсловиеПоОрганизацииПРОВЕДЕННЫЕ) КАК ЗапросПоПроведенным
		|ГДЕ
		|	ДокументОСНОВНОЙ.Дата Между &ДатаНач И &ДатаКон
		|	И &УсловиеПоОрганизацииОСНОВНОЙ";
		
		Если НЕ мдДокумента.Реквизиты.Найти("Организация") = Неопределено И ЗначениеЗаполнено(СтатОрганизация) Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеПоОрганизацииОСНОВНОЙ", "ДокументОСНОВНОЙ.Организация = &Организация");
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеПоОрганизацииПРОВЕДЕННЫЕ", "ДокументПРОВЕДЕННЫЙ.Организация = &Организация");
			Запрос.УстановитьПараметр("Организация", СтатОрганизация);
		Иначе
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеПоОрганизацииОСНОВНОЙ", "Истина");
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеПоОрганизацииПРОВЕДЕННЫЕ", "Истина");
		КонецЕсли;
		
		Запрос.УстановитьПараметр("ДатаНач", НачалоДня(СтатДатаНач));
		Запрос.УстановитьПараметр("ДатаКон", КонецДня(СтатДатаКон));
		
		Результат = Запрос.Выполнить().Выгрузить();
		ЗаполнитьЗначенияСвойств(ТаблицаСтатистика.Добавить(), Результат[0]);
	КонецЦикла;
	
	НоваяСтрока = ТаблицаСтатистика.Вставить(0);
	НоваяСтрока.Синоним = "ИТОГО:";
	НоваяСтрока.Количество = ТаблицаСтатистика.Итог("Количество");
	НоваяСтрока.КоличествоПроведенных = ТаблицаСтатистика.Итог("КоличествоПроведенных");
	
	Если ЗначениеЗаполнено(СтатОрганизация) Тогда
		МассивСтрокСОрганизацией = ТаблицаСтатистика.НайтиСтроки(Новый Структура("ЕстьРеквизитОрганизация", Истина));
		КВоДокументовОрганизацииОБЩЕЕ = 0;
		КВоДокументовОрганизацииПРОВЕДЕННЫХ = 0;
		Для Каждого СтрокаМассива ИЗ МассивСтрокСОрганизацией Цикл
			КВоДокументовОрганизацииОБЩЕЕ = КВоДокументовОрганизацииОБЩЕЕ + СтрокаМассива.Количество;
			КВоДокументовОрганизацииПРОВЕДЕННЫХ = КВоДокументовОрганизацииПРОВЕДЕННЫХ + СтрокаМассива.КоличествоПроведенных;
		КонецЦикла;
		НоваяСтрока.Количество = "" + НоваяСтрока.Количество + "/" + КВоДокументовОрганизацииОБЩЕЕ;
		НоваяСтрока.КоличествоПроведенных = "" + НоваяСтрока.КоличествоПроведенных + "/" + КВоДокументовОрганизацииПРОВЕДЕННЫХ;
	КонецЕсли;
	
	Возврат ТаблицаСтатистика;

КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ВКЛАДКА "ДОПОЛНИТЕЛЬНО". "ДОКУМЕНТ (ДОПОЛНИТЕЛЬНО) ДВИЖЕНИЯ".
//

// Вкладка "Документ дополнительно". Движения документов. Заполнение списка видов документов.
//
Функция ДокументДвиженияЗаполнитьСписокВидовДокументов(ДокументСписокВидов, ДвОрганизация) Экспорт
	
	ДокументСписокВидов.Очистить();
	
	Для Каждого мдДокумента ИЗ Метаданные.Документы Цикл
		
		Если мдДокумента.Движения.Количество() = 0 Тогда	// Без возможных движений нецелесообразно.
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = ДокументСписокВидов.Добавить();
		
		НоваяСтрока.Имя = мдДокумента.Имя;
		НоваяСтрока.ПроведениеРазрешено = мдДокумента.Проведение = Метаданные.СвойстваОбъектов.Проведение.Разрешить;
		
		Попытка
			// Только документы, у которых проведение разрешено.
			Если НоваяСтрока.ПроведениеРазрешено Тогда
				НоваяСтрока.Картинка = БиблиотекаКартинок.Провести;
			Иначе
				НоваяСтрока.Картинка = БиблиотекаКартинок.Удалить;
			КонецЕсли;	
		Исключение
		    //Сообщить(НСтр("ru = '"+ОписаниеОшибки()+"'"), СтатусСообщения.Внимание);
		КонецПопытки;
		
		// Только документы, у которых проведение разрешено.
		Если НоваяСтрока.ПроведениеРазрешено Тогда
			НоваяСтрока.Пометка = Истина;
		Иначе
			НоваяСтрока.Пометка = Ложь;
			НоваяСтрока.Комментарий = "Проведение запрещено.";
		КонецЕсли;	
		
		Если мдДокумента.Имя = "ЧекККМ" ИЛИ мдДокумента.Имя = "ЧекККМВозврат" Тогда				// Чеки ККМ: По-умолчанию не рассматриваем.
			НоваяСтрока.Пометка = Ложь;
		КонецЕсли;
		
		НоваяСтрока.Значение = мдДокумента.Имя;
		НоваяСтрока.Представление = мдДокумента.Представление();
		
		НоваяСтрока.ЕстьРеквизитОрганизация = НЕ мдДокумента.Реквизиты.Найти("Организация") = Неопределено;
		Если НЕ НоваяСтрока.ЕстьРеквизитОрганизация Тогда
			НоваяСтрока.Комментарий = НоваяСтрока.Комментарий + " Отсутствует реквизит ""Организация"".";
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ДвОрганизация) И НЕ НоваяСтрока.ЕстьРеквизитОрганизация Тогда
			НоваяСтрока.Пометка = Ложь;
		КонецЕсли;
		
		НоваяСтрока.ДвиженияКоличество = мдДокумента.Движения.Количество();
		
		ШаблонТекстаЗапросаНепроведенныеСДвижениями =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ХРегистр.Регистратор КАК Регистратор
		|ИЗ
		|	&ТипРегистра.&ИмяРегистра КАК ХРегистр
		|ГДЕ
		|	ХРегистр.Регистратор В(&СписокДокументов)
		|	И &УсловиеАктивностьЗаписиРегистра";
		
		ШаблонТекстаЗапросаПроведенныеБезДвижений = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ХДокумент.Ссылка КАК Регистратор
		|ИЗ
		|	Документ." + мдДокумента.Имя + " КАК ХДокумент
		|	&ЛевыеСоединенияКРегистрам
		|ГДЕ
		|	ХДокумент.Ссылка В(&СписокДокументов)
		|	&РегистраторЕстьNULL";
		
		ЗапросПоРегистрамНепроведенныеСДвижениями = "";
		ЗапросПоРегистрамПроведенныеБезДвижений = "";
		ЛевыеСоединенияКРегистрам = "";
		РегистраторЕстьNULL = "";
		Для Каждого мдРегистра ИЗ мдДокумента.Движения Цикл
			
			ТипРегистра = ИмяБазовогоТипаПоОбъектуМетаданных(мдРегистра);
			
			Если ТипРегистра = ИмяТипаРегистрыСведений() И мдРегистра.РежимЗаписи = Метаданные.СвойстваОбъектов.РежимЗаписиРегистра.Независимый Тогда
				Продолжить;
			КонецЕсли;
			
			ТекстЗапроса = ШаблонТекстаЗапросаНепроведенныеСДвижениями;
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТипРегистра" , ТипРегистра);
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ИмяРегистра" , мдРегистра.Имя);
			ЗапросПоРегистрамНепроведенныеСДвижениями 	= ЗапросПоРегистрамНепроведенныеСДвижениями + ?(ЗапросПоРегистрамНепроведенныеСДвижениями = "", "", Символы.ПС + "ОБЪЕДИНИТЬ" + Символы.ПС) + ТекстЗапроса;
			
			ЛевыеСоединенияКРегистрам = ЛевыеСоединенияКРегистрам + "
			|	ЛЕВОЕ СОЕДИНЕНИЕ &ТипРегистра.&ИмяРегистра
			|		ПО (&ТипРегистра.&ИмяРегистра.Регистратор = ХДокумент.Ссылка)";
			ЛевыеСоединенияКРегистрам = СтрЗаменить(ЛевыеСоединенияКРегистрам, "&ТипРегистра" , ТипРегистра);
			ЛевыеСоединенияКРегистрам = СтрЗаменить(ЛевыеСоединенияКРегистрам, "&ИмяРегистра" , мдРегистра.Имя);
			
			РегистраторЕстьNULL = РегистраторЕстьNULL + "
			|	И &ТипРегистра.&ИмяРегистра.Регистратор ЕСТЬ NULL";
			РегистраторЕстьNULL = СтрЗаменить(РегистраторЕстьNULL, "&ТипРегистра" , ТипРегистра);
			РегистраторЕстьNULL = СтрЗаменить(РегистраторЕстьNULL, "&ИмяРегистра" , мдРегистра.Имя);
			
		КонецЦикла;
		ЗапросПоРегистрамПроведенныеБезДвижений	= СтрЗаменить(ШаблонТекстаЗапросаПроведенныеБезДвижений, "&ЛевыеСоединенияКРегистрам", ЛевыеСоединенияКРегистрам);
		ЗапросПоРегистрамПроведенныеБезДвижений	= СтрЗаменить(ЗапросПоРегистрамПроведенныеБезДвижений, "&РегистраторЕстьNULL", РегистраторЕстьNULL);
		
		НоваяСтрока.ЗапросПоРегистрамНепроведенныеСДвижениями = ЗапросПоРегистрамНепроведенныеСДвижениями;
		НоваяСтрока.ЗапросПоРегистрамПроведенныеБезДвижений = ЗапросПоРегистрамПроведенныеБезДвижений;
		
	КонецЦикла;	
	
	ДокументСписокВидов.Сортировать("Представление");
	
	Возврат ДокументСписокВидов;
	
КонецФункции

Функция ПолучитьНепроведенныеДокументыСДвижениямиНаСервере(ДокументСписокВидов, ТаблицаДокументыДвиженя, УчитыватьАктивностьЗаписейРегистров, ДвДатаНач, ДвДатаКон, ДвОрганизация) Экспорт
	Перем ТаблицаРезультат;
	
	ТаблицаРезультат = ПолучитьДокументыИДвиженияНаСервере("НепроведенныеДокументыСДвижениями", ДокументСписокВидов, ТаблицаДокументыДвиженя, УчитыватьАктивностьЗаписейРегистров, ДвДатаНач, ДвДатаКон, ДвОрганизация);
	
	Возврат ТаблицаРезультат;
	
КонецФункции

Функция ПолучитьПроведенныеДокументыБезДвиженийНаСервере(ДокументСписокВидов, ТаблицаДокументыДвиженя, УчитыватьАктивностьЗаписейРегистров, ДвДатаНач, ДвДатаКон, ДвОрганизация) Экспорт
	Перем ТаблицаРезультат;
	
	ТаблицаРезультат = ПолучитьДокументыИДвиженияНаСервере("ПроведенныеДокументыБезДвижений", ДокументСписокВидов, ТаблицаДокументыДвиженя, УчитыватьАктивностьЗаписейРегистров, ДвДатаНач, ДвДатаКон, ДвОрганизация);
	
	Возврат ТаблицаРезультат;
	
КонецФункции

Функция ПолучитьДокументыИДвиженияНаСервере(ВидВыборки, ДокументСписокВидов, ТаблицаДокументыДвиженя, УчитыватьАктивностьЗаписейРегистров, Знач ДвДатаНач, Знач ДвДатаКон, Знач ДвОрганизация)
	Перем ЭлементСписка;
	Перем Запрос, Результат, ТаблицаРезультата, ТекстЗапросаПоРегистрам, СписокДокументов;
	
	ТаблицаДокументыДвиженя.Очистить();
	
	Если ДвДатаКон = Дата("00010101") Тогда
		ДвДатаКон = ТекущаяДата();
	КонецЕсли;
	
	Для Каждого ЭлементСписка ИЗ ДокументСписокВидов Цикл
		
		Если НЕ ЭлементСписка.Пометка ИЛИ ЭлементСписка.ДвиженияКоличество = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Если ВидВыборки = "НепроведенныеДокументыСДвижениями" Тогда
		
			// Ищем Непроведенные + ПомеченныеНаУдаление документы.
			
			Запрос = Новый Запрос;
			Запрос.Текст = "
			|ВЫБРАТЬ
			|	ХДокумент.Ссылка КАК Регистратор
			|ИЗ
			|	Документ." + ЭлементСписка.Значение + " КАК ХДокумент
			|ГДЕ
			|	(НЕ ХДокумент.Проведен ИЛИ ХДокумент.ПометкаУдаления)
			|	И ХДокумент.Дата Между &ДатаНач И &ДатаКон
			|	И &УсловиеПоОрганизации";
			
			ТекстЗапросаПоРегистрам = ЭлементСписка.ЗапросПоРегистрамНепроведенныеСДвижениями;
			
		ИначеЕсли ВидВыборки = "ПроведенныеДокументыБезДвижений" Тогда
		
			// Ищем Проведенные документы.
			
			Запрос = Новый Запрос;
			Запрос.Текст = "
			|ВЫБРАТЬ
			|	ХДокумент.Ссылка КАК Регистратор
			|ИЗ
			|	Документ." + ЭлементСписка.Значение + " КАК ХДокумент
			|ГДЕ
			|	ХДокумент.Проведен
			|	И ХДокумент.Дата Между &ДатаНач И &ДатаКон
			|	И &УсловиеПоОрганизации";
			
			ТекстЗапросаПоРегистрам = ЭлементСписка.ЗапросПоРегистрамПроведенныеБезДвижений;
			
		Иначе
			ВызватьИсключение НСтр("ru='Неизвестный вид Выборки: " + ВидВыборки + ".'");
		КонецЕсли;
		
		Если ЭлементСписка.ЕстьРеквизитОрганизация И ЗначениеЗаполнено(ДвОрганизация) Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеПоОрганизации", "ХДокумент.Организация = &Организация");
			Запрос.УстановитьПараметр("Организация", ДвОрганизация);
		Иначе
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеПоОрганизации", "Истина");
		КонецЕсли;
		
		Запрос.УстановитьПараметр("ДатаНач", НачалоДня(ДвДатаНач));
		Запрос.УстановитьПараметр("ДатаКон", КонецДня(ДвДатаКон));
		
		Результат = Запрос.Выполнить();
		
		// Если Таблица пуста - переходим к следующему элементу списка видов документа.
		Если Результат.Пустой() Тогда
			Продолжить;
		КонецЕсли;
		
		СписокДокументов = Результат.Выгрузить().ВыгрузитьКолонку("Регистратор");
		
		// Ищем Непроведенные документы.
		
		Запрос = Новый Запрос;
		Запрос.Текст = ТекстЗапросаПоРегистрам;
		
		Если УчитыватьАктивностьЗаписейРегистров Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеАктивностьЗаписиРегистра", "ХРегистр.Активность");
		Иначе
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеАктивностьЗаписиРегистра", "Истина");
		КонецЕсли;
		
		Запрос.УстановитьПараметр("СписокДокументов", СписокДокументов);
		
		Результат = Запрос.Выполнить();
		
		// Если Таблица пуста - переходим к следующему элементу списка видов документа.
		Если Результат.Пустой() Тогда
			Продолжить;
		КонецЕсли;
		
		ТаблицаРезультата = Результат.Выгрузить();
		
		Для Каждого СтрокаТаблицы ИЗ ТаблицаРезультата Цикл
			НоваяСтрока = ТаблицаДокументыДвиженя.Добавить();
			НоваяСтрока.Нпп = ТаблицаДокументыДвиженя.Количество();
			НоваяСтрока.ПометкаУдаления = СтрокаТаблицы.Регистратор.ПометкаУдаления;
			НоваяСтрока.Регистратор = СтрокаТаблицы.Регистратор;
			НоваяСтрока.ЕстьРеквизитОрганизация = ЭлементСписка.ЕстьРеквизитОрганизация;
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат ТаблицаДокументыДвиженя;
	
КонецФункции

Функция ПровестиПроведенныеБезДвиженийНаСервере(ТаблицаДокументыПроведенныеБезДвижений, Отказ) Экспорт
	Перем мдДокумента, ДокументОбъект, СтрокаТаблицыДокументов;
	Перем КоличествоПроведенных;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ТаблицаДокументыПроведенныеБезДвижений.Количество() = 0 Тогда
		Возврат 0;
	КонецЕсли;
	
	Если ЭтотОбъект.ВыполнятьВТранзакции Тогда
		НачатьТранзакцию();
	КонецЕсли;
	
	КоличествоПроведенных = 0;
	Для Каждого СтрокаТаблицыДокументов ИЗ ТаблицаДокументыПроведенныеБезДвижений Цикл
		
		мдДокумента = СтрокаТаблицыДокументов.Регистратор.Метаданные();
		Если НЕ мдДокумента.Проведение = МетаДанные.СвойстваОбъектов.Проведение.Разрешить Тогда	// Только документы, проведение которых возможно.
			Сообщить("Проведение документа запрещено: " + СтрокаТаблицыДокументов.Регистратор + "
			|Проведение не произведено.");
			Продолжить;
		КонецЕсли;
		
		Попытка
			ДокументОбъект = СтрокаТаблицыДокументов.Регистратор.ПолучитьОбъект();
		Исключение
			Если ЭтотОбъект.ВыполнятьВТранзакции Тогда
				ОтменитьТранзакцию();
			КонецЕсли;
			ВызватьИсключение НСтр("ru='" + ОписаниеОшибки()+ ".'");
		КонецПопытки;
		
		Попытка
			ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
			КоличествоПроведенных = КоличествоПроведенных+1;
		Исключение
			// Например: ЧекККМ, ПересчетТоваров (~ Инвентаризация).
			Отказ = Истина;
			Сообщить(НСтр("ru='" + ОписаниеОшибки()+ ".'"));
			Прервать;
		КонецПопытки;

	КонецЦикла;
	
	Если ЭтотОбъект.ВыполнятьВТранзакции И НЕ Отказ = Истина Тогда
		//ОтменитьТранзакцию();	// .- МА! Для Отладки.
		ЗафиксироватьТранзакцию();
		Возврат КоличествоПроведенных;
	Иначе
		Возврат КоличествоПроведенных;
	КонецЕсли;
	
	Возврат КоличествоПроведенных;
	
КонецФункции

Функция УдалитьДвиженияНепроведенныхСДвижениямиНаСервере(ТаблицаДокументыНеПроведенныеСДвижениями) Экспорт
	Перем мдДокумента, ДокументОбъект, СтрокаТаблицыДокументов;
	Перем КоличествоОчищенных;
	
	Если ТаблицаДокументыНеПроведенныеСДвижениями.Количество() = 0 Тогда
		Возврат 0;
	КонецЕсли;
	
	Если ЭтотОбъект.ВыполнятьВТранзакции Тогда
		НачатьТранзакцию();
	КонецЕсли;
	
	КоличествоОчищенных = 0;
	Для Каждого СтрокаТаблицыДокументов ИЗ ТаблицаДокументыНеПроведенныеСДвижениями Цикл
		
		мдДокумента = СтрокаТаблицыДокументов.Регистратор.Метаданные();
		Если НЕ мдДокумента.Проведение = МетаДанные.СвойстваОбъектов.Проведение.Разрешить Тогда	// Например "Корректировка записей регистров".
			Сообщить("" + СтрокаТаблицыДокументов.Регистратор + "
			|Исключение: Документы типа: " + мдДокумента.Синоним + " - непроводимый документ, который может иметь движения.
			|Движения не удалены.");
			Продолжить;
		КонецЕсли;

		Попытка
			ДокументОбъект = СтрокаТаблицыДокументов.Регистратор.ПолучитьОбъект();
			УдалитьДвиженияУДокумента(ДокументОбъект);
			ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
			КоличествоОчищенных = КоличествоОчищенных+1;
		Исключение
			// Например: ЧекККМ.
	    	Сообщить(НСтр("ru = '"+ОписаниеОшибки()+"'"), СтатусСообщения.Внимание);
		КонецПопытки;

	КонецЦикла;
	
	Если ЭтотОбъект.ВыполнятьВТранзакции Тогда
		//ОтменитьТранзакцию();	// .- МА! Для Отладки.
		ЗафиксироватьТранзакцию();
		Возврат КоличествоОчищенных;
	Иначе
		Возврат КоличествоОчищенных;
	КонецЕсли;
	
	Возврат КоличествоОчищенных;
	
КонецФункции

// Процедура удаления существующих движений документа при перепроведении (отмене проведения)
Процедура УдалитьДвиженияУДокумента(ДокументОбъект)
	Перем ТаблицаДвижений, СтрокаДвижения;
	Перем ПозицияТочки, ТипРегистра, ИмяРегистра, МетаданныеНабора, Набор;
	
	МассивОбрабатываемыхСтрокТаблицыДвижений = Новый Массив();
	
	// получение списка регистров, по которым существуют движения
	ТаблицаДвижений = ОпределитьНаличиеДвиженийПоДокументу(ДокументОбъект.Ссылка);
	ТаблицаДвижений.Колонки.Добавить("НаборЗаписей");
	ТаблицаДвижений.Колонки.Добавить("БезусловноеУдаление", Новый ОписаниеТипов("Булево"));
		
	Для Каждого СтрокаДвижения Из ТаблицаДвижений Цикл
		// имя регистра передается как значение, полученное с помощью
		// функции ПолноеИмя() метаданных регистра
		ПозицияТочки = Найти(СтрокаДвижения.Имя, ".");
		ТипРегистра = Лев(СтрокаДвижения.Имя, ПозицияТочки - 1);
		ИмяРегистра = СокрП(Сред(СтрокаДвижения.Имя, ПозицияТочки + 1));

		МассивОбрабатываемыхСтрокТаблицыДвижений.Добавить(СтрокаДвижения);
		
		Если ТипРегистра = "РегистрНакопления" Тогда
			МетаданныеНабора = Метаданные.РегистрыНакопления[ИмяРегистра];
			Набор = РегистрыНакопления[ИмяРегистра].СоздатьНаборЗаписей();
			
		ИначеЕсли ТипРегистра = "РегистрБухгалтерии" Тогда
			МетаданныеНабора = Метаданные.РегистрыБухгалтерии[ИмяРегистра];
			Набор = РегистрыБухгалтерии[ИмяРегистра].СоздатьНаборЗаписей();
			
		ИначеЕсли ТипРегистра = "РегистрСведений" Тогда
			МетаданныеНабора = Метаданные.РегистрыСведений[ИмяРегистра];
			Набор = РегистрыСведений[ИмяРегистра].СоздатьНаборЗаписей();
			
		ИначеЕсли ТипРегистра = "РегистрРасчета" Тогда
			МетаданныеНабора = Метаданные.РегистрыРасчета[ИмяРегистра];
			Набор = РегистрыРасчета[ИмяРегистра].СоздатьНаборЗаписей();
			
		КонецЕсли;
		
		Если НЕ ПравоДоступа("Изменение", Набор.Метаданные()) Тогда
			// отсутствуют права на всю таблицу регистра
			ВызватьИсключение "Нарушение прав доступа: " + СтрокаДвижения.Имя;
			Возврат;
		КонецЕсли;

		Набор.Отбор.Регистратор.Установить(ДокументОбъект.Ссылка);

		// набор не записывается сразу, чтобы не откатывать транзакцию, если впоследствии
		// выяснится, что на один из регистров не хватает прав.
		СтрокаДвижения.НаборЗаписей = Набор;
		
	КонецЦикла;	
	
	Для Каждого СтрокаДвижения Из МассивОбрабатываемыхСтрокТаблицыДвижений Цикл		
		Попытка
			СтрокаДвижения.НаборЗаписей.Записать();
		Исключение
			// Возможно "сработал" RLS или подсистема даты запрета изменения
			ВызватьИсключение "Операция не выполнена: " + СтрокаДвижения.Имя + Символы.ПС + КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		КонецПопытки;
	КонецЦикла;
	
	ОчисткаКоллекцииДвиженийДокумента(ДокументОбъект);
	
	// Удаление записей регистрации из всех последовательностей.
	УдалитьРегистрациюДокументаВПоследовательностях(ДокументОбъект, Истина);

КонецПроцедуры

Функция ОпределитьНаличиеДвиженийПоДокументу(ДокументСсылка)
	Перем ТекстЗапроса, счетчик_таблиц, МетаданныеДокумента, Движение;
	Перем Запрос, ТаблицаЗапроса, Выборка;
	
	ТекстЗапроса = "";	
	// для исключения падения для документов, проводящимся более чем по 256 таблицам
	счетчик_таблиц = 0;
	
	МетаданныеДокумента = ДокументСсылка.Метаданные();
	
	Если МетаданныеДокумента.Движения.Количество() = 0 Тогда
		Возврат Новый ТаблицаЗначений;
	КонецЕсли;
	
	Для Каждого Движение Из МетаданныеДокумента.Движения Цикл
		// в запросе получаем имена регистров, по которым есть хотя бы одно движение
		// например,
		// ВЫБРАТЬ Первые 1 «РегистрНакопления.ТоварыНаСкладах»
		// ИЗ РегистрНакопления.ТоварыНаСкладах
		// ГДЕ Регистратор = &Регистратор
		
		// имя регистра приводим к Строка(200), см. ниже
		ТекстЗапроса = ТекстЗапроса + "
		|" + ?(ТекстЗапроса = "", "", "ОБЪЕДИНИТЬ ВСЕ ") + "
		|ВЫБРАТЬ ПЕРВЫЕ 1 ВЫРАЗИТЬ(""" + Движение.ПолноеИмя() 
		+  """ КАК Строка(200)) КАК Имя ИЗ " + Движение.ПолноеИмя() 
		+ " ГДЕ Регистратор = &Регистратор";
		
		// если в запрос попадает более 256 таблиц – разбиваем его на две части
		// (вариант документа с проведением по 512 регистрам считаем нежизненным)
		счетчик_таблиц = счетчик_таблиц + 1;
		Если счетчик_таблиц = 256 Тогда
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Регистратор", ДокументСсылка);
	// при выгрузке для колонки «Имя» тип устанавливается по самой длинной строке из запроса
	// при втором проходе по таблице новое имя может не «влезть», по этому сразу в запросе
	// приводится к строка(200)
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();
	
	// если количество таблиц не превысило 256 – возвращаем таблицу
	Если счетчик_таблиц = МетаданныеДокумента.Движения.Количество() Тогда
		Возврат ТаблицаЗапроса;			
	КонецЕсли;
	
	// таблиц больше чем 256, делаем доп. запрос и дополняем строки таблицы.
	
	ТекстЗапроса = "";
	Для Каждого Движение Из МетаданныеДокумента.Движения Цикл
		
		Если счетчик_таблиц > 0 Тогда
			счетчик_таблиц = счетчик_таблиц - 1;
			Продолжить;
		КонецЕсли;
		
		ТекстЗапроса = ТекстЗапроса + "
		|" + ?(ТекстЗапроса = "", "", "ОБЪЕДИНИТЬ ВСЕ ") + "
		|ВЫБРАТЬ ПЕРВЫЕ 1 """ + Движение.ПолноеИмя() +  """ КАК Имя ИЗ " 
		+ Движение.ПолноеИмя() + " ГДЕ Регистратор = &Регистратор";	
		
		
	КонецЦикла;
	Запрос.Текст = ТекстЗапроса;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СтрокаТаблицы = ТаблицаЗапроса.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТаблицы, Выборка);
	КонецЦикла;
	
	Возврат ТаблицаЗапроса;
	
КонецФункции

Процедура УдалитьРегистрациюДокументаВПоследовательностях(ДокументОбъект, ПроверятьДвижения = Ложь)
	Перем ТаблицаРегистраций, КоллекцияПоследовательностей, НаборЗаписейРегистрацииВПоследовательности;
	
	// получение списка последовательностей в которых зарегистрирован документ
	Если ПроверятьДвижения Тогда
		ТаблицаРегистраций = ОпределитьНаличиеРегистрацииДокументаВПоследовательности(ДокументОбъект);
	КонецЕсли;      
	КоллекцияПоследовательностей = ДокументОбъект.ПринадлежностьПоследовательностям;
	Для Каждого НаборЗаписейРегистрацииВПоследовательности Из КоллекцияПоследовательностей Цикл
		Если (НаборЗаписейРегистрацииВПоследовательности.Количество() > 0)
		  ИЛИ (ПроверятьДвижения И (НЕ ТаблицаРегистраций.Найти(НаборЗаписейРегистрацииВПоследовательности.Метаданные().Имя,"Имя") = Неопределено)) Тогда
		   НаборЗаписейРегистрацииВПоследовательности.Очистить();
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция ОпределитьНаличиеРегистрацииДокументаВПоследовательности(ДокументОбъект)
	Перем Запрос, ТекстЗапроса, ТаблицаЗапроса;
	Перем Последовательность;
	
	ТекстЗапроса = "";	
	
	Для Каждого Последовательность Из ДокументОбъект.ПринадлежностьПоследовательностям Цикл
		// в запросе получаем имена последовательностей, в которых документ зарегистрирован
		ТекстЗапроса = ТекстЗапроса + "
		|" + ?(ТекстЗапроса = "", "", "ОБЪЕДИНИТЬ ВСЕ ") + "
		|ВЫБРАТЬ """ + Последовательность.Метаданные().Имя 
		+  """ КАК Имя ИЗ " + Последовательность.Метаданные().ПолноеИмя()  
		+ " ГДЕ Регистратор = &Регистратор";
		
	КонецЦикла;
	
	Если ТекстЗапроса = "" Тогда
		Возврат Новый ТаблицаЗначений();
	Иначе
		Запрос = Новый Запрос(ТекстЗапроса);
		Запрос.УстановитьПараметр("Регистратор", ДокументОбъект.Ссылка);
		ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();	
		Возврат ТаблицаЗапроса;
	КонецЕсли;
	
КонецФункции

// Процедура очищает коллекцию движений документа
//
Процедура ОчисткаКоллекцииДвиженийДокумента(ДокументОбъект)
	Перем Движение;
		
	Для Каждого Движение ИЗ ДокументОбъект.Движения Цикл
		Если Движение.Количество() > 0 Тогда
			Движение.Очистить();
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ВКЛАДКА "ДОПОЛНИТЕЛЬНО". "ДОКУМЕНТ (ДОПОЛНИТЕЛЬНО) УДАЛЕНИЕ".
//

Функция ДокументУдалениеЗаполнитьСписокВидовДокументов(ДокументСписокВидов, Организация) Экспорт
	Перем мдДокумента, НоваяСтрока, ЯвляетсяОснованиемДля;
	
	ДокументСписокВидов.Очистить();
	
	ФильтрПоОрганизации = НЕ Метаданные.Справочники.Найти("Организации") = Неопределено И ЗначениеЗаполнено(Организация);
	
	Для Каждого мдДокумента ИЗ Метаданные.Документы Цикл
		
		НоваяСтрока = ДокументСписокВидов.Добавить();
		НоваяСтрока.Нпп = ДокументСписокВидов.Количество();
		
		НоваяСтрока.ЕстьРеквизитОрганизация = НЕ мдДокумента.Реквизиты.Найти("Организация") = Неопределено;
		НоваяСтрока.ЕстьРеквизитСклад = НЕ мдДокумента.Реквизиты.Найти("Склад") = Неопределено;
		НоваяСтрока.ЕстьРеквизитМагазин = НЕ мдДокумента.Реквизиты.Найти("Магазин") = Неопределено;
		НоваяСтрока.ЕстьРеквизитКасса = НЕ мдДокумента.Реквизиты.Найти("Касса") = Неопределено;
		НоваяСтрока.ЕстьРеквизитКассаККМ = НЕ мдДокумента.Реквизиты.Найти("КассаККМ") = Неопределено;
		
		НоваяСтрока.Пометка = НоваяСтрока.ЕстьРеквизитОрганизация;
		
		ЯвляетсяОснованиемДля = ОбъектБДПолучитьСписокДокументовДляКоторыхОбъектЯвляетсяОснованием(мдДокумента);
		НоваяСтрока.ЯвляетсяОснованиемДля = ЯвляетсяОснованиемДля;
		
		НоваяСтрока.ЕстьСвязанные = ЯвляетсяОснованиемДля.Количество() > 0;
		
		НоваяСтрока.Значение = мдДокумента.Имя;
		НоваяСтрока.Представление = мдДокумента.Представление();
		
	КонецЦикла;	
	ДокументСписокВидов.Сортировать("Представление");
	
	Возврат ДокументСписокВидов;
	
КонецФункции

Функция ДокументУдалениеПолучитьСписокУдаляемыхДокументовНаСервере(ДокументУдалениеТСписокВидов, ТаблицаДокументыУдаление, ДатаНачала, ДатаОкончания, ДокументУдалениеОрганизации, ДокументУдалениеСклады, ДокументУдалениеМагазины, ДокументУдалениеКассы, ДокументУдалениеКассыККМ, ДокументУдалениеПодразделения, ДокументУдалениеПодразделенияОрганизаций, ПоискПоСвязанным, ПоискПоНоменклатуре, ДокументУдалениеГруппаНоменклатуры) Экспорт
	Перем ЭлементСписка, ЕстьРеквизитОрганизация, ЕстьРеквизитСклад, ЕстьРеквизитМагазин, ЕстьРеквизитКасса, ЕстьРеквизитКассаККМ, ЕстьРеквизитПодразделение, ЕстьРеквизитПодразделениеОрганизации;
	Перем Запрос, Результат;
	Перем СтрокаДокументУдаляемый, ИндекcСтрокиОснования, ДокументОснование, ВыборкаСвязанных, СвязанныйДокументСсылка, ДокументПоНоменклатуре, РеквизитыДокумента;
	Перем МассивСсылок, ТаблицаСсылок, СтрокаТЗСсылок, ТаблицаВременная, СтрокаДокументВременный, НоваяСтрока;
	
	ТаблицаДокументыУдаление.Очистить();

	Если ДатаНачала = Дата("00010101") Тогда
		ДатаНачала = Дата("00010101");
	КонецЕсли;
	Если ДатаОкончания = Дата("00010101") Тогда
		ДатаОкончания = ТекущаяДата();
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ДокументУдалениеГруппаНоменклатуры)
		И
		(ЗначениеЗаполнено(ДокументУдалениеОрганизации)
		ИЛИ ЗначениеЗаполнено(ДокументУдалениеСклады)
		ИЛИ ЗначениеЗаполнено(ДокументУдалениеМагазины)
		ИЛИ ЗначениеЗаполнено(ДокументУдалениеКассы)
		ИЛИ ЗначениеЗаполнено(ДокументУдалениеКассыККМ)
		ИЛИ ЗначениеЗаполнено(ДокументУдалениеПодразделения)
		ИЛИ ЗначениеЗаполнено(ДокументУдалениеПодразделенияОрганизаций)) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = "";
		Для Каждого ЭлементСписка ИЗ ДокументУдалениеТСписокВидов Цикл
			
			Если НЕ ЭлементСписка.Пометка Тогда
				Продолжить;
			КонецЕсли;
			
			Если Запрос.Текст = "" Тогда
				Запрос.Текст = "
				|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ"
			Иначе
				Запрос.Текст = Запрос.Текст + "
				|
				|ОБЪЕДИНИТЬ
				|
				|ВЫБРАТЬ РАЗЛИЧНЫЕ";
			КонецЕсли;
			
			Запрос.Текст = Запрос.Текст + "
			|	""Д"" КАК НайденПо,
			|	ХДокумент.Ссылка КАК Ссылка,
			|	ХДокумент.МоментВремени КАК МоментВремени,
			|	&РеквизитОрганизация,
			|	&ЕстьРеквизитОрганизация,
			|	&РеквизитСклад,
			|	&ЕстьРеквизитСклад,
			|	&РеквизитМагазин,
			|	&ЕстьРеквизитМагазин,
			|	&РеквизитКасса,
			|	&ЕстьРеквизитКасса,
			|	&РеквизитКассаККМ,
			|	&ЕстьРеквизитКассаККМ,
			|	&РеквизитПодразделение,
			|	&ЕстьРеквизитПодразделение,
			|	&РеквизитПодразделениеОрганизации,
			|	&ЕстьРеквизитПодразделениеОрганизации,
			|	&Пометка,
			|	&ЕстьСвязанные,
			|	Ложь КАК Удален
			|ИЗ
			|	Документ." + ЭлементСписка.Значение + " КАК ХДокумент
			|ГДЕ
			|	ХДокумент.ПометкаУдаления = ЛОЖЬ
			|	И ХДокумент.Дата Между &ДатаНачала И &ДатаОкончания
			|	И &УсловиеПоОрганизации
			|	И &УсловиеПоСкладу
			|	И &УсловиеПоМагазину
			|	И &УсловиеПоКассе
			|	И &УсловиеПоКассеККМ
			|	И &УсловиеПоПодразделению
			|	И &УсловиеПоПодразделениюОрганизации
			|";
			
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Пометка", "Истина КАК Пометка");
			
			Если ЭлементСписка.ЕстьРеквизитОрганизация И ЗначениеЗаполнено(ДокументУдалениеОрганизации) Тогда
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "&РеквизитОрганизация"		, "ХДокумент.Организация КАК Организация");
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ЕстьРеквизитОрганизация"	, "" + Формат(ЭлементСписка.ЕстьРеквизитОрганизация, "БЛ=Ложь; БИ=Истина") + " КАК ЕстьРеквизитОрганизация");
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеПоОрганизации"	, "ХДокумент.Организация В(&Организация)");
			Иначе
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "&РеквизитОрганизация"		, "Неопределено КАК Организация");
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ЕстьРеквизитОрганизация"	, "" + Формат(ЭлементСписка.ЕстьРеквизитОрганизация, "БЛ=Ложь; БИ=Истина") + " КАК ЕстьРеквизитОрганизация");
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеПоОрганизации"	, "Истина");
			КонецЕсли;
			
			Если ЭлементСписка.ЕстьРеквизитСклад И ЗначениеЗаполнено(ДокументУдалениеСклады) Тогда
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "&РеквизитСклад"			, "ХДокумент.Склад КАК Склад");
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ЕстьРеквизитСклад"		, "" + Формат(ЭлементСписка.ЕстьРеквизитСклад, "БЛ=Ложь; БИ=Истина") + " КАК ЕстьРеквизитСклад");
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеПоСкладу"			, "ХДокумент.Склад В(&Склад)");
			Иначе
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "&РеквизитСклад"			, "Неопределено КАК Склад");
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ЕстьРеквизитСклад"		, "" + Формат(ЭлементСписка.ЕстьРеквизитСклад, "БЛ=Ложь; БИ=Истина") + "  КАК ЕстьРеквизитСклад");
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеПоСкладу"			, "Истина");
			КонецЕсли;
			
			Если ЭлементСписка.ЕстьРеквизитМагазин И ЗначениеЗаполнено(ДокументУдалениеМагазины) Тогда
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "&РеквизитМагазин"			, "ХДокумент.Магазин КАК Магазин");
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ЕстьРеквизитМагазин"		, "" + Формат(ЭлементСписка.ЕстьРеквизитМагазин, "БЛ=Ложь; БИ=Истина") + " КАК ЕстьРеквизитМагазин");
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеПоМагазину"		, "ХДокумент.Магазин В(&Магазин)");
			Иначе
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "&РеквизитМагазин"			, "Неопределено КАК Магазин");
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ЕстьРеквизитМагазин"		, "" + Формат(ЭлементСписка.ЕстьРеквизитМагазин, "БЛ=Ложь; БИ=Истина") + "  КАК ЕстьРеквизитМагазин");
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеПоМагазину"		, "Истина");
			КонецЕсли;
			
			Если ЭлементСписка.ЕстьРеквизитКассаККМ И ЗначениеЗаполнено(ДокументУдалениеКассыККМ) Тогда
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "&РеквизитКассаККМ"		, "ХДокумент.КассаККМ КАК КассаККМ");
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ЕстьРеквизитКассаККМ"	, "" + Формат(ЭлементСписка.ЕстьРеквизитКассаККМ, "БЛ=Ложь; БИ=Истина") + " КАК ЕстьРеквизитКассаККМ");
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеПоКассеККМ"		, "ХДокумент.КассаККМ В(&КассаККМ)");
			Иначе
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "&РеквизитКассаККМ"		, "Неопределено КАК КассаККМ");
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ЕстьРеквизитКассаККМ"	, "" + Формат(ЭлементСписка.ЕстьРеквизитКассаККМ, "БЛ=Ложь; БИ=Истина") + "  КАК ЕстьРеквизитКассаККМ");
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеПоКассеККМ"		, "Истина");
			КонецЕсли;
			
			Если ЭлементСписка.ЕстьРеквизитКасса И ЗначениеЗаполнено(ДокументУдалениеКассы) Тогда
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "&РеквизитКасса"			, "ХДокумент.Касса КАК Касса");
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ЕстьРеквизитКасса"		, "" + Формат(ЭлементСписка.ЕстьРеквизитКасса, "БЛ=Ложь; БИ=Истина") + " КАК ЕстьРеквизитКасса");
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеПоКассе"			, "ХДокумент.Касса В(&Касса)");
			Иначе
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "&РеквизитКасса"			, "Неопределено КАК Касса");
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ЕстьРеквизитКасса"		, "" + Формат(ЭлементСписка.ЕстьРеквизитКасса, "БЛ=Ложь; БИ=Истина") + "  КАК ЕстьРеквизитКасса");
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеПоКассе"			, "Истина");
			КонецЕсли;
			
			Если ЭлементСписка.ЕстьРеквизитПодразделениеОрганизации И ЗначениеЗаполнено(ДокументУдалениеПодразделенияОрганизаций) Тогда
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "&РеквизитПодразделениеОрганизации"		, "ХДокумент.ПодразделениеОрганизации КАК ПодразделениеОрганизации");
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ЕстьРеквизитПодразделениеОрганизации"	, "" + Формат(ЭлементСписка.ЕстьРеквизитПодразделениеОрганизации, "БЛ=Ложь; БИ=Истина") + " КАК ЕстьРеквизитПодразделениеОрганизации");
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеПоПодразделениюОрганизации"		, "ХДокумент.ПодразделениеОрганизации В(&ПодразделениеОрганизации)");
			Иначе
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "&РеквизитПодразделениеОрганизации"		, "Неопределено КАК ПодразделениеОрганизации");
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ЕстьРеквизитПодразделениеОрганизации"	, "" + Формат(ЭлементСписка.ЕстьРеквизитПодразделениеОрганизации, "БЛ=Ложь; БИ=Истина") + "  КАК ЕстьРеквизитПодразделениеОрганизации");
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеПоПодразделениюОрганизации"		, "Истина");
			КонецЕсли;
			
			Если ЭлементСписка.ЕстьРеквизитПодразделение И ЗначениеЗаполнено(ДокументУдалениеПодразделения) Тогда
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "&РеквизитПодразделение"		, "ХДокумент.Подразделение КАК Подразделение");
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ЕстьРеквизитПодразделение"	, "" + Формат(ЭлементСписка.ЕстьРеквизитПодразделение, "БЛ=Ложь; БИ=Истина") + " КАК ЕстьРеквизитПодразделение");
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеПоПодразделению"		, "ХДокумент.Подразделение В(&Подразделение)");
			Иначе
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "&РеквизитПодразделение"		, "Неопределено КАК Подразделение");
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ЕстьРеквизитПодразделение"	, "" + Формат(ЭлементСписка.ЕстьРеквизитПодразделение, "БЛ=Ложь; БИ=Истина") + "  КАК ЕстьРеквизитПодразделение");
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеПоПодразделению"		, "Истина");
			КонецЕсли;
			
			Если ЭлементСписка.ЕстьСвязанные Тогда
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ЕстьСвязанные"			, "Истина КАК ЕстьСвязанные");
			Иначе
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ЕстьСвязанные"			, "Ложь КАК ЕстьСвязанные");
			КонецЕсли;
			
		КонецЦикла;
		
		Запрос.Текст = Запрос.Текст + "
		|
		|УПОРЯДОЧИТЬ ПО
		|	ХДокумент.МоментВремени УБЫВ";
		
		Запрос.УстановитьПараметр("ДатаНачала"	 			, НачалоДня(ДатаНачала));
		Запрос.УстановитьПараметр("ДатаОкончания"			, КонецДня(ДатаОкончания));
		
		Запрос.УстановитьПараметр("Организация"				, ДокументУдалениеОрганизации);
		Запрос.УстановитьПараметр("Склад"					, ДокументУдалениеСклады);
		Запрос.УстановитьПараметр("Магазин"					, ДокументУдалениеМагазины);
		
		Запрос.УстановитьПараметр("Касса"					, ДокументУдалениеКассы);
		Запрос.УстановитьПараметр("КассаККМ"				, ДокументУдалениеКассыККМ);
		
		Запрос.УстановитьПараметр("Подразделение"			, ДокументУдалениеПодразделения);
		Запрос.УстановитьПараметр("ПодразделениеОрганизации", ДокументУдалениеПодразделенияОрганизаций);
		
		Результат = Запрос.Выполнить();
		
		Если НЕ Результат.Пустой() Тогда
			
			ТаблицаВременная = Результат.Выгрузить();
			Для Каждого СтрокаДокументВременный ИЗ ТаблицаВременная Цикл
				ЗаполнитьЗначенияСвойств(ТаблицаДокументыУдаление.Добавить(), СтрокаДокументВременный);
			КонецЦикла;
			
			Если ПоискПоСвязанным Тогда
				Для Каждого СтрокаДокументВременный ИЗ ТаблицаВременная Цикл
					Если НЕ СтрокаДокументВременный.ЕстьСвязанные Тогда
						Продолжить;
					КонецЕсли;
					ДокументОснование = СтрокаДокументВременный.Ссылка;
					ВыборкаСвязанных = ОбъектБДПолучитьСписокДокументовПоКритериюОтбора(ДокументОснование, "Выборка", Истина);
					Пока ВыборкаСвязанных.Следующий() Цикл
						СвязанныйДокументСсылка = ВыборкаСвязанных.Ссылка;
						РеквизитыДокумента = СвязанныйДокументСсылка.Метаданные().Реквизиты;
						// ОРГАНИЗАЦИЯ.
						ЕстьРеквизитОрганизация = НЕ РеквизитыДокумента.Найти("Организация") = Неопределено;
						Если ЕстьРеквизитОрганизация И ЗначениеЗаполнено(ДокументУдалениеОрганизации) И ДокументУдалениеОрганизации.НайтиПоЗначению(СвязанныйДокументСсылка.Организация) = Неопределено Тогда	// Если реквизит "Организация" не совпадает со значение отбора.
							Если ЭтотОбъект.ПоказыватьСообщения Тогда
								Сообщить("Связанный документ: " + СвязанныйДокументСсылка + "
								|различаются организации (искомая/по документу): 
								|" + ДокументУдалениеОрганизации + " и " + СвязанныйДокументСсылка.Организация + "
								|Связанный документ игнорируется.");
							КонецЕсли;
							Продолжить;
						КонецЕсли;
						// СКЛАД.
						ЕстьРеквизитСклад = НЕ РеквизитыДокумента.Найти("Склад") = Неопределено;
						Если ЕстьРеквизитСклад И ЗначениеЗаполнено(ДокументУдалениеСклады) И ДокументУдалениеСклады.НайтиПоЗначению(СвязанныйДокументСсылка.Склад) = Неопределено Тогда	// Если реквизит "Склад" не совпадает со значение отбора.
							Если ЭтотОбъект.ПоказыватьСообщения Тогда
								Сообщить("Связанный документ: " + СвязанныйДокументСсылка + "
								|различаются склады (искомый/по документу): 
								|" + ДокументУдалениеСклады + " и " + СвязанныйДокументСсылка.Склад + "
								|Связанный документ игнорируется.");
							КонецЕсли;
							Продолжить;
						КонецЕсли;
						// МАГАЗИН.
						ЕстьРеквизитМагазин = НЕ РеквизитыДокумента.Найти("Магазин") = Неопределено;
						Если ЕстьРеквизитМагазин И ЗначениеЗаполнено(ДокументУдалениеМагазины) И ДокументУдалениеМагазины.НайтиПоЗначению(СвязанныйДокументСсылка.Магазин) = Неопределено Тогда	// Если реквизит "Магазин" не совпадает со значение отбора.
							Если ЭтотОбъект.ПоказыватьСообщения Тогда
								Сообщить("Связанный документ: " + СвязанныйДокументСсылка + "
								|различаются магазины (искомый/по документу): 
								|" + ДокументУдалениеМагазины + " и " + СвязанныйДокументСсылка.Магазин + "
								|Связанный документ игнорируется.");
							КонецЕсли;
							Продолжить;
						КонецЕсли;
						// КАССА ОПЕРАЦИОННАЯ.
						ЕстьРеквизитКасса = НЕ РеквизитыДокумента.Найти("Касса") = Неопределено;
						Если ЕстьРеквизитКасса И ЗначениеЗаполнено(ДокументУдалениеКассы) И ДокументУдалениеКассы.НайтиПоЗначению(СвязанныйДокументСсылка.Касса) = Неопределено Тогда	// Если реквизит "Касса" не совпадает со значение отбора.
							Если ЭтотОбъект.ПоказыватьСообщения Тогда
								Сообщить("Связанный документ: " + СвязанныйДокументСсылка + "
								|различаются кассы (искомый/по документу): 
								|" + ДокументУдалениеКассы + " и " + СвязанныйДокументСсылка.Касса + "
								|Связанный документ игнорируется.");
							КонецЕсли;
							Продолжить;
						КонецЕсли;
						// КАССА ККМ.
						ЕстьРеквизитКассаККМ = НЕ РеквизитыДокумента.Найти("КассаККМ") = Неопределено;
						Если ЕстьРеквизитКассаККМ И ЗначениеЗаполнено(ДокументУдалениеКассыККМ) И ДокументУдалениеКассыККМ.НайтиПоЗначению(СвязанныйДокументСсылка.КассаККМ) = Неопределено Тогда	// Если реквизит "КассаККМ" не совпадает со значение отбора.
							Если ЭтотОбъект.ПоказыватьСообщения Тогда
								Сообщить("Связанный документ: " + СвязанныйДокументСсылка + "
								|различаются кассы ккм (искомый/по документу): 
								|" + ДокументУдалениеКассыККМ + " и " + СвязанныйДокументСсылка.КассаККМ + "
								|Связанный документ игнорируется.");
							КонецЕсли;
							Продолжить;
						КонецЕсли;
						// ПОДРАЗДЕЛЕНИЕ.
						ЕстьРеквизитПодразделение = НЕ РеквизитыДокумента.Найти("Подразделение") = Неопределено;
						Если ЕстьРеквизитПодразделение И ЗначениеЗаполнено(ДокументУдалениеПодразделения) И ДокументУдалениеПодразделения.НайтиПоЗначению(СвязанныйДокументСсылка.Подразделение) = Неопределено Тогда	// Если реквизит "Подразделение" не совпадает со значение отбора.
							Если ЭтотОбъект.ПоказыватьСообщения Тогда
								Сообщить("Связанный документ: " + СвязанныйДокументСсылка + "
								|различаются подразделения (искомый/по документу): 
								|" + ДокументУдалениеПодразделения + " и " + СвязанныйДокументСсылка.Подразделение + "
								|Связанный документ игнорируется.");
							КонецЕсли;
							Продолжить;
						КонецЕсли;
						// ПОДРАЗДЕЛЕНИЕ ОРГАНИЗАЦИИ.
						ЕстьРеквизитПодразделениеОрганизации = НЕ РеквизитыДокумента.Найти("ПодразделениеОрганизации") = Неопределено;
						Если ЕстьРеквизитПодразделениеОрганизации И ЗначениеЗаполнено(ДокументУдалениеПодразделенияОрганизаций) И ДокументУдалениеПодразделенияОрганизаций.НайтиПоЗначению(СвязанныйДокументСсылка.ПодразделениеОрганизации) = Неопределено Тогда	// Если реквизит "ПодразделениеОрганизации" не совпадает со значение отбора.
							Если ЭтотОбъект.ПоказыватьСообщения Тогда
								Сообщить("Связанный документ: " + СвязанныйДокументСсылка + "
								|различаются подразделения организации (искомый/по документу): 
								|" + ДокументУдалениеПодразделенияОрганизаций + " и " + СвязанныйДокументСсылка.ПодразделениеОрганизации + "
								|Связанный документ игнорируется.");
							КонецЕсли;
							Продолжить;
						КонецЕсли;
						Если НЕ ТаблицаДокументыУдаление.Найти(СвязанныйДокументСсылка, "Ссылка") = Неопределено Тогда
							Продолжить;
						КонецЕсли;
						СтрокаДокументУдаляемый = ТаблицаДокументыУдаление.Найти(ДокументОснование, "Ссылка");
						Если СтрокаДокументУдаляемый = Неопределено Тогда
							НоваяСтрока = ТаблицаДокументыУдаление.Вставить(0);
						Иначе
							ИндекcСтрокиОснования = ТаблицаДокументыУдаление.Индекс(СтрокаДокументУдаляемый);
							НоваяСтрока = ТаблицаДокументыУдаление.Вставить(ИндекcСтрокиОснования);
						КонецЕсли;
						НоваяСтрока.НайденПо = "Д";	// Документам.
						НоваяСтрока.Ссылка = СвязанныйДокументСсылка;
						НоваяСтрока.ЕстьРеквизитОрганизация 			= ЕстьРеквизитОрганизация;
						НоваяСтрока.ЕстьРеквизитСклад					= ЕстьРеквизитСклад;
						НоваяСтрока.ЕстьРеквизитМагазин					= ЕстьРеквизитМагазин;
						НоваяСтрока.ЕстьРеквизитКасса					= ЕстьРеквизитКасса;
						НоваяСтрока.ЕстьРеквизитКассаККМ				= ЕстьРеквизитКассаККМ;
						НоваяСтрока.ЕстьРеквизитПодразделение			= ЕстьРеквизитПодразделение;
						НоваяСтрока.ЕстьРеквизитПодразделениеОрганизации= ЕстьРеквизитПодразделениеОрганизации;
						НоваяСтрока.Пометка = Истина;
					КонецЦикла;
				КонецЦикла;
			КонецЕсли;
			ТаблицаВременная = Неопределено;
			
		КонецЕсли;
		
	КонецЕсли;
	
	// При поиске документов по номенклатуре игнорируется содержимое таблицы типов документов.
	// Учитываются все типы документов.
	Если ПоискПоНоменклатуре И ЗначениеЗаполнено(ДокументУдалениеГруппаНоменклатуры) Тогда
		
		МассивСсылок = ДокументУдалениеПолучитьМассивУдаляемойНоменклатуры(ДокументУдалениеГруппаНоменклатуры);
		
		Если МассивСсылок.Количество() > 0 Тогда
			
			ТаблицаСсылок = НайтиПоСсылкам(МассивСсылок);
			ТаблицаСсылок.Свернуть("Метаданные, Данные");
			ТаблицаСсылок.Сортировать("Данные Убыв");
			
			Для Каждого СтрокаТЗСсылок ИЗ ТаблицаСсылок Цикл
				Если НЕ Метаданные.Документы.Содержит(СтрокаТЗСсылок.Метаданные) Тогда	// Если не документ.
					Продолжить;
				КонецЕсли;
				ДокументПоНоменклатуре = СтрокаТЗСсылок.Данные;
				Если ДокументПоНоменклатуре.Дата < НачалоДня(ДатаНачала) ИЛИ ДокументПоНоменклатуре.Дата > КонецДня(ДатаОкончания) Тогда	// Если дата документа не соответствует периоду отбора.
					Продолжить;
				КонецЕсли;
				Если ДокументПоНоменклатуре.ПометкаУдаления Тогда
					Продолжить;
				КонецЕсли;
				РеквизитыДокумента = СтрокаТЗСсылок.Метаданные.Реквизиты;
				// ОРГАНИЗАЦИЯ.
				ЕстьРеквизитОрганизация = НЕ РеквизитыДокумента.Найти("Организация") = Неопределено;
				Если ЕстьРеквизитОрганизация И ЗначениеЗаполнено(ДокументУдалениеОрганизации) И ДокументУдалениеОрганизации.НайтиПоЗначению(ДокументПоНоменклатуре.Организация) = Неопределено Тогда	// Если реквизит "Организация" не совпадает со значение отбора.
					Если ЭтотОбъект.ПоказыватьСообщения Тогда
						Сообщить("Документ: " + ДокументПоНоменклатуре + "
						|различаются организации (искомая/по документу): 
						|" + ДокументУдалениеОрганизации + " и " + ДокументПоНоменклатуре.Организация + "
						|Документ игнорируется.");
					КонецЕсли;
					Продолжить;
				КонецЕсли;
				// СКЛАД.
				ЕстьРеквизитСклад = НЕ РеквизитыДокумента.Найти("Склад") = Неопределено;
				Если ЕстьРеквизитСклад И ЗначениеЗаполнено(ДокументУдалениеСклады) И ДокументУдалениеСклады.НайтиПоЗначению(ДокументПоНоменклатуре.Склад) = Неопределено Тогда	// Если реквизит "Склад" не совпадает со значение отбора.
					Если ЭтотОбъект.ПоказыватьСообщения Тогда
						Сообщить("Документ: " + ДокументПоНоменклатуре + "
						|различаются склады (искомый/по документу): 
						|" + ДокументУдалениеСклады + " и " + ДокументПоНоменклатуре.Склад + "
						|Документ игнорируется.");
					КонецЕсли;
					Продолжить;
				КонецЕсли;
				// МАГАЗИН.
				ЕстьРеквизитМагазин = НЕ РеквизитыДокумента.Найти("Магазин") = Неопределено;
				Если ЕстьРеквизитМагазин И ЗначениеЗаполнено(ДокументУдалениеМагазины) И ДокументУдалениеМагазины.НайтиПоЗначению(ДокументПоНоменклатуре.Магазин) = Неопределено Тогда	// Если реквизит "Магазин" не совпадает со значение отбора.
					Если ЭтотОбъект.ПоказыватьСообщения Тогда
						Сообщить("Документ: " + ДокументПоНоменклатуре + "
						|различаются магазины (искомый/по документу): 
						|" + ДокументУдалениеМагазины + " и " + ДокументПоНоменклатуре.Магазин + "
						|Документ игнорируется.");
					КонецЕсли;
					Продолжить;
				КонецЕсли;
				// КАССА ОПЕРАЦИОННАЯ.
				ЕстьРеквизитКасса = НЕ РеквизитыДокумента.Найти("Касса") = Неопределено;
				Если ЕстьРеквизитКасса И ЗначениеЗаполнено(ДокументУдалениеКассы) И ДокументУдалениеКассы.НайтиПоЗначению(ДокументПоНоменклатуре.Касса) = Неопределено Тогда	// Если реквизит "Касса" не совпадает со значение отбора.
					Если ЭтотОбъект.ПоказыватьСообщения Тогда
						Сообщить("Документ: " + ДокументПоНоменклатуре + "
						|различаются кассы (искомый/по документу): 
						|" + ДокументУдалениеКассы + " и " + ДокументПоНоменклатуре.Касса + "
						|Документ игнорируется.");
					КонецЕсли;
					Продолжить;
				КонецЕсли;
				// КАССА ККМ.
				ЕстьРеквизитКассаККМ = НЕ РеквизитыДокумента.Найти("КассаККМ") = Неопределено;
				Если ЕстьРеквизитКассаККМ И ЗначениеЗаполнено(ДокументУдалениеКассыККМ) И ДокументУдалениеКассыККМ.НайтиПоЗначению(ДокументПоНоменклатуре.КассаККМ) = Неопределено Тогда	// Если реквизит "КассаККМ" не совпадает со значение отбора.
					Если ЭтотОбъект.ПоказыватьСообщения Тогда
						Сообщить("Документ: " + ДокументПоНоменклатуре + "
						|различаются кассы ккм (искомый/по документу): 
						|" + ДокументУдалениеКассыККМ + " и " + ДокументПоНоменклатуре.КассаККМ + "
						|Документ игнорируется.");
					КонецЕсли;
					Продолжить;
				КонецЕсли;
				// ПОДРАЗДЕЛЕНИЕ.
				ЕстьРеквизитПодразделение = НЕ РеквизитыДокумента.Найти("Подразделение") = Неопределено;
				Если ЕстьРеквизитПодразделение И ЗначениеЗаполнено(ДокументУдалениеПодразделения) И ДокументУдалениеПодразделения.НайтиПоЗначению(ДокументПоНоменклатуре.Подразделение) = Неопределено Тогда	// Если реквизит "Подразделение" не совпадает со значение отбора.
					Если ЭтотОбъект.ПоказыватьСообщения Тогда
						Сообщить("Связанный документ: " + ДокументПоНоменклатуре + "
						|различаются подразделения (искомый/по документу): 
						|" + ДокументУдалениеПодразделения + " и " + ДокументПоНоменклатуре.Подразделение + "
						|Документ игнорируется.");
					КонецЕсли;
					Продолжить;
				КонецЕсли;
				// ПОДРАЗДЕЛЕНИЕ ОРГАНИЗАЦИИ.
				ЕстьРеквизитПодразделениеОрганизации = НЕ РеквизитыДокумента.Найти("ПодразделениеОрганизации") = Неопределено;
				Если ЕстьРеквизитПодразделениеОрганизации И ЗначениеЗаполнено(ДокументУдалениеПодразделенияОрганизаций) И ДокументУдалениеПодразделенияОрганизаций.НайтиПоЗначению(ДокументПоНоменклатуре.ПодразделениеОрганизации) = Неопределено Тогда	// Если реквизит "ПодразделениеОрганизации" не совпадает со значение отбора.
					Если ЭтотОбъект.ПоказыватьСообщения Тогда
						Сообщить("Связанный документ: " + ДокументПоНоменклатуре + "
						|различаются подразделения организации (искомый/по документу): 
						|" + ДокументУдалениеПодразделенияОрганизаций + " и " + ДокументПоНоменклатуре.ПодразделениеОрганизации + "
						|Документ игнорируется.");
					КонецЕсли;
					Продолжить;
				КонецЕсли;
				Если НЕ ТаблицаДокументыУдаление.Найти(ДокументПоНоменклатуре, "Ссылка") = Неопределено Тогда	// Если уже есть в списке.
					Продолжить;
				КонецЕсли;
				НоваяСтрока = ТаблицаДокументыУдаление.Добавить();
				НоваяСтрока.НайденПо = "Н"; // Номенклатуре.
				НоваяСтрока.Ссылка = ДокументПоНоменклатуре;
				НоваяСтрока.ЕстьРеквизитОрганизация 			= ЕстьРеквизитОрганизация;
				НоваяСтрока.ЕстьРеквизитСклад					= ЕстьРеквизитСклад;
				НоваяСтрока.ЕстьРеквизитМагазин					= ЕстьРеквизитМагазин;
				НоваяСтрока.ЕстьРеквизитКасса					= ЕстьРеквизитКасса;
				НоваяСтрока.ЕстьРеквизитКассаККМ				= ЕстьРеквизитКассаККМ;
				НоваяСтрока.ЕстьРеквизитПодразделение			= ЕстьРеквизитПодразделение;
				НоваяСтрока.ЕстьРеквизитПодразделениеОрганизации= ЕстьРеквизитПодразделениеОрганизации;
				НоваяСтрока.Пометка = Истина;
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ТаблицаДокументыУдаление;
	
КонецФункции

Функция ДокументУдалениеПолучитьМассивУдаляемойНоменклатуры(ДокументУдалениеГруппаНоменклатуры)
	Перем Запрос, Результат, МассивСсылок;
	
	МассивСсылок = Новый Массив;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Номенклатура.Ссылка
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Родитель В ИЕРАРХИИ(&Родитель)
	|	И НЕ Номенклатура.ЭтоГруппа";
	
	Запрос.УстановитьПараметр("Родитель", ДокументУдалениеГруппаНоменклатуры);
	
	Результат = Запрос.Выполнить();
	Если НЕ Результат.Пустой() Тогда
		МассивСсылок = Результат.Выгрузить().ВыгрузитьКолонку("Ссылка");
	КонецЕсли;
	
	Возврат МассивСсылок;
	
КонецФункции

Функция ДокументУдалениеПроизвестиУдалениеДокументовНаСервере(ПометкаУдаление, ТаблицаДокументыУдаление, ВремяОжиданияСнятияБлокировки, КоличествоУдаленныхДокументов, УдалитьНоменклатуру, ГруппаНоменклатуры) Экспорт
	Перем СтрокаТаблицы;
	Перем мдДокумента, ДокументСсылка, ДокументОбъект, ПроведениеРазрешено;
	Перем МассивСсылок, НоменклатураСсылка, НоменклатураОбъект;
	
	УстановитьПривилегированныйРежим(Истина);
	
	КоличествоУдаленныхДокументов = 0;
	
	Для Каждого СтрокаТаблицы ИЗ ТаблицаДокументыУдаление Цикл
		
		Если НЕ СтрокаТаблицы.Пометка Тогда
			Продолжить;
		КонецЕсли;
		
		ДокументСсылка = СтрокаТаблицы.Ссылка;
		
		Если ДокументСсылка.ПометкаУдаления Тогда
			Продолжить;
		КонецЕсли;
		
		Попытка
			ДокументОбъект = ДокументСсылка.ПолучитьОбъект();
		Исключение
			Сообщить("Невозможно получить объект: " + ДокументСсылка);
			Продолжить;
		КонецПопытки;
		
		// Проверка блокировки документа другим пользователем.
		Если НЕ МонопольныйРежим() Тогда
			Попытка
    			ДокументОбъект.Заблокировать();
			Исключение
				ЗадержкаВВыполненииДействия(ВремяОжиданияСнятияБлокировки);
				Если ДокументОбъект.Заблокирован() Тогда
					СообщениеОБлокировкеДругимПользователем = ОписаниеОшибки();
					ПозицияХ = Найти(ВРег(СообщениеОБлокировкеДругимПользователем), "КОМПЬЮТЕР");
					Сообщить("Не удален: " + ДокументОбъект + ", 
					|т.к. блокирован" + ?(ПозицияХ > 0, ": " + Сред(СообщениеОБлокировкеДругимПользователем, ПозицияХ), ".") + "
					|Документ необходимо удалить вручную.");
					Продолжить;
				Иначе
					// Заблокирован().
					// Примечание:
					// Следует учитывать, что этот метод используется для проверки блокировки объекта базы данных конкретным объектом встроенного языка. 
					// Он не может быть использован, чтобы проверить, заблокирован ли вообще объект базы данных. 
					Попытка
						ДокументОбъект.Заблокировать();
					Исключение
						СообщениеОБлокировкеДругимПользователем = ОписаниеОшибки();
						ПозицияХ = Найти(ВРег(СообщениеОБлокировкеДругимПользователем), "КОМПЬЮТЕР");
						Сообщить("Не удален: " + ДокументОбъект + ", 
						|т.к. блокирован" + ?(ПозицияХ > 0, ": " + Сред(СообщениеОБлокировкеДругимПользователем, ПозицияХ), ".") + "
						|Документ необходимо удалить вручную.");
						Продолжить;
					КонецПопытки;
				КонецЕсли;
			КонецПопытки;
		КонецЕсли;
		
		ПроведениеРазрешено = МетаданныеПроведениеДокументаРазрешено(ДокументСсылка);
		
		// Отмена проведения документа / Удаление движений документа.
		Если ПроведениеРазрешено Тогда
			Попытка
				Если ДокументОбъект.Проведен Тогда
					ДокументОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
				КонецЕсли;
			Исключение
				
				Если РазрешитьУстановкуЗначенияОбменДаннымиЗагрузкаИстина(ДокументОбъект) Тогда
					ДокументОбъект.ОбменДанными.Загрузка = Истина;	// Не все объекты имеют свойство "ОбменДанными".
				КонецЕсли;
				
				Попытка
					ДокументОбъект.Проведен = Ложь;
					УдалитьДвиженияУДокумента(ДокументОбъект);		// УДАЛЕНИЕ движений документа.
					ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
				Исключение
					Сообщить("Не удалось удалить движения документа: " + ДокументСсылка);
				КонецПопытки;
			КонецПопытки;
		Иначе
			
			Если РазрешитьУстановкуЗначенияОбменДаннымиЗагрузкаИстина(ДокументОбъект) Тогда
				ДокументОбъект.ОбменДанными.Загрузка = Истина;		// Не все объекты имеют свойство "ОбменДанными".
			КонецЕсли;
			
			Попытка
				ДокументОбъект.Проведен = Ложь;
				УдалитьДвиженияУДокумента(ДокументОбъект);			// УДАЛЕНИЕ движений документа.
				ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
			Исключение
				Сообщить("Не удалось удалить движения документа: " + ДокументСсылка);
			КонецПопытки;
		КонецЕсли;
		
		// Пометка на удаление документа / Удаление документа.
		Попытка
			Если ПометкаУдаление = "ПометкаНаУдаление" Тогда
				
				Если РазрешитьУстановкуЗначенияОбменДаннымиЗагрузкаИстина(ДокументОбъект) Тогда
					ДокументОбъект.ОбменДанными.Загрузка = Истина;		// Не все объекты имеют свойство "ОбменДанными".
				КонецЕсли;
				
				ДокументОбъект.ПометкаУдаления = Истина;
				ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
				Если ДокументОбъект.Заблокирован() Тогда
					ДокументОбъект.Разблокировать();
				КонецЕсли;
			Иначе
				ДокументОбъект.Удалить();
			КонецЕсли;
			
			СтрокаТаблицы.Удален = Истина;
			КоличествоУдаленныхДокументов = КоличествоУдаленныхДокументов + 1;
		Исключение
			Сообщить("Не удалось удалить документ: " + ДокументСсылка);
		КонецПопытки;
		
	КонецЦикла;
	
	// Пометка на удаление номенклатуры / Удаление номенклатуры.
	Если УдалитьНоменклатуру И ЗначениеЗаполнено(ГруппаНоменклатуры) Тогда
		МассивСсылок = ДокументУдалениеПолучитьМассивУдаляемойНоменклатуры(ГруппаНоменклатуры);
		Если МассивСсылок.Количество() > 0  Тогда
			Для Каждого НоменклатураСсылка ИЗ МассивСсылок Цикл
				
				Если НоменклатураСсылка.Предопределенный ИЛИ НоменклатураСсылка.ПометкаУдаления Тогда
					Продолжить;
				КонецЕсли;
				
				НоменклатураОбъект = НоменклатураСсылка.ПолучитьОбъект();
				
				Если ПометкаУдаление = "ПометкаНаУдаление" Тогда
					
					Если РазрешитьУстановкуЗначенияОбменДаннымиЗагрузкаИстина(НоменклатураОбъект) Тогда
						НоменклатураОбъект.ОбменДанными.Загрузка = Истина;	// Не все объекты имеют свойство "ОбменДанными".
					КонецЕсли;
					
					НоменклатураОбъект.ПометкаУдаления = Истина;
					НоменклатураОбъект.Записать();
				Иначе
					НоменклатураОбъект.Удалить();
				КонецЕсли;
				
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	Возврат ТаблицаДокументыУдаление;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ИНФОРМАЦИОННАЯ БАЗА И ПОЛЬЗОВАТЕЛИ.

// Функция возвращает Имя: Компьютера, Пользователя, Домена.
//
Функция DomainComputerUser(ЗапросДанныхAD = Истина) Экспорт
	Перем Network, LDAPRootDSE, DomainDEFAUL, DomainLDAP, DomainDNS;
	Перем DomainComputerUser;
	
	DomainComputerUser = Новый Структура("Domain,DomainLDAP,DomainDNS,Computer,User");
	
	// Домен/Компьютер/Пользователь.
	Попытка
		Network = Новый COMobject("Wscript.Network");
		DomainComputerUser.Domain		= Network.UserDomain;
		DomainComputerUser.Computer 	= Network.ComputerName;
		DomainComputerUser.User 		= Network.UserName;
	Исключение
		Network = Неопределено;
		DomainComputerUser.Domain		= "";
		DomainComputerUser.DomainLDAP	= "";
		DomainComputerUser.DomainDNS	= "";
		DomainComputerUser.Computer 	= "";
		DomainComputerUser.User 		= "";
		Сообщить("Не удалось определить имя домена/компьютера/пользователя.");
	КонецПопытки;
	
	// Полное имя домена (медленно при отсутствии домена).
	Если ЗапросДанныхAD Тогда
		Попытка 
			// LDAP (англ. Lightweight Directory Access Protocol — облегчённый протокол доступа к каталогам).
			LDAPRootDSE = ПолучитьCOMОбъект("LDAP://RootDSE");
			//DomainDEFAULT = LDAPRootDSE.Get("defaultNamingContext");
			DomainLDAP = LDAPRootDSE.Get("rootDomainNamingContext");
			DomainComputerUser.DomainLDAP 	= СокрЛП(DomainLDAP);
			DomainComputerUser.DomainDNS 	= СокрЛП(GetDomainDNS(DomainLDAP));
		Исключение
			LDAPRootDSE = Неопределено;
			DomainComputerUser.DomainLDAP	= "";
			DomainComputerUser.DomainDNS	= "";
			//Сообщить("Не удалось определить полное имя домена.");
		КонецПопытки;
	КонецЕсли;
	
	Network = Неопределено;
	LDAPRootDSE = Неопределено;
	
	Возврат DomainComputerUser;
	
КонецФункции

// Получение DNS-имени домена из его представления в Active Directory.
// Параметры:
// 	DomainLDAP - Строка вида "DC=SAMPLE,DC=LAN".
// Возвращает строку вида "SAMPLE.LAN".
//
Функция GetDomainDNS(Знач DomainLDAP)
	Перем МассивПодстрок, ЭлементМ;
	Перем DomainDNS;
	
	МассивПодстрок = РазложитьСтрокуВМассивПодстрок(DomainLDAP, ",");
	
	DomainDNS = "";
	Для Каждого ЭлементМ ИЗ МассивПодстрок Цикл
		DomainDNS = DomainDNS + СтрЗаменить(СокрЛП(ЭлементМ), "DC=", ".");	// DC - Domain Component – компонент доменного имени.
	КонецЦикла;
	DomainDNS = Сред(DomainDNS, 2);
	
	Возврат DomainDNS;
	
КонецФункции

Функция ПолучитьПользователейWindows(Computer = ".") Экспорт
	Возврат Computer_UserList(Computer);
КонецФункции

// Функция, позволяющая получить список учётных записей на локальном/удаленном компьютере.
// Параметры:
//	Computer - Имя компьютера.
// Возвращаемое значение:
//	Список значений.
//
// Рекомендация:
// Перед применением проверить на компьютерах
// Windows Management Instrumentation (WMI):
// 1. Состояние служб.
// 2. Разрешение в брандмауэре.
//
Функция Computer_UserList(Computer = ".") Экспорт
	Перем WinMGMT;
    Перем Win32_UserAccount, UserAccount, UserAccountInfo;
	Перем Win32_UserAccountInfo;
	
	Win32_UserAccountInfo = Новый СписокЗначений;
	
	Попытка
		WinMGMT = ПолучитьCOMОбъект("winmgmts:\\" + Computer + "\root\cimv2");
		//Win32_UserAccount = WinMGMT.ExecQuery("SELECT * FROM Win32_UserAccount Where LocalAccount = True");	// Загрузка процессора 75%.
		Win32_UserAccount = WinMGMT.ExecQuery("SELECT * FROM Win32_UserAccount");
	Исключение
		Возврат Win32_UserAccountInfo;
	КонецПопытки;
	
	Для Каждого UserAccount ИЗ Win32_UserAccount Цикл
		UserAccountInfo = Win32_UserAccountInfo.Добавить(ПолучитьЗначениеВПопытке(UserAccount, "Name"), ПолучитьЗначениеВПопытке(UserAccount, "FullName"));
	КонецЦикла;
	
	Возврат Win32_UserAccountInfo;
	
КонецФункции

Функция ПолучитьПользователейActiveDirectory(DomainLDAP) Экспорт
	Возврат ActiveDirectory_UserList(DomainLDAP);
КонецФункции

// Функция, позволяющая получить список учётных записей домена.
// Параметры:
//	Domain - Полное имя домена вида "DC=SAMPLE,DC=LAN".
// Возвращаемое значение:
//	Список значений.
//
Функция ActiveDirectory_UserList(DomainLDAP) Экспорт
	Перем ADODB, ADODBRS;
	Перем ADsPath, MemberOF, Name, DisplayName, AccountName;
	Перем DomainDNS1, DomainLDAP2, DomainDNS2;
	Перем СписокПользователейAD, НовыйЭлемент;

	СписокПользователейAD = Новый СписокЗначений;

	Если НЕ ЗначениеЗаполнено(DomainLDAP) Тогда
		Возврат СписокПользователейAD;
	КонецЕсли;
	
	Попытка 
		ADODB = Новый COMОбъект("ADODB.Connection");
		ADODB.Provider = "ADSDSOObject";
		ADODB.Open("ADS Provider");
		
		////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
		// LDAP (англ. Lightweight Directory Access Protocol — облегчённый протокол доступа к каталогам).
		//
		// Параметры запроса: Базовое отличительное имя LDAP; Фильтр LDAP; Атрибуты; Область; Соединение ADO.
		//
		// Базовое отличительное имя LDAP (Объект-контейнер AD)		: Строка вида "<LDAP://DC=SAMPLE,DC=LAN".
		// Фильтр LDAP (здесь: Пользователи)						: Строка "(&(objectCategory=person)(objectClass=user))".
		// Атрибуты	(значения, возвращаемые при выполнении запроса)	: Строка с перечислением "ADsPath,MemberOF,Name,DisplayName,SAMAccountName".
		// - ADsPath (отличительное имя объекта в Active Directory). Строка вида "LDAP://CN=IvanovAB,OU=CentralOffice,DC=SAMPLE,DC=LAN".
		// - MemberOF (ссылки на группы, к которым принадлежит пользователь). Массив строк вида "CN=Group1C,OU=CentralOffice,DC=SAMPLE,DC=LAN".
		// - Name (имя учетной записи пользователя). Единственный обязательный параметр при создании пользователя в AD.
		// - SAMAccountName (идентификатор для логина). Параметр, переопределяющий имя  учётной записи для входа в домен.
		// - DisplayName (выводимое имя). Представление учетной записи пользователя в AD.
		// Область (диапазон поиска)								: Строка "base" или "onelevel" или "subtree".
		// - Строка "base"		(Поиск только по одному объекту, указанному в первой части запроса).
		// - Строка "onelevel"	(Поиск только по дочерним объектам контейнерного объекта, указанного в первой части запроса).
		// - Строка "subtree"	(Поиск по всем объектам вниз по иерархии).
		////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
		
		ADODBRS =  Новый COMОбъект("ADODB.RecordSet");
		ADODBRS.Open("<LDAP://" + СокрЛП(DomainLDAP) + ">;(&(objectCategory=person)(objectClass=user));ADsPath,MemberOF,Name,DisplayName,SAMAccountName;subtree", ADODB);
		
		Если ADODBRS.RecordCount <= 0 Тогда
			Сообщить("LDAP-запрос не содержит данных.");
			ADODBRS.Close();
			ADODBRS = Неопределено;
			ADODB.Close();
			ADODB = Неопределено;
			Возврат СписокПользователейAD;
		КонецЕсли;
	Исключение
		//ADODBRS.Close();	// ADODBRS - создается, ошибка может возникнуть на ADODBRS.Open(): Операция не допускается если объект закрыт.
		ADODBRS = Неопределено;
		ADODB.Close();
		ADODB = Неопределено;
		Сообщить("Не удалось выполнить LDAP-запрос.");
		Возврат СписокПользователейAD;
	КонецПопытки;
	
	DomainDNS1 = GetDomainDNS(DomainLDAP);
	Попытка
		Пока НЕ ADODBRS.EOF Цикл  
			
			ADsPath = ADODBRS.Fields("ADsPath").Value;
			DomainLDAP2 = Сред(ADsPath, Найти(ADsPath, "DC="));		// Вычленение строки вида "DC=SAMPLE,DC=LAN".
			DomainDNS2 = GetDomainDNS(DomainLDAP2);					// Преобразование в строку вида "SAMPLE.LAN".
			Если НЕ DomainDNS2 = DomainDNS1 Тогда					// Отличающиеся домены отметить особо.
				DomainDNS2 = DomainDNS2 + ":";
			Иначе
				DomainDNS2 = "";
			КонецЕсли;
			MemberOF = ADODBRS.Fields("MemberOF").Value;			// Группы пользователя.
			Name = ADODBRS.Fields("Name").Value;					// Обязательное поле.
			AccountName = ADODBRS.Fields("SAMAccountName").Value;	// Может не совпадать с Name.
			DisplayName = ADODBRS.Fields("DisplayName").Value;		// Может быть Null.
			
			НовыйЭлемент = СписокПользователейAD.Добавить();
			Если ЗначениеЗаполнено(AccountName) И ВРег(AccountName) <> ВРег(Name) Тогда
				НовыйЭлемент.Значение = AccountName;
				НовыйЭлемент.Представление = ?(ЗначениеЗаполнено(DisplayName), DisplayName+" ("+DomainDNS2+AccountName+")", DomainDNS2+AccountName);
			Иначе
				НовыйЭлемент.Значение = Name;
				НовыйЭлемент.Представление = ?(ЗначениеЗаполнено(DisplayName), DisplayName+" ("+DomainDNS2+Name+")", DomainDNS2+Name);
			КонецЕсли;
			
			Попытка
				ADODBRS.MoveNext();
			Исключение
				Сообщить("Не удалось получить следующую LDAP-запись.");
				Прервать;
			КонецПопытки;
			
		КонецЦикла;
	Исключение
		Сообщить("Не удалось получить данные LDAP-запроса.");
	КонецПопытки;
	
	ADODBRS.Close();
	ADODBRS = Неопределено;
	
	ADODB.Close();
	ADODB = Неопределено;

	Возврат СписокПользователейAD;
	
КонецФункции

Функция ЗагрузитьПользователеWindowsADвИБ(СписокПользователейWindowsAD, ComputerAD) Экспорт
	Перем ПользовательWindowsAD, ПользовательИБ, ДобавленоПользователей;
	Перем РольПолныеПрава, РольПолныеПраваДоступна, РольАдминистратораСистемы;
	Перем УстановленныеРоли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	РольПолныеПраваДоступна = _ПроверитьНаличиеИДоступностьРолиПолныеПраваВКонфигурации(РольПолныеПрава);
	Если РольПолныеПраваДоступна Тогда
		РольПолныеПрава = Метаданные.Роли[РольПолныеПрава];
	КонецЕсли;
	РольАдминистратораСистемы = РольАдминистратораСистемы();
	
	ДобавленоПользователей = 0;
	Для Каждого ПользовательWindowsAD ИЗ СписокПользователейWindowsAD Цикл
		
		Если НЕ ПользовательWindowsAD.Пометка Тогда
			Продолжить;
		КонецЕсли;
		
		ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоИмени(ПользовательWindowsAD.Значение);
		Если НЕ ПользовательИБ = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Попытка
			ПользовательИБ = ПользователиИнформационнойБазы.СоздатьПользователя();
			
			ПользовательИБ.Имя = ПользовательWindowsAD.Значение;
			ПользовательИБ.ПолноеИмя = ?(ЗначениеЗаполнено(ПользовательWindowsAD.Представление), ПользовательWindowsAD.Представление, ПользовательWindowsAD.Значение);
			ПользовательИБ.ПользовательОС = "\\" + ComputerAD + "\" + ПользовательWindowsAD.Значение;
			
			ПользовательИБ.АутентификацияСтандартная = Ложь;
			ПользовательИБ.ПоказыватьВСпискеВыбора = Ложь;
			
			ПользовательИБ.АутентификацияОС = Истина;
			ПользовательИБ.АутентификацияOpenID = Ложь;
			
			ПользовательИБ.Пароль = Неопределено;
			ПользовательИБ.СохраняемоеЗначениеПароля = Неопределено;
			ПользовательИБ.ЗапрещеноИзменятьПароль = Ложь;
			
			ПользовательИБ.ОсновнойИнтерфейс = Метаданные.ОсновнойИнтерфейс;
			ПользовательИБ.РежимЗапуска = РежимЗапускаКлиентскогоПриложения.Авто;
			ПользовательИБ.Язык = Метаданные.ОсновнойЯзык;
			
			// Пользователям Windows/ActiveDirectory по-умолчанию назначаем полные права.
			ПользовательИБ.Роли.Очистить();
			УстановленныеРоли = "";
			Если РольПолныеПраваДоступна Тогда
				ПользовательИБ.Роли.Добавить(РольПолныеПрава);
				УстановленныеРоли = "" + РольПолныеПрава.Имя;
			КонецЕсли;
			Если НЕ РольАдминистратораСистемы = Неопределено И НЕ ПользовательИБ.Роли.Содержит(РольАдминистратораСистемы) Тогда
				ПользовательИБ.Роли.Добавить(РольАдминистратораСистемы);
				УстановленныеРоли = УстановленныеРоли + ";" + РольАдминистратораСистемы.Имя;
				Если Лев(УстановленныеРоли, 1) = ";" Тогда
					УстановленныеРоли = Сред(УстановленныеРоли, 2);
				КонецЕсли;
			КонецЕсли;
			
			ПользовательИБ.Записать();
			
			ДобавленоПользователей = ДобавленоПользователей + 1;
			Если ДобавленоПользователей = 1 Тогда
				Сообщить("Добавление пользователей 1С:");
			КонецЕсли;
			Сообщить("-" + ПользовательИБ.Имя + ". Пользователь ОС: " + ПользовательИБ.ПользовательОС + ". Роли: " + УстановленныеРоли + ".");
		Исключение
			Сообщить(ОписаниеОшибки());
			Прервать;
		КонецПопытки;
		
	КонецЦикла;
	
	Если ДобавленоПользователей > 0 Тогда
		Сообщить("ВСЕГО добавлено пользователей: " + ДобавленоПользователей + ".");
		Сообщить("Рекомендуется переназначить роли дбавленным пользователям.");
	КонецЕсли;
	
	Возврат ДобавленоПользователей;
	
КонецФункции

// Получить строку соединения ИБ, если задан нестандартный порт кластера серверов.
//
// Параметры
//  ПортКластераСерверов  - Число - нестандартный порт кластера серверов
//
// Возвращаемое значение:
//   Строка   - строка соединения ИБ
//
Функция ПолучитьСтрокуСоединенияИнформационнойБазы(Знач ПортКластераСерверов = 0) Экспорт

	Результат = СтрокаСоединенияИнформационнойБазы();
	Если ИнформационнаяБазаФайловая() ИЛИ (ПортКластераСерверов = 0) Тогда
		Возврат Результат;
	КонецЕсли; 
	
#Если НаКлиенте Тогда		
	Если КлиентПодключенЧерезВебСервер() Тогда
		Возврат Результат;
	КонецЕсли; 
#КонецЕсли		
	
	ПодстрокиСтрокиСоединения  = РазложитьСтрокуВМассивПодстрок(Результат, ";");
	ИмяСервера = СократитьДвойныеКавычки(Сред(ПодстрокиСтрокиСоединения[0], 7));
	ИмяИБ      = СократитьДвойныеКавычки(Сред(ПодстрокиСтрокиСоединения[1], 6));
	Результат  = "Srvr=" + """" + ИмяСервера + 
		?(Найти(ИмяСервера, ":") > 0, "", ":" + Формат(ПортКластераСерверов, "ЧГ=0")) + """;" + 
		"Ref=" + """" + ИмяИБ + """;";
	Возврат Результат;

КонецФункции

// Возвращает роль, предоставляющую права администрирования системы.
//
// Возвращаемое значение:
//  ОбъектМетаданных: Роль.
//
Функция РольАдминистратораСистемы() Экспорт
	Перем РольАдминистратораСистемы, РольПолныеПрава, РольПолныеПраваДоступна;
	
	Попытка
		РольАдминистратораСистемы = Метаданные.Роли.АдминистраторСистемы;
		РольПолныеПраваДоступна = _ПроверитьНаличиеИДоступностьРолиПолныеПраваВКонфигурации(РольПолныеПрава);
		Если РольПолныеПраваДоступна Тогда
			Если ПравоДоступа("Администрирование", Метаданные, Метаданные.Роли[РольПолныеПрава])
				ИЛИ ЭтоБазоваяВерсияКонфигурации() Тогда
				//РольАдминистратораСистемы = Метаданные.Роли.ПолныеПрава;
				РольАдминистратораСистемы = Метаданные.Роли[РольПолныеПрава];
			КонецЕсли;
		КонецЕсли;
	Исключение
		РольАдминистратораСистемы = Неопределено;
	КонецПопытки;
	
	Возврат РольАдминистратораСистемы;
	
КонецФункции

// Возвращает признак, является ли конфигурация базовой.
//
// Возвращаемое значение:
//   Булево   - Истина, если конфигурация - базовая.
//
Функция ЭтоБазоваяВерсияКонфигурации() Экспорт
	Возврат Найти(ВРег(Метаданные.Имя), "БАЗОВАЯ") > 0;
КонецФункции

// Возвращает Истина, если подсистема существует.
//
// Параметры:
//  ПолноеИмяПодсистемы - Строка. Полное имя объекта метаданных подсистема без слов "Подсистема.".
//                        Например: "СтандартныеПодсистемы.БазоваяФункциональность".
//
// Пример вызова необязательной подсистемы:
//
//  Если ОбщегоНазначенияКлиентСервер.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
//  	МодульУправлениеДоступом = Вычислить("УправлениеДоступом");
//  	МодульУправлениеДоступом.<Имя метода>();
//  КонецЕсли;
//
// Возвращаемое значение:
//  Булево.
//
Функция ПодсистемаСуществует(ПолноеИмяПодсистемы) Экспорт
	
	ИменаПодсистем = ИменаПодсистем();
	
	Возврат ИменаПодсистем.Получить(ПолноеИмяПодсистемы) <> Неопределено;
	
КонецФункции

// Возвращает соответствие имен подсистем и значения Истина;
Функция ИменаПодсистем() Экспорт
	
	Возврат Новый ФиксированноеСоответствие(ИменаПодчиненныхПодсистем(Метаданные));
	
КонецФункции

Функция ИменаПодчиненныхПодсистем(РодительскаяПодсистема) Экспорт
	
	Имена = Новый Соответствие;
	
	Для Каждого ТекущаяПодсистема ИЗ РодительскаяПодсистема.Подсистемы Цикл
		
		Имена.Вставить(ТекущаяПодсистема.Имя, Истина);
		ИменаПодчиненных = ИменаПодчиненныхПодсистем(ТекущаяПодсистема);
		
		Для Каждого ИмяПодчиненной ИЗ ИменаПодчиненных Цикл
			Имена.Вставить(ТекущаяПодсистема.Имя + "." + ИмяПодчиненной.Ключ, Истина);
		КонецЦикла;
	КонецЦикла;
	
	Возврат Имена;
	
КонецФункции

// Возвращает ссылку на общий модуль по имени.
//
// Параметры:
//  Имя          - Строка - имя общего модуля, например:
//                 "ОбщегоНазначения",
//                 "ОбщегоНазначенияКлиент".
//
// Возвращаемое значение:
//  ОбщийМодуль.
//
Функция ОбщийМодуль(Имя) Экспорт
	
	//+yuraos, 10.09.2015
	Модуль = Вычислить("СтандартныеПодсистемыСервер.СерверныйОбщийМодуль(Имя)");
	//+yuraos, 10.09.2015
	
	////-yuraos, 10.09.2015 - валится компиляция, 
	// если нет общего модуля "СтандартныеПодсистемыСервер"
	//Модуль = СтандартныеПодсистемыСервер.СерверныйОбщийМодуль(Имя);
	////-yuraos, 10.09.2015
	
	Возврат Модуль;
	
КонецФункции

// Возвращает общий модуль или Неопределено, если нет такого.
//
Функция ОбщегоНазначенияОбщийМодуль(Знач ИмяМодуля)
	
	Если Метаданные.ОбщиеМодули.Найти(ИмяМодуля) = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	УстановитьБезопасныйРежим(Истина);
	Результат = Вычислить(ИмяМодуля);
	УстановитьБезопасныйРежим(Ложь);
	
	Возврат Результат;
	
КонецФункции

// Возвращает серверный общий модуль по имени.
Функция СерверныйОбщийМодуль(Имя) Экспорт
	
	Если Метаданные.ОбщиеМодули.Найти(Имя) <> Неопределено Тогда
		Модуль = Вычислить(Имя);
	Иначе
		Модуль = Неопределено;
	КонецЕсли;
	
	Если ТипЗнч(Модуль) <> Тип("ОбщийМодуль") Тогда
		ВызватьИсключение ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Общий модуль ""%1"" не найден.'"), Имя);
	КонецЕсли;
	
	Возврат Модуль;
	
КонецФункции

// Возвращает тип платформы сервера.
//
// Возвращаемое значение:
// ТипПлатформы; Неопределено.
//
Функция ТипПлатформыСервера(ВызовСервера = Истина) Экспорт
	
#Если Сервер Тогда
	СистемнаяИнфо = Новый СистемнаяИнформация;
	Возврат СистемнаяИнфо.ТипПлатформы;
#Иначе
	Если ВызовСервера Тогда
		ТипПлатформыСервераСтрокой = ТипПлатформыСервераСтрокой();
		
		Если ТипПлатформыСервераСтрокой = "Linux_x86" Тогда
			Возврат ТипПлатформы.Linux_x86;
			
		ИначеЕсли ТипПлатформыСервераСтрокой = "Linux_x86_64" Тогда
			Возврат ТипПлатформы.Linux_x86_64;
			
		ИначеЕсли ТипПлатформыСервераСтрокой = "Windows_x86" Тогда
			Возврат ТипПлатформы.Windows_x86;
			
		ИначеЕсли ТипПлатформыСервераСтрокой = "Windows_x86_64" Тогда
			Возврат ТипПлатформы.Windows_x86_64;
		КонецЕсли;
		
		Возврат Неопределено;
	Иначе
		СистемнаяИнфо = Новый СистемнаяИнформация;
		Возврат СистемнаяИнфо.ТипПлатформы;
	КонецЕсли;
#КонецЕсли
	
КонецФункции

// Возвращает тип платформы строкой.
Функция ТипПлатформыСервераСтрокой() Экспорт
	
	СистемнаяИнфо = Новый СистемнаяИнформация;
	
	Если СистемнаяИнфо.ТипПлатформы = ТипПлатформы.Linux_x86 Тогда
		Возврат "Linux_x86";
		
	ИначеЕсли СистемнаяИнфо.ТипПлатформы = ТипПлатформы.Linux_x86_64 Тогда
		Возврат "Linux_x86_64";
		
	ИначеЕсли СистемнаяИнфо.ТипПлатформы = ТипПлатформы.Windows_x86 Тогда
		Возврат "Windows_x86";
		
	ИначеЕсли СистемнаяИнфо.ТипПлатформы = ТипПлатформы.Windows_x86_64 Тогда
		Возврат "Windows_x86_64";
		
	ИначеЕсли СистемнаяИнфо.ТипПлатформы = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ВызватьИсключение ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Неизвестный тип платформы ""%1""'"),
		Строка(СистемнаяИнфо.ТипПлатформы));
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// Общие процедуры и функции для работы с данными в базе

Функция ПолучитьЗначениеВПопытке(хОбъект, хРеквизит)
	
	Попытка
		Возврат хОбъект[хРеквизит]
	Исключение
		Возврат Неопределено;
	КонецПопытки;
	
	Возврат Неопределено;
	
КонецФункции

// Возвращает структуру, содержащую значения реквизитов прочитанные из информационной базы
// по ссылке на объект.
// 
//  Если доступа к одному из реквизитов нет, возникнет исключение прав доступа.
//  Если необходимо зачитать реквизит независимо от прав текущего пользователя,
//  то следует использовать предварительный переход в привилегированный режим.
// 
// Параметры:
//  Ссылка    - Ссылка на объект - элемент справочника, документ, ...
//
//  Реквизиты - Строка - имена реквизитов, перечисленные через запятую, в формате
//              требований к свойствам структуры.
//              Например, "Код, Наименование, Родитель".
//            - Структура, ФиксированнаяСтруктура - в качестве ключа передается
//              псевдоним поля для возвращаемой структуры с результатом, а в качестве
//              значения (опционально) фактическое имя поля в таблице.
//              Если значение не определено, то имя поля берется из ключа.
//            - Массив, ФиксированныйМассив - имена реквизитов в формате требований
//              к свойствам структуры.
//
// Возвращаемое значение:
//  Структура - содержит имена (ключи) и значения затребованных реквизитов.
// 
Функция ЗначенияРеквизитовОбъекта(Ссылка, Реквизиты) Экспорт
	
	Если ТипЗнч(Реквизиты) = Тип("Строка") Тогда
		СтруктураРеквизитов = Новый Структура(Реквизиты);
		
	ИначеЕсли ТипЗнч(Реквизиты) = Тип("Структура")
	      ИЛИ ТипЗнч(Реквизиты) = Тип("ФиксированнаяСтруктура") Тогда
		
		СтруктураРеквизитов = Реквизиты;
		
	ИначеЕсли ТипЗнч(Реквизиты) = Тип("Массив")
	      ИЛИ ТипЗнч(Реквизиты) = Тип("ФиксированныйМассив") Тогда
		
		СтруктураРеквизитов = Новый Структура;
		Для Каждого Реквизит Из Реквизиты Цикл
			СтруктураРеквизитов.Вставить(Реквизит);
		КонецЦикла;
	Иначе
		ВызватьИсключение ПодставитьПараметрыВСтроку(НСтр("ru = 'Неверный тип второго параметра Реквизиты: %1'"), Строка(ТипЗнч(Реквизиты)));
	КонецЕсли;
	
	ТекстПолей = "";
	Для Каждого КлючИЗначение Из СтруктураРеквизитов Цикл
		
		ИмяПоля   = ?(ЗначениеЗаполнено(КлючИЗначение.Значение),
		              СокрЛП(КлючИЗначение.Значение),
		              СокрЛП(КлючИЗначение.Ключ));
		
		Псевдоним = СокрЛП(КлючИЗначение.Ключ);
		
		ТекстПолей  = ТекстПолей + ?(ПустаяСтрока(ТекстПолей), "", ",") + "
		|	" + ИмяПоля + " КАК " + Псевдоним;
		
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.Текст =
	"ВЫБРАТЬ
	|" + ТекстПолей + "
	|ИЗ
	|	" + Ссылка.Метаданные().ПолноеИмя() + " КАК ПсевдонимЗаданнойТаблицы
	|ГДЕ
	|	ПсевдонимЗаданнойТаблицы.Ссылка = &Ссылка
	|";
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Результат = Новый Структура;
	Для Каждого КлючИЗначение Из СтруктураРеквизитов Цикл
		Результат.Вставить(КлючИЗначение.Ключ);
	КонецЦикла;
	ЗаполнитьЗначенияСвойств(Результат, Выборка);
	
	Возврат Результат;
	
КонецФункции

// Возвращает значение реквизита, прочитанного из информационной базы по ссылке на объект.
// 
//  Если доступа к реквизиту нет, возникнет исключение прав доступа.
//  Если необходимо зачитать реквизит независимо от прав текущего пользователя,
//  то следует использовать предварительный переход в привилегированный режим.
// 
// Параметры:
//  Ссылка       - ссылка на объект, - элемент справочника, документ, ...
//  ИмяРеквизита - Строка, например, "Код".
// 
// Возвращаемое значение:
//  Произвольный    - зависит от типа значения прочитанного реквизита.
// 
Функция ЗначениеРеквизитаОбъекта(Ссылка, ИмяРеквизита) Экспорт
	
	Результат = ЗначенияРеквизитовОбъекта(Ссылка, ИмяРеквизита);
	Возврат Результат[ИмяРеквизита];
	
КонецФункции 

// Возвращает структуру, содержащую значения реквизитов, прочитанные из информационной базы
// для нескольких объектов.
// 
//  Если доступа к одному из реквизитов нет, возникнет исключение прав доступа.
//  Если необходимо зачитать реквизит независимо от прав текущего пользователя,
//  то следует использовать предварительный переход в привилегированный режим.
// 
// Параметры:
//  МассивСсылок - массив ссылок на объекты одного типа
//				ВАЖНО! значения массива должны быть ссылками на 
//				объекты одного типа!
//  ИменаРеквизитов - Строка, имена реквизитов перечисленные через запятую,
//				в формате требований к свойствам структуры.
//				Например, "Код, Наименование, Родитель".
// 
// Возвращаемое значение:
//  Соответствие, где ключ - ссылка на объект, а Значение - структура, которая 
//				содержит список свойств, как список имен в строке
//				ИменаРеквизитов, со значениям реквизитов, прочитанными
//				из информационной базы.
// 
Функция ЗначенияРеквизитовОбъектов(МассивСсылок, ИменаРеквизитов) Экспорт
	
	ЗначенияРеквизитов = Новый Соответствие;
	Если МассивСсылок.Количество() = 0 Тогда
		Возврат ЗначенияРеквизитов;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Ссылка КАК Ссылка, " + ИменаРеквизитов + "
		|ИЗ
		|	" + МассивСсылок[0].Метаданные().ПолноеИмя() + " КАК Таблица
		|ГДЕ
		|	Таблица.Ссылка В (&МассивСсылок)";
	Запрос.УстановитьПараметр("МассивСсылок", МассивСсылок);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат = Новый Структура(ИменаРеквизитов);
		ЗаполнитьЗначенияСвойств(Результат, Выборка);
		ЗначенияРеквизитов[Выборка.Ссылка] = Результат;
	КонецЦикла;
	
	Возврат ЗначенияРеквизитов;
	
КонецФункции

// Возвращает значения реквизита, прочитанного из информационной базы для нескольких объектов.
// 
//  Если доступа к реквизиту нет, возникнет исключение прав доступа.
//  Если необходимо зачитать реквизит независимо от прав текущего пользователя,
//  то следует использовать предварительный переход в привилегированный режим.
// 
// Параметры:
//  МассивСсылок - массив ссылок на объекты одного типа
//				ВАЖНО! значения массива должны быть ссылками на 
//				объекты одного типа!
//  ИмяРеквизита - Строка, например, "Код".
// 
// Возвращаемое значение:
//  Соответствие, где ключ - ссылка на объект, Значение - значение прочитанного реквизита
// 
Функция ЗначениеРеквизитаОбъектов(МассивСсылок, ИмяРеквизита) Экспорт
	
	ЗначенияРеквизитов = ЗначенияРеквизитовОбъектов(МассивСсылок, ИмяРеквизита);
	Для Каждого Элемент ИЗ ЗначенияРеквизитов Цикл
		ЗначенияРеквизитов[Элемент.Ключ] = Элемент.Значение[ИмяРеквизита];
	КонецЦикла;
		
	Возврат ЗначенияРеквизитов;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ИМПОРТ. Выгрузка-Загрузка XML.

// Выгрузка ХОбъекта в XML-строку:
//
Функция ЗаписатьВXML(ХОбъект) Экспорт
	ЗаписьXML = Новый ЗаписьXML;				// Тонкий клиент, сервер, толстый клиент, внешнее соединение.
	ЗаписьXML.УстановитьСтроку();
	ЗаписатьXML(ЗаписьXML, ХОбъект);			// Сервер, толстый клиент, внешнее соединение.
	Возврат ЗаписьXML.Закрыть();
КонецФункции

// Загрузка ХОбъекта из XML-строки:
//
Функция ПрочитатьИзXML(СтрокаXML) Экспорт
	ЧтениеXML = Новый ЧтениеXML;				// Тонкий клиент, сервер, толстый клиент, внешнее соединение.
	ЧтениеXML.УстановитьСтроку(СтрокаXML);
	ХОбъект = ПрочитатьXML(ЧтениеXML);			// Сервер, толстый клиент, внешнее соединение.
	Возврат ХОбъект;
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ИЗ КОНФИГУРАЦИЙ.
//

// "Функция-Заглушка"
//
// Для Конфигурации: КомплекснаяАвтоматизация 1.1.18.
// Справочник.СохраненныеНастройки.
// ФормаВыбора.СправочникСписокСохраненныеНастройкиВыборЗначения(Элемент, СтандартнаяОбработка, Значение)
//
Функция ПрименитьНастройку() Экспорт
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// WMI (Windows Management Instrumentation - Инструментарий управления Windows).

// Функция, позволяющая получить информацию об установленной Windows на локальном/удаленном компьютере.
// Параметры:
//	Computer - Имя компьютера.
// Возвращаемое значение:
//	ТаблицаЗначений.
//
// Рекомендация:
// Перед применением проверить на компьютерах
// Windows Management Instrumentation (WMI):
// 1. Состояние служб.
// 2. Разрешение в брандмауэре.
//
Функция Computer_WindowsInfo(Computer = ".") Экспорт
	Перем WINInfo, WINInfoOS;
	Перем WinMGMT, Win32_OperatingSystem, OperatingSystem;
	
	WINInfo = Новый ТаблицаЗначений;
	WINInfo.Колонки.Добавить("BootDevice");
	WINInfo.Колонки.Добавить("BuildNumber");
	WINInfo.Колонки.Добавить("BuildType");
	WINInfo.Колонки.Добавить("Caption");
	WINInfo.Колонки.Добавить("CodeSet");
	WINInfo.Колонки.Добавить("CountryCode");
	WINInfo.Колонки.Добавить("CreationClassName");
	WINInfo.Колонки.Добавить("CSCreationClassName");
	WINInfo.Колонки.Добавить("CSDVersion");
	WINInfo.Колонки.Добавить("CSName");
	WINInfo.Колонки.Добавить("CurrentTimeZone");
	WINInfo.Колонки.Добавить("DataExecutionPrevention_32BitApplications");
	WINInfo.Колонки.Добавить("DataExecutionPrevention_Available");
	WINInfo.Колонки.Добавить("DataExecutionPrevention_Drivers");
	WINInfo.Колонки.Добавить("DataExecutionPrevention_SupportPolicy");
	WINInfo.Колонки.Добавить("Debug");
	WINInfo.Колонки.Добавить("Description");
	WINInfo.Колонки.Добавить("Distributed");
	WINInfo.Колонки.Добавить("EncryptionLevel");
	WINInfo.Колонки.Добавить("ForegroundApplicationBoost");
	WINInfo.Колонки.Добавить("FreePhysicalMemory");
	WINInfo.Колонки.Добавить("FreeSpaceInPagingFiles");
	WINInfo.Колонки.Добавить("FreeVirtualMemory");
	WINInfo.Колонки.Добавить("InstallDate");
	WINInfo.Колонки.Добавить("LargeSystemCache");
	WINInfo.Колонки.Добавить("LastBootUpTime");
	WINInfo.Колонки.Добавить("LocalDateTime");
	WINInfo.Колонки.Добавить("Locale");
	WINInfo.Колонки.Добавить("Manufacturer");
	WINInfo.Колонки.Добавить("MaxNumberOfProcesses");
	WINInfo.Колонки.Добавить("MaxProcessMemorySize");
	WINInfo.Колонки.Добавить("MUILanguages");
	WINInfo.Колонки.Добавить("Name");
	WINInfo.Колонки.Добавить("NumberOfLicensedUsers");
	WINInfo.Колонки.Добавить("NumberOfProcesses");
	WINInfo.Колонки.Добавить("NumberOfUsers");
	WINInfo.Колонки.Добавить("OperatingSystemSKU");
	WINInfo.Колонки.Добавить("Organization");
	WINInfo.Колонки.Добавить("OSArchitecture");
	WINInfo.Колонки.Добавить("OSLanguage");
	WINInfo.Колонки.Добавить("OSProductSuite");
	WINInfo.Колонки.Добавить("OSType");
	WINInfo.Колонки.Добавить("OtherTypeDescription");
	WINInfo.Колонки.Добавить("PAEEnabled");
	WINInfo.Колонки.Добавить("PlusProductID");
	WINInfo.Колонки.Добавить("PlusVersionNumber");
	WINInfo.Колонки.Добавить("Primary");
	WINInfo.Колонки.Добавить("ProductType");
	WINInfo.Колонки.Добавить("RegisteredUser");
	WINInfo.Колонки.Добавить("SerialNumber");
	WINInfo.Колонки.Добавить("ServicePackMajorVersion");
	WINInfo.Колонки.Добавить("ServicePackMinorVersion");
	WINInfo.Колонки.Добавить("SizeStoredInPagingFiles");
	WINInfo.Колонки.Добавить("Status");
	WINInfo.Колонки.Добавить("SuiteMask");
	WINInfo.Колонки.Добавить("SystemDevice");
	WINInfo.Колонки.Добавить("SystemDirectory");
	WINInfo.Колонки.Добавить("SystemDrive");
	WINInfo.Колонки.Добавить("TotalSwapSpaceSize");
	WINInfo.Колонки.Добавить("TotalVirtualMemorySize");
	WINInfo.Колонки.Добавить("TotalVisibleMemorySize");
	WINInfo.Колонки.Добавить("Version");
	WINInfo.Колонки.Добавить("WindowsDirectory");
	
	Попытка
		WinMGMT = ПолучитьCOMОбъект("winmgmts:\\" + Computer + "\root\cimv2"); 
		Win32_OperatingSystem = WinMGMT.ExecQuery("SELECT * FROM Win32_OperatingSystem");
	Исключение
		Возврат WINInfo;
	КонецПопытки;
	
	Для Каждого OperatingSystem ИЗ Win32_OperatingSystem Цикл
		WINInfoOS = WINInfo.Добавить();
		WINInfoOS.BootDevice			= ПолучитьЗначениеВПопытке(OperatingSystem, "BootDevice");
		WINInfoOS.BuildNumber			= ПолучитьЗначениеВПопытке(OperatingSystem, "BuildNumber");
		WINInfoOS.BuildType				= ПолучитьЗначениеВПопытке(OperatingSystem, "BuildType");
		WINInfoOS.Caption				= ПолучитьЗначениеВПопытке(OperatingSystem, "Caption");
		WINInfoOS.CodeSet				= ПолучитьЗначениеВПопытке(OperatingSystem, "CodeSet");
		WINInfoOS.CountryCode			= ПолучитьЗначениеВПопытке(OperatingSystem, "CountryCode");
		WINInfoOS.CreationClassName		= ПолучитьЗначениеВПопытке(OperatingSystem, "CreationClassName");
		WINInfoOS.CSCreationClassName	= ПолучитьЗначениеВПопытке(OperatingSystem, "CSCreationClassName");
		WINInfoOS.CSDVersion			= ПолучитьЗначениеВПопытке(OperatingSystem, "CSDVersion");
		WINInfoOS.CSName				= ПолучитьЗначениеВПопытке(OperatingSystem, "CSName");
		WINInfoOS.CurrentTimeZone		= ПолучитьЗначениеВПопытке(OperatingSystem, "CurrentTimeZone");
		WINInfoOS.DataExecutionPrevention_32BitApplications	= ПолучитьЗначениеВПопытке(OperatingSystem, "DataExecutionPrevention_32BitApplications");
		WINInfoOS.DataExecutionPrevention_Available			= ПолучитьЗначениеВПопытке(OperatingSystem, "DataExecutionPrevention_Available");
		WINInfoOS.DataExecutionPrevention_Drivers			= ПолучитьЗначениеВПопытке(OperatingSystem, "DataExecutionPrevention_Drivers");
		WINInfoOS.DataExecutionPrevention_SupportPolicy		= ПолучитьЗначениеВПопытке(OperatingSystem, "DataExecutionPrevention_SupportPolicy");
		WINInfoOS.Debug					= ПолучитьЗначениеВПопытке(OperatingSystem, "Debug");
		WINInfoOS.Description			= ПолучитьЗначениеВПопытке(OperatingSystem, "Description");
		WINInfoOS.Distributed			= ПолучитьЗначениеВПопытке(OperatingSystem, "Distributed");
		WINInfoOS.EncryptionLevel		= ПолучитьЗначениеВПопытке(OperatingSystem, "EncryptionLevel");
		WINInfoOS.ForegroundApplicationBoost	= ПолучитьЗначениеВПопытке(OperatingSystem, "ForegroundApplicationBoost");
		WINInfoOS.FreePhysicalMemory	= ПолучитьЗначениеВПопытке(OperatingSystem, "FreePhysicalMemory");
		WINInfoOS.FreeSpaceInPagingFiles= ПолучитьЗначениеВПопытке(OperatingSystem, "FreeSpaceInPagingFiles");
		WINInfoOS.FreeVirtualMemory		= ПолучитьЗначениеВПопытке(OperatingSystem, "FreeVirtualMemory");
		WINInfoOS.InstallDate 			= ПреобразоватьЗначениеВДатуВремя(ПолучитьЗначениеВПопытке(OperatingSystem, "InstallDate"));	// Дата установки Windows.
		WINInfoOS.LargeSystemCache		= ПолучитьЗначениеВПопытке(OperatingSystem, "LargeSystemCache");
		WINInfoOS.LastBootUpTime		= ПреобразоватьЗначениеВДатуВремя(ПолучитьЗначениеВПопытке(OperatingSystem, "LastBootUpTime"));
		WINInfoOS.LocalDateTime			= ПреобразоватьЗначениеВДатуВремя(ПолучитьЗначениеВПопытке(OperatingSystem, "LocalDateTime"));
		WINInfoOS.Locale				= ПолучитьЗначениеВПопытке(OperatingSystem, "Locale");
		WINInfoOS.Manufacturer			= ПолучитьЗначениеВПопытке(OperatingSystem, "Manufacturer");
		WINInfoOS.MaxNumberOfProcesses	= ПолучитьЗначениеВПопытке(OperatingSystem, "MaxNumberOfProcesses");
		WINInfoOS.MaxProcessMemorySize	= ПреобразоватьЗначениеВЧисло(ПолучитьЗначениеВПопытке(OperatingSystem, "MaxProcessMemorySize"));
		MUILanguagesARRAY					= ПолучитьЗначениеВПопытке(OperatingSystem, "MUILanguages");
		MUILanguages = Неопределено;
		Попытка
			Для Каждого ит ИЗ MUILanguagesARRAY Цикл
				MUILanguages = ит;
			КонецЦикла;
		Исключение
		КонецПопытки;
		WINInfoOS.MUILanguages			= MUILanguages;
		WINInfoOS.Name					= ПолучитьЗначениеВПопытке(OperatingSystem, "Name");
		WINInfoOS.NumberOfLicensedUsers	= ПолучитьЗначениеВПопытке(OperatingSystem, "NumberOfLicensedUsers");
		WINInfoOS.NumberOfProcesses		= ПолучитьЗначениеВПопытке(OperatingSystem, "NumberOfProcesses");
		WINInfoOS.NumberOfUsers			= ПолучитьЗначениеВПопытке(OperatingSystem, "NumberOfUsers");
		WINInfoOS.OperatingSystemSKU	= ПолучитьЗначениеВПопытке(OperatingSystem, "OperatingSystemSKU");
		WINInfoOS.Organization			= ПолучитьЗначениеВПопытке(OperatingSystem, "Organization");
		WINInfoOS.OSArchitecture		= ПолучитьЗначениеВПопытке(OperatingSystem, "OSArchitecture");
		WINInfoOS.OSLanguage			= ПолучитьЗначениеВПопытке(OperatingSystem, "OSLanguage");
		WINInfoOS.OSProductSuite		= ПолучитьЗначениеВПопытке(OperatingSystem, "OSProductSuite");
		WINInfoOS.OSType				= ПолучитьЗначениеВПопытке(OperatingSystem, "OSType");
		WINInfoOS.OtherTypeDescription	= ПолучитьЗначениеВПопытке(OperatingSystem, "OtherTypeDescription");
		WINInfoOS.PAEEnabled			= ПолучитьЗначениеВПопытке(OperatingSystem, "PAEEnabled");
		WINInfoOS.PlusProductID			= ПолучитьЗначениеВПопытке(OperatingSystem, "PlusProductID");
		WINInfoOS.PlusVersionNumber		= ПолучитьЗначениеВПопытке(OperatingSystem, "PlusVersionNumber");
		WINInfoOS.Primary				= ПолучитьЗначениеВПопытке(OperatingSystem, "Primary");
		WINInfoOS.ProductType			= ПолучитьЗначениеВПопытке(OperatingSystem, "ProductType");
		WINInfoOS.RegisteredUser		= ПолучитьЗначениеВПопытке(OperatingSystem, "RegisteredUser");
		WINInfoOS.SerialNumber			= ПолучитьЗначениеВПопытке(OperatingSystem, "SerialNumber");
		WINInfoOS.ServicePackMajorVersion	= ПолучитьЗначениеВПопытке(OperatingSystem, "ServicePackMajorVersion");
		WINInfoOS.ServicePackMinorVersion	= ПолучитьЗначениеВПопытке(OperatingSystem, "ServicePackMinorVersion");
		WINInfoOS.SizeStoredInPagingFiles	= ПолучитьЗначениеВПопытке(OperatingSystem, "SizeStoredInPagingFiles");
		WINInfoOS.Status				= ПолучитьЗначениеВПопытке(OperatingSystem, "Status");
		WINInfoOS.SuiteMask				= ПолучитьЗначениеВПопытке(OperatingSystem, "SuiteMask");
		WINInfoOS.SystemDevice			= ПолучитьЗначениеВПопытке(OperatingSystem, "SystemDevice");
		WINInfoOS.SystemDirectory		= ПолучитьЗначениеВПопытке(OperatingSystem, "SystemDirectory");
		WINInfoOS.SystemDrive			= ПолучитьЗначениеВПопытке(OperatingSystem, "SystemDrive");
		WINInfoOS.TotalSwapSpaceSize	= ПреобразоватьЗначениеВЧисло(ПолучитьЗначениеВПопытке(OperatingSystem, "TotalSwapSpaceSize"));
		WINInfoOS.TotalVirtualMemorySize= ПреобразоватьЗначениеВЧисло(ПолучитьЗначениеВПопытке(OperatingSystem, "TotalVirtualMemorySize"));
		WINInfoOS.TotalVisibleMemorySize= ПреобразоватьЗначениеВЧисло(ПолучитьЗначениеВПопытке(OperatingSystem, "TotalVisibleMemorySize"));
		WINInfoOS.Version				= ПолучитьЗначениеВПопытке(OperatingSystem, "Version");
		WINInfoOS.WindowsDirectory		= ПолучитьЗначениеВПопытке(OperatingSystem, "WindowsDirectory");
	КонецЦикла;

	Возврат WINInfo;
    
КонецФункции

Функция ПреобразоватьЗначениеВДатуВремя(Знач Значение)
	
	Попытка
		Возврат Дата(Лев(Значение,14));
	Исключение
		Возврат Дата("00010101");
	КонецПопытки;
	
	Возврат Дата("00010101");
	
КонецФункции

Функция ПреобразоватьЗначениеВЧисло(Знач Значение)
	
	Попытка
		Возврат Число(Значение);
	Исключение
		Возврат Значение;
	КонецПопытки;
	
	Возврат Значение;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// 25.03.2016. ОБЩЕГО НАЗНАЧЕНИЯ. РЕФРАКТОРИНГ.

// 25.03.2016. Получить значение реквизита произвольной коллекции.
Функция ЗначениеИзКоллекции1С(Знач Коллекция, Знач Реквизит, ОписаниеОшибки = "")
	Перем Значение;
	
	Попытка
		Значение = Коллекция[Реквизит];
		Возврат Значение;
	Исключение
		ОписаниеОшибки = ОписаниеОшибки();
		Возврат Неопределено;
	КонецПопытки;
	
	Возврат Неопределено;
	
КонецФункции

// 25.03.2016. Присвоить значение реквизиту произвольной коллекции.
Процедура ЗначениеВКоллекцию1С(Коллекция, Знач Реквизит, Знач Значение, ОписаниеОшибки = "")
	
	Попытка
		Коллекция[Реквизит] = Значение;
	Исключение
		ОписаниеОшибки = ОписаниеОшибки();
	КонецПопытки;
	
КонецПроцедуры

// 25.03.2016. Присвоить значение строковому реквизиту произвольной коллекции.
Процедура ЗначениеВКоллекцию1ССтрока(Коллекция, Знач Реквизит, Знач Значение, ОписаниеОшибки = "")
	
	Попытка
		Коллекция[Реквизит] = СокрЛП(Значение);
		//Коллекция[Реквизит] = ОчиститьСтроковоеЗначение(Коллекция[Реквизит], Реквизит);
	Исключение
		ОписаниеОшибки = ОписаниеОшибки();
	КонецПопытки;
	
КонецПроцедуры

// 25.03.2016. Присвоить значение реквизиту произвольной коллекции.
Процедура ЗначениеВКоллекцию1ССпециальная(Коллекция, Знач Реквизит, Знач Значение, Записано, ОписаниеОшибки = "")
	Перем ТекущееЗначение;
	
	Если НЕ ЗначениеЗаполнено(Значение) Тогда
		Возврат;
	КонецЕсли;
	
	Попытка
		ТекущееЗначение = Коллекция[Реквизит];
		Если ТекущееЗначение = Значение Тогда
			Возврат;
		КонецЕсли;
		Коллекция[Реквизит] = Значение;
		Записано = Истина;
	Исключение
		ОписаниеОшибки = ОписаниеОшибки();
	КонецПопытки;
	
КонецПроцедуры

// 25.03.2016. Функция СтрокаТаблицыЗначенийВСтруктуру создает структуру со свойствами, как колонки таблицы значений передаваемой строки
// и устанавливает этим свойствам значения из строки таблицы значений.
// 
// Параметры:
//  СтрокаТаблицыЗначений - СтрокаТаблицыЗначений
//
// ВозвращаемоеЗначение:
//  Структура
//
Функция СтрокаТаблицыЗначенийВСтруктуру(СтрокаТаблицыЗначений) Экспорт
	
	Структура = Новый Структура;
	Для Каждого Колонка Из СтрокаТаблицыЗначений.Владелец().Колонки Цикл
		Структура.Вставить(Колонка.Имя, СтрокаТаблицыЗначений[Колонка.Имя]);
	КонецЦикла;
	
	Возврат Структура;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// 25.03.2016. МЕТАДАННЫЕ. РЕФРАКТОРИНГ.

// 25.03.2016. Проверить на существование Реквизита в Объекте с учетом стандартных реквизитов.
//
// Параметры:
//  ИмяРеквизита - Строка - имя реквизита;
//  ОбъектДанных - объект информационной базы, в котором требуется проверить наличие реквизита.
//
// Возвращаемое значение:
//  Булево.
//
// &НаСервере.
Функция ЕстьРеквизитОбъекта1С(Знач ИмяРеквизита, Знач ОбъектДанных) Экспорт
	Перем Значение, ОписаниеОшибки;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ОбъектДанных = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если ИмяРеквизита = "ОбменДанными" Тогда	// Особый реквизит, отсутствует в Метаданных Объекта, но есть во время исполнения программного кода, а также совсем отсутствует у ПлановОбмена.
		Значение = ЗначениеИзКоллекции1С(ОбъектДанных, ИмяРеквизита, ОписаниеОшибки);	// Не все объекты имеют свойство "ОбменДанными".
		Возврат (НЕ Значение = Неопределено);
	КонецЕсли;
	
	Возврат ЕстьРеквизитОбъектаМетаданных1С(ИмяРеквизита, ОбъектДанных);
	
КонецФункции 

// 25.03.2016. Проверить на существование Реквизита в Объекте с учетом стандартных реквизитов.
//
// Параметры:
//  ИмяРеквизита - Строка - имя реквизита;
//  МетаданныеОбъекта - ОбъектМетаданных - объект, в котором требуется проверить наличие реквизита.
//
// Возвращаемое значение:
//  Булево.
//
// &НаСервере.
Функция ЕстьРеквизитОбъектаМетаданных1С(Знач ИмяРеквизита, Знач МетаданныеОбъекта) Экспорт
	Перем Значение, Найдено, ОписаниеОшибки;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ЭтоСсылка(ТипЗнч(МетаданныеОбъекта)) Тогда
		МетаданныеОбъекта = МетаданныеОбъекта.Метаданные();
	КонецЕсли;
	
	Значение = МетаданныеОбъекта.Реквизиты.Найти(ИмяРеквизита);
	Найдено = (НЕ Значение = Неопределено);
	Если НЕ Найдено Тогда
		Значение = ЗначениеИзКоллекции1С(МетаданныеОбъекта.СтандартныеРеквизиты, ИмяРеквизита, ОписаниеОшибки);
		Найдено = (НЕ Значение = Неопределено);
	КонецЕсли;
	
	Возврат Найдено;

КонецФункции

// 25.03.2016. Получение массива "Блокируемых" реквизитов: "Реквизит не рекомендуется/нельзя изменять, если объект участвует в документах."
// &НаСервере.
Функция ПолучитьБлокируемыеРеквизитыОбъекта1С(Знач ОбъектДанных) Экспорт
	Перем МассивБлокируемыеРеквизиты, МассивБлокируемыеРеквизиты1С,  СписокБлокируемыеРеквизиты1С;
	
	МассивБлокируемыеРеквизиты = Новый Массив;
	Попытка
		МассивБлокируемыеРеквизиты = МенеджерОбъектаПоСсылке(ОбъектДанных).ПолучитьБлокируемыеРеквизитыОбъекта();
	Исключение
		МассивБлокируемыеРеквизиты = Новый Массив;
	КонецПопытки;
	МассивБлокируемыеРеквизиты1С = ПроверитьМассивРеквизитовПоМетаданным1С(МассивБлокируемыеРеквизиты, ОбъектДанных);
	
	СписокБлокируемыеРеквизиты1С = Новый СписокЗначений;
	СписокБлокируемыеРеквизиты1С.ЗагрузитьЗначения(МассивБлокируемыеРеквизиты1С);
	
	Возврат СписокБлокируемыеРеквизиты1С;
	
КонецФункции

// 25.03.2016. Получение массива "Нередактируемых" реквизитов: "Реквизит, который не нужно редактировать с помощью обработки группового изменения объектов."
// &НаСервере.
Функция ПолучитьНередактируемыеРеквизитыОбъекта1С(ОбъектДанных) Экспорт
	Перем МассивНередактируемыеРеквизиты, МассивНередактируемыеРеквизиты1С,  СписокНередактируемыеРеквизиты1С;
	
	МассивНередактируемыеРеквизиты = Новый Массив;
	Попытка
		МассивНередактируемыеРеквизиты = МенеджерОбъектаПоСсылке(ОбъектДанных).РеквизитыНередактируемыеВГрупповойОбработке();
	Исключение
		МассивНередактируемыеРеквизиты = Новый Массив;
	КонецПопытки;
	
	МассивНередактируемыеРеквизиты1С = ПроверитьМассивРеквизитовПоМетаданным1С(МассивНередактируемыеРеквизиты, ОбъектДанных);
	
	СписокНередактируемыеРеквизиты1С = Новый СписокЗначений;
	СписокНередактируемыеРеквизиты1С.ЗагрузитьЗначения(МассивНередактируемыеРеквизиты1С);
	
	Возврат СписокНередактируемыеРеквизиты1С;
	
КонецФункции

// 25.03.2016. Проверка (и корректировка при необходимости) массива реквизитов на существование в метаданных объекта.
// &НаСервере.
Функция ПроверитьМассивРеквизитовПоМетаданным1С(Знач МассивРеквизитов, ОбъектДанных) Экспорт
	Перем ИмяРеквизита, НовыйМассив;
	
	НовыйМассив = Новый Массив();
	Для Каждого ИмяРеквизита ИЗ МассивРеквизитов Цикл
		Если НЕ ЕстьРеквизитОбъекта1С(ИмяРеквизита, ОбъектДанных) Тогда
			Продолжить;
		КонецЕсли;
		НовыйМассив.Добавить(ИмяРеквизита);
	КонецЦикла;
	
	Возврат НовыйМассив;
	
КонецФункции

// 25.03.2016. Возвращает менеджер объекта по ссылке на объект.
//
// Не обрабатываются точки маршрутов бизнес-процессов
//
// Параметры:
//  Ссылка       - ссылка на объект, - элемент справочника, документ, ...
//
// Возвращаемое значение:
//  СправочникМенеджер, ДокументМенеджер, ...
// 
// &НаСервере.
Функция МенеджерОбъектаПоСсылке(Ссылка) Экспорт
	
	ИмяОбъекта = Ссылка.Метаданные().Имя;
	ТипСсылки = ТипЗнч(Ссылка);
	
	Если Справочники.ТипВсеСсылки().СодержитТип(ТипСсылки) Тогда
		Возврат Справочники[ИмяОбъекта];
		//
	ИначеЕсли Документы.ТипВсеСсылки().СодержитТип(ТипСсылки) Тогда
		Возврат Документы[ИмяОбъекта];
		//
	ИначеЕсли БизнесПроцессы.ТипВсеСсылки().СодержитТип(ТипСсылки) Тогда
		Возврат БизнесПроцессы[ИмяОбъекта];
		//
	ИначеЕсли ПланыВидовХарактеристик.ТипВсеСсылки().СодержитТип(ТипСсылки) Тогда
		Возврат ПланыВидовХарактеристик[ИмяОбъекта];
		//
	ИначеЕсли ПланыСчетов.ТипВсеСсылки().СодержитТип(ТипСсылки) Тогда
		Возврат ПланыСчетов[ИмяОбъекта];
		//
	ИначеЕсли ПланыВидовРасчета.ТипВсеСсылки().СодержитТип(ТипСсылки) Тогда
		Возврат ПланыВидовРасчета[ИмяОбъекта];
		//
	ИначеЕсли Задачи.ТипВсеСсылки().СодержитТип(ТипСсылки) Тогда
		Возврат Задачи[ИмяОбъекта];
		//
	ИначеЕсли ПланыОбмена.ТипВсеСсылки().СодержитТип(ТипСсылки) Тогда
		Возврат ПланыОбмена[ИмяОбъекта];
		//
	ИначеЕсли Перечисления.ТипВсеСсылки().СодержитТип(ТипСсылки) Тогда
		Возврат Перечисления[ИмяОбъекта];
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

// 05.05.2016. Проверить на существование табличной части в Объекте с учетом стандартных табличных частей.
//
// Параметры:
//  ИмяРеквизита - Строка - имя реквизита;
//  МетаданныеОбъекта - ОбъектМетаданных - объект, в котором требуется проверить наличие реквизита.
//
// Возвращаемое значение:
//  Булево.
//
// &НаСервере.
Функция ЕстьТабличнаяЧастьОбъектаМетаданных1С(Знач ИмяТабличнойЧасти, Знач МетаданныеОбъекта) Экспорт
	Перем СтандартныеТабличныеЧасти;
	Перем Значение, Найдено, ОписаниеОшибки;
	
	Если НЕ ЗначениеЗаполнено(ИмяТабличнойЧасти) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ЭтоСсылка(ТипЗнч(МетаданныеОбъекта)) Тогда
		МетаданныеОбъекта = МетаданныеОбъекта.Метаданные();
	КонецЕсли;
	
	Значение = МетаданныеОбъекта.ТабличныеЧасти.Найти(ИмяТабличнойЧасти);
	Найдено = (НЕ Значение = Неопределено);
	Если НЕ Найдено Тогда
		СтандартныеТабличныеЧасти = ЗначениеИзКоллекции1С(МетаданныеОбъекта, "СтандартныеТабличныеЧасти");
		Если СтандартныеТабличныеЧасти = Неопределено Тогда
			Возврат Ложь;
		КонецЕсли;
		Значение = ЗначениеИзКоллекции1С(СтандартныеТабличныеЧасти, ИмяТабличнойЧасти, ОписаниеОшибки);
		Найдено = (НЕ Значение = Неопределено);
	КонецЕсли;
	
	Возврат Найдено;

КонецФункции

Функция ЭтоСтандартнаяТабличнаяЧастьОбъектаМетаданных1С(Знач ИмяТабличнойЧасти, Знач МетаданныеОбъекта) Экспорт
	Перем СтандартныеТабличныеЧасти;
	Перем Значение, Найдено, ОписаниеОшибки;
	
	Если НЕ ЗначениеЗаполнено(ИмяТабличнойЧасти) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	СтандартныеТабличныеЧасти = ЗначениеИзКоллекции1С(МетаданныеОбъекта, "СтандартныеТабличныеЧасти");
	Если СтандартныеТабличныеЧасти = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Значение = ЗначениеИзКоллекции1С(СтандартныеТабличныеЧасти, ИмяТабличнойЧасти, ОписаниеОшибки);
	Найдено = (НЕ Значение = Неопределено);
	
	Возврат Найдено;
	
КонецФункции

Функция ЭтоТабличнаяЧастьОбъектаМетаданных1С(Знач ИмяТабличнойЧасти, Знач МетаданныеОбъекта) Экспорт
	Перем Значение, Найдено, ОписаниеОшибки;
	
	Если НЕ ЗначениеЗаполнено(ИмяТабличнойЧасти) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Значение = МетаданныеОбъекта.ТабличныеЧасти.Найти(ИмяТабличнойЧасти);
	Найдено = (НЕ Значение = Неопределено);
	
	Возврат Найдено;
	
КонецФункции

СтрокаРавно = "================================================================================================================================================================";
#КонецЕсли
