&НаКлиенте
Функция ПолучитьСсылкуMailToДляПисьмаРазработчику()
	
	//Справка по mailto: 'http://htmlcoder.visions.ru/HTML/?13'
	Возврат "mailto:sensey.master@gmail.com?"
			+ "subject=" + НазваниеРазработки
			+ "&body=<Содержимое письма>";
	
КонецФункции
			
&НаСервере
Процедура ЗаполнитьСведенияОРазработке()

	НазваниеРазработки = "Избранное работы пользователя";	
	ВерсияРазработки = "1.0.2";
	ДатаСборки = '20101125';
	АдресРазработки = "http://infostart.ru/public/78599/";
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьСведенияОРазработке();
	
	Заголовок = НазваниеРазработки;
	Элементы.ВерсияРазработки.Заголовок = "Версия " + ВерсияРазработки + " (" + Формат(ДатаСборки, "ДЛФ=DD") + ")";
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСтраницуРазработки()

	WshShell = Новый COMObject("WScript.Shell");
	WshShell.Run(АдресРазработки);
	
КонецПроцедуры //

&НаКлиенте
Процедура ПерейтиНаСтраницуРазработки(Команда)
	
	ОткрытьСтраницуРазработки();
	
КонецПроцедуры

&НаКлиенте
Процедура ПоставитьПлюсРазработке(Команда)
	
	WshShell = Новый COMObject("WScript.Shell");
	WshShell.Run(АдресРазработки + "?rate=1"); 
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияКопирайтНажатие(Элемент)
	
	ЗапуститьПриложение(ПолучитьСсылкуMailToДляПисьмаРазработчику());
	
КонецПроцедуры
