
Функция СведенияОВнешнейОбработке() Экспорт
	
	ПараметрыРегистрации = Новый Структура;
	МассивНазначений = Новый Массив;
	МассивНазначений.Добавить("Документ.РасходныйОрдерНаТовары"); //Указываем документ к которому делаем внешнюю печ. форму
	
	ПараметрыРегистрации = ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке("2.2.2.1");
	ПараметрыРегистрации.Вид          = ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиЗаполнениеОбъекта();
	ПараметрыРегистрации.Наименование = Метаданные().Представление();
	ПараметрыРегистрации.Версия       = Метаданные().Комментарий;
	ПараметрыРегистрации.Назначение   = МассивНазначений;
	ПараметрыРегистрации.БезопасныйРежим = Ложь;
	
	ДобавитьКоманду(ПараметрыРегистрации.Команды, "Установить статус ""Отгружен""", "УстановитьСстатусОтгружен", ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыЗаполнениеФормы(), Ложь);
		
	Возврат ПараметрыРегистрации;	
		
КонецФункции

Процедура ДобавитьКоманду(ТаблицаКоманд, Представление, Идентификатор, Использование, ПоказыватьОповещение = Ложь, Модификатор = "")
	
	НоваяКоманда = ТаблицаКоманд.Добавить();
	НоваяКоманда.Представление = Представление;
	НоваяКоманда.Идентификатор = Идентификатор;
	НоваяКоманда.Использование = Использование;
	НоваяКоманда.ПоказыватьОповещение = ПоказыватьОповещение;
	НоваяКоманда.Модификатор = Модификатор;
	
КонецПроцедуры

Процедура ВыполнитьКоманду(ИдентификаторКоманды, ОбъектыНазначения, ПараметрыКоманды) Экспорт
	
	Если НЕ Пользователи.РолиДоступны("_ПриниматьСкладскиеДокументыВручнуюРасходныйОрдер") Тогда
		Сообщить("Недосточно прав");
		Возврат;
	КонецЕсли;	
	
	ДокументОбъект = ПараметрыКоманды.ЭтаФорма.Объект;
	Если Ложь Тогда
		ДокументОбъект = Документы.РасходныйОрдерНаТовары.СоздатьДокумент();
	КонецЕсли;;	
	
	ДокументОбъект.Статус = Перечисления.СтатусыРасходныхОрдеров.Отгружен;
	
	Для каждого СтрокаТЧ из ДокументОбъект.ОтгружаемыеТовары Цикл
		
		Если НЕ ЗначениеЗаполнено(СтрокаТЧ.Серия) Тогда
			СтрокаТЧ.СтатусУказанияСерий = 0;
		КонецЕсли;
		
		СтрокаТЧ.Действие = Перечисления.ДействияСоСтрокамиОрдеровНаОтгрузку.Отгрузить;
		
	КонецЦикла;	
	
	ПараметрыКоманды.ЭтаФорма.Модифицированность = Истина;
	
КонецПроцедуры	
	