НаСервере
Процедура ЗаполнитьНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Параметры.Вставить("Номенклатура", Объект.Номенклатура);
	Запрос.Параметры.Вставить("Свойство",     Объект.СвойствоТолщина);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ХарактеристикиНоменклатурыДополнительныеРеквизиты.Ссылка КАК Характеристика,
	|	ХарактеристикиНоменклатурыДополнительныеРеквизиты.Значение КАК Толщина
	|ИЗ
	|	Справочник.ХарактеристикиНоменклатуры.ДополнительныеРеквизиты КАК ХарактеристикиНоменклатурыДополнительныеРеквизиты
	|ГДЕ
	|	ХарактеристикиНоменклатурыДополнительныеРеквизиты.Свойство = &Свойство
	|	И ХарактеристикиНоменклатурыДополнительныеРеквизиты.Ссылка.Владелец = &Номенклатура";
	
	Таблица = Запрос.Выполнить().Выгрузить();
	Объект.Таблица.Загрузить(Таблица);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСвойства(Команда)
	ДобавитьСвойстваНаСервере();
КонецПроцедуры

&НаСервере
Процедура ДобавитьСвойстваНаСервере()
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	Макет = ОбработкаОбъект.ПолучитьМакет("Кубатура");
	
	СоответствиеКоличествоЛистов = Новый Соответствие;
	СоответствиеОбъемПачки = Новый Соответствие;
	
	// Для участка 13 = 1.1227
	// 15 - 14 = 1.030
	// 14 - 13 = 1.090
	Если Коэффициент = 0 Тогда
		Коэффициент = 1;
	КонецЕсли;	
	
	Для Счетчик = 1 по Макет.ВысотаТаблицы Цикл
		
		Толщина = Число(Макет.Область(Счетчик, 1, Счетчик, 1).Текст);
		КоличествоЛистов = Число(Макет.Область(Счетчик, 2, Счетчик, 2).Текст);
		ОбъемПачки = Число(Макет.Область(Счетчик, 3, Счетчик, 3).Текст) * Коэффициент;
		
		СоответствиеКоличествоЛистов.Вставить(Толщина, КоличествоЛистов);
		СоответствиеОбъемПачки.Вставить(Толщина, ОбъемПачки);
		
	КонецЦикла;	
	
	Для каждого СтрокаТЧ из Объект.Таблица Цикл
		
		 ХарактеристикаОбъект = СтрокаТЧ.Характеристика.ПолучитьОбъект();
		 ДобавитьСвойство(ХарактеристикаОбъект, Объект.СвойствоКоличесвтоЛистов, СоответствиеКоличествоЛистов[СтрокаТЧ.Толщина]);
		 ДобавитьСвойство(ХарактеристикаОбъект, Объект.СвойствоОбъемПачки, СоответствиеОбъемПачки[СтрокаТЧ.Толщина]);
		 
		 ХарактеристикаОбъект.Записать();
		 
	КонецЦикла;
	
КонецПроцедуры

Процедура ДобавитьСвойство(СпрОбъект, Свойство, Значение)
	
	Если Значение = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	
	Если Ложь Тогда
		СпрОбъект = Справочники.ХарактеристикиНоменклатуры.СоздатьЭлемент();
	КонецЕсли;	
	
	СтрокаТЧ = СпрОбъект.ДополнительныеРеквизиты.Найти(Свойство, "Свойство");
	Если СтрокаТЧ = Неопределено Тогда
		СтрокаТЧ = СпрОбъект.ДополнительныеРеквизиты.Добавить();
		СтрокаТЧ.Свойство = Свойство;
	КонецЕсли;	
		
	СтрокаТЧ.Значение = Значение;	
	
КонецПроцедуры	