Функция СведенияОВнешнейОбработке() Экспорт
	
	РегистрационныеДанные = Новый Структура;
 	РегистрационныеДанные.Вставить("Вид", "ДополнительныйОтчет");
 	РегистрационныеДанные.Вставить("Наименование", "Сравнение начислений (Дополнительный)");
 	РегистрационныеДанные.Вставить("Версия", "0.1");
 	РегистрационныеДанные.Вставить("БезопасныйРежим", Ложь);
 	РегистрационныеДанные.Вставить("Информация", "Сравнение начислений (Дополнительный)");
	
	ТЗКоманды = Новый ТаблицаЗначений;
 	ТЗКоманды.Колонки.Добавить("Идентификатор");
 	ТЗКоманды.Колонки.Добавить("Представление");
 	ТЗКоманды.Колонки.Добавить("Модификатор");
 	ТЗКоманды.Колонки.Добавить("ПоказыватьОповещение");
 	ТЗКоманды.Колонки.Добавить("Использование");    
	
	СтрокаКоманды = ТЗКоманды.Добавить();
 	СтрокаКоманды.Представление = "Сравнение начислений (Дополнительный)";
 	СтрокаКоманды.ПоказыватьОповещение = Ложь;
 	СтрокаКоманды.Использование = "ОткрытиеФормы";
 	СтрокаКоманды.Идентификатор = "Сравнение начислений (Дополнительный)";    
 	РегистрационныеДанные.Вставить("Команды", ТЗКоманды);    
 	Возврат РегистрационныеДанные;
	
КонецФункции	
