НаКлиенте
Процедура СписокПередНачаломИзменения(Элемент, Отказ)
	
	Отказ = Истина;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Ключ", Элементы.Список.ТекущаяСтрока);	
	
	ОткрытьФорму("ВнешняяОбработка.РазмерыГосПособий.Форма.ФормаЗаписи", ПараметрыФормы);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьКлючЗаписи()
	
	ТекущиеДанные = Элементы.Список.ТекущаяСтрока;
	
	Структура = Новый Структура("Период", ТекущиеДанные.Период);
	
	Возврат РегистрыСведений.РазмерыГосударственныхПособий.СоздатьКлючЗаписи(Структура);
	
КонецФункции

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	
	ПараметрыФормы = Новый Структура;
//	ПараметрыФормы.Вставить("Ключ", Элементы.Список.ТекущаяСтрока);	
	
	ОткрытьФорму("ВнешняяОбработка.РазмерыГосПособий.Форма.ФормаЗаписи", ПараметрыФормы);
	
КонецПроцедуры
