
Процедура ПриСозданииНаСервере_ФормаЭлемента(Форма, Отказ, СтандартнаяОбработка) Экспорт
	
	Объект = Форма.Объект;
	
	Для каждого СтрокаТЗ из Форма.Свойства_ОписаниеДополнительныхРеквизитов Цикл
		
		Элемент = Форма.Элементы.Найти(СтрокаТЗ.ИмяРеквизитаЗначение);
		Элемент.УстановитьДействие("ПриИзменении", "_СвойствоПриИзменении");
		
	КонецЦикла;	
		
КонецПроцедуры

Процедура СвойствоПриИзменении(Форма, ЭлементИмя) Экспорт
	
	ЗначенияСвойств     = Новый Соответствие;
	НаименованияСвойств = Новый Соответствие;
	РеквизитыСвойств    = Новый Соответствие;
	Для каждого СтрокаТЗ из Форма.Свойства_ОписаниеДополнительныхРеквизитов Цикл
		
		НаименованияСвойств.Вставить(СтрокаТЗ.ИмяРеквизитаЗначение, СтрокаТЗ.Наименование);
		ЗначенияСвойств.Вставить(СтрокаТЗ.Наименование, Форма[СтрокаТЗ.ИмяРеквизитаЗначение]);
		РеквизитыСвойств.Вставить(СтрокаТЗ.Наименование, СтрокаТЗ.ИмяРеквизитаЗначение);
		
	КонецЦикла;	
	
	Если НаименованияСвойств[ЭлементИмя] = "Количество листов" Тогда
		
		Длина   = ПолучитьДлину(, ЗначенияСвойств);
		Ширина  = ПолучитьШирину(, ЗначенияСвойств);
		Толщина = ПолучитьТолщину(, ЗначенияСвойств);
		КолвоЛистов = ЗначенияСвойств["Количество листов"]; 
		
		ОбъемПачки = _ОбщегоНазначенияДоп.ПолучитьОбъемПачки(Длина, Ширина, Толщина, КолвоЛистов);
		
		Реквизит = РеквизитыСвойств["Объем пачки"];
		Если Реквизит <> Неопределено Тогда
			Форма[Реквизит] = ОбъемПачки;
		КонецЕсли;	
		
	КонецЕсли;
	
	
КонецПроцедуры

Функция ПолучитьДлину(Знач Характеристика = Неопределено, Знач ЗначенияСвойств = Неопределено) Экспорт
	
	МассивСвойств = Новый Массив;
	МассивСвойств.Добавить("1 Длина числом");
	
	Значение = _ОбщегоНазначенияДоп.ПолучитьДопРеквизитИзСписка(Характеристика, ЗначенияСвойств, МассивСвойств);
	Возврат _ОбщегоНазначенияДоп.вЧисло(Значение);
	
КонецФункции

Функция ПолучитьШирину(Знач Характеристика = Неопределено, Знач ЗначенияСвойств = Неопределено) Экспорт
	
	МассивСвойств = Новый Массив;
	МассивСвойств.Добавить("2 Ширина числом");
	
	Значение = _ОбщегоНазначенияДоп.ПолучитьДопРеквизитИзСписка(Характеристика, ЗначенияСвойств, МассивСвойств);
	Возврат _ОбщегоНазначенияДоп.вЧисло(Значение);
	
КонецФункции

Функция ПолучитьТолщину(Знач Характеристика = Неопределено, Знач ЗначенияСвойств = Неопределено) Экспорт
	
	МассивСвойств = Новый Массив;
	МассивСвойств.Добавить("3 Толщина числом с дробью");
	
	Значение = _ОбщегоНазначенияДоп.ПолучитьДопРеквизитИзСписка(Характеристика, ЗначенияСвойств, МассивСвойств);
	Возврат _ОбщегоНазначенияДоп.вЧисло(Значение);
	
КонецФункции

Функция ПолучитьРадиус(Знач Характеристика = Неопределено, Знач ЗначенияСвойств = Неопределено) Экспорт
	
	МассивСвойств = Новый Массив;
	МассивСвойств.Добавить("4 Радиус числом");
	
	Значение = _ОбщегоНазначенияДоп.ПолучитьДопРеквизитИзСписка(Характеристика, ЗначенияСвойств, МассивСвойств);
	Возврат _ОбщегоНазначенияДоп.вЧисло(Значение);
	
КонецФункции

Функция ПолучитьОбъемПачки(Знач Характеристика = Неопределено, Знач ЗначенияСвойств = Неопределено) Экспорт
	
	МассивСвойств = Новый Массив;
	МассивСвойств.Добавить("Объем пачки");
	
	Значение = _ОбщегоНазначенияДоп.ПолучитьДопРеквизитИзСписка(Характеристика, ЗначенияСвойств, МассивСвойств);
	Возврат _ОбщегоНазначенияДоп.вЧисло(Значение);
	
КонецФункции

Функция ПолучитьКоличествоЛистов(Знач Характеристика = Неопределено, Знач ЗначенияСвойств = Неопределено) Экспорт
	
	МассивСвойств = Новый Массив;
	МассивСвойств.Добавить("Количество листов");
	
	Значение = _ОбщегоНазначенияДоп.ПолучитьДопРеквизитИзСписка(Характеристика, ЗначенияСвойств, МассивСвойств);
	Возврат _ОбщегоНазначенияДоп.вЧисло(Значение);
	
КонецФункции
