ваБиблиотека Из СведенияОбОбновлении.ДеревоОбработчиков.Строки Цикл
		Для Каждого СтрокаДереваВерсия Из СтрокаДереваБиблиотека.Строки Цикл
			Для Каждого СтрокаОбработчика Из СтрокаДереваВерсия.Строки Цикл
				
				Если Не ПустаяСтрока(СтрокаПоиска) Тогда
					Если Не ПустаяСтрока(СтрокаОбработчика.Комментарий) Тогда
						Если СтрНайти(ВРег(СтрокаОбработчика.Комментарий), ВРег(СтрокаПоиска)) = 0 Тогда
							Продолжить;
						КонецЕсли;
					Иначе
						Если СтрНайти(ВРег(СтрокаОбработчика.ИмяОбработчика), ВРег(СтрокаПоиска)) = 0 Тогда
							Продолжить;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
				стрИмяОбработчика = ВРег(СтрокаОбработчика.ИмяОбработчика);
				СтрокаДереваВерсия.Строки.Удалить(СтрокаОбработчика);
				ЭтаФорма.Элементы.рфРезультат.Заголовок = "Удалена строка: "+ стрИмяОбработчика;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	МенеджерКонстанты = Константы.СведенияОбОбновленииИБ.СоздатьМенеджерЗначения();
	МенеджерКонстанты.Значение = Новый ХранилищеЗначения(СведенияОбОбновлении);
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(МенеджерКонстанты);
КонецПроцедуры

&НаКлиенте
Процедура кВыполнить(Команда)
	кВыполнитьНаСервере();
КонецПроцедуры

