НаСервереБезКонтекста
Процедура Команда1НаСервере()
	
	Счет = ПланыСчетов.Хозрасчетный.НайтиПоКоду("02.03");
	УстановитьРодителя(Счет, 3);
	
	Счет = ПланыСчетов.Хозрасчетный.НайтиПоКоду("02.04");
	УстановитьРодителя(Счет, 4);
	
	Счет = ПланыСчетов.Хозрасчетный.НайтиПоКоду("02.05");
	УстановитьРодителя(Счет, 5);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УстановитьРодителя(Счет, Код)
	
	СчетОбъект = Счет.ПолучитьОбъект();
	
	Если Ложь Тогда
		СчетОбъект = ПланыСчетов.Хозрасчетный.СоздатьСчет();
	КонецЕсли;	
	
	СчетОбъект.Родитель = ПланыСчетов.Хозрасчетный.НайтиПоКоду("02.01");
	СчетОбъект.Код = "02.01." + Код;
	СчетОбъект.КодБыстрогоВыбора = СтрЗаменить(СчетОбъект.Код, ".", "");
	СчетОбъект.Записать();
	
КонецПроцедуры
