
&НаСервере
Функция СведенияОВнешнейОбработке() Экспорт

	РегистрационныеДанные = Новый Структура;

	РегистрационныеДанные.Вставить("Наименование", "Выгрузка в перечень льготных профессий");
	РегистрационныеДанные.Вставить("БезопасныйРежим", Ложь);
	РегистрационныеДанные.Вставить("Версия", "10.06.15");

	РегистрационныеДанные.Вставить("Вид", "ДополнительнаяОбработка");
	РегистрационныеДанные.Вставить("Информация", "Выгрузка в перечень льготных профессий (формат 1.15)");

	тзКоманд = Новый ТаблицаЗначений;

	тзКоманд.Колонки.Добавить("Идентификатор");
	тзКоманд.Колонки.Добавить("Представление");
	тзКоманд.Колонки.Добавить("ПоказыватьОповещение");
	тзКоманд.Колонки.Добавить("Использование");
	тзКоманд.Колонки.Добавить("Модификатор");

	строкаКоманды = тзКоманд.Добавить();
	строкаКоманды.Идентификатор = "Выгрузка в перечень льготных профессий";
	строкаКоманды.Представление = "Выгрузка в перечень льготных профессий";
	строкаКоманды.ПоказыватьОповещение = Ложь;
	строкаКоманды.Использование = "ВызовКлиентскогоМетода";
	строкаКоманды.Модификатор = "";

	РегистрационныеДанные.Вставить("Команды", тзКоманд);

	МассивНазначений = Новый Массив;

	РегистрационныеДанные.Вставить("Назначение", МассивНазначений);

	Возврат РегистрационныеДанные;

КонецФункции 
