&НаСервере
Процедура ЗаполнитьСписокГрупп(Приемник, Источник)
	
	ЭлементыПриемника = Приемник.ПолучитьЭлементы();
	ЭлементыИсточника = Источник.ПолучитьЭлементы();
	
	Для каждого ЭлКоллекции Из ЭлементыИсточника Цикл
		Если НЕ ЭлКоллекции.ЭтоГруппа Тогда
			Продолжить;
		КонецЕсли; 
		ИндексВСписке = ЭлКоллекции.ПолучитьИдентификатор();
		Если ИндексВСписке = ТекущаяГруппаСсылок Тогда
			// Нельзя переместить группу в коллекцию своих строк
			Продолжить;
		КонецЕсли; 
		
		НоваяГруппа = ЭлементыПриемника.Добавить();
		НоваяГруппа.Представление = ЭлКоллекции.Представление;
		НоваяГруппа.ИндексВСписке = ИндексВСписке;
		
		ЗаполнитьСписокГрупп(ЭлКоллекции, НоваяГруппа);
	КонецЦикла; 
	
КонецПроцедуры
 

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СписокСсылок = Параметры.СписокСсылок;
	ТекущаяГруппаСсылок = Параметры.ТекущаяГруппаСсылок;
	
	ЭлементыПриемника = СписокГрупп.ПолучитьЭлементы();
	НоваяГруппа = ЭлементыПриемника.Добавить();
	НоваяГруппа.Представление = "<Верхний уровень>";
	НоваяГруппа.ИндексВСписке = -1;
	
	ЗаполнитьСписокГрупп(НоваяГруппа, СписокСсылок);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокГруппВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Закрыть(СписокГрупп.НайтиПоИдентификатору(ВыбраннаяСтрока).ИндексВСписке);
	
КонецПроцедуры
