
Функция СоздатьНаОснованииТабельУчетаРабочегоВремени(ОписаниеКоманды) Экспорт
	
	Основание = ОписаниеКоманды.ОбъектыОснований[0];
	Табель = _ОбщегоНазначенияДоп.ПолучитьТабельПоОснованию(Основание);
	Если ЗначениеЗаполнено(Табель) Тогда
		ПоказатьЗначение(, Табель);
	Иначе
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Основание", Основание);
		ОткрытьФорму("Документ.ТабельУчетаРабочегоВремени.ФормаОбъекта", ПараметрыФормы);
	КонецЕсли;	
	
КонецФункции	

Функция СоздатьНаОснованииГрупповоеСозданиеСписанийБезналичныхДС(ОписаниеКоманды) Экспорт
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ОбъектыОснований", ОписаниеКоманды.ОбъектыОснований);
	
	ОткрытьФорму("Обработка._ГрупповоеСозданиеСписанийБезналичныхДС.Форма", ПараметрыФормы);
	
КонецФункции	