Процедура ЗаполнитьДерево()
	Стр = Дерево.Строки.Добавить();
	Стр.Имя = "Справочники";
	Стр.Представление = "Справочники";
	Стр.Картинка = "Справочник";
	
	ЗаполнитьДеревоПоМетаданным(Стр);
	УстановитьПометкуГруппы(Стр);
	
	Стр = Дерево.Строки.Добавить();
	Стр.Имя = "Документы";
	Стр.Представление = "Документы";
	Стр.Картинка = "ДокументОбъект";
	
	ЗаполнитьДеревоПоМетаданным(Стр);
	УстановитьПометкуГруппы(Стр);
	
	Стр = Дерево.Строки.Добавить();
	Стр.Имя = "РегистрыСведений";
	Стр.Представление = "Регистры сведений";
	Стр.Картинка = "РегистрСведений";
	
	ЗаполнитьДеревоПоМетаданным(Стр);
	УстановитьПометкуГруппы(Стр);
	
	Стр = Дерево.Строки.Добавить();
	Стр.Имя = "РегистрыНакопления";
	Стр.Представление = "Регистры накопления";
	Стр.Картинка = "РегистрНакопления";
	
	ЗаполнитьДеревоПоМетаданным(Стр);
	УстановитьПометкуГруппы(Стр);
	
	Стр = Дерево.Строки.Добавить();
	Стр.Имя = "РегистрыБухгалтерии";
	Стр.Представление = "Регистры бухгалтерии";
	Стр.Картинка = "РегистрБухгалтерии";
	
	ЗаполнитьДеревоПоМетаданным(Стр);
	УстановитьПометкуГруппы(Стр);
	
	Стр = Дерево.Строки.Добавить();
	Стр.Имя = "РегистрыРасчета";
	Стр.Представление = "Регистры расчета";
	Стр.Картинка = "РегистрРасчета";
	
	ЗаполнитьДеревоПоМетаданным(Стр);
	УстановитьПометкуГруппы(Стр);
КонецПроцедуры	

Процедура УстановитьПометкуГруппы(Стр)
	Если Стр.Строки.Итог("Пометка") = 0 Тогда
		Стр.Пометка = 0;
	ИначеЕсли Стр.Строки.Итог("Пометка") = Стр.Строки.Количество() Тогда
		Стр.Пометка = 1;
	Иначе
		Стр.Пометка = 2;
	КонецЕсли;	
КонецПроцедуры	

Процедура ЗаполнитьДеревоПоМетаданным(Стр)
	Для Каждого мОбъект ИЗ Метаданные[Стр.Имя] Цикл
		НоваяСтр = Стр.Строки.Добавить();
		НоваяСтр.Имя = Стр.Имя + "." + мОбъект.Имя;
		НоваяСтр.Представление = мОбъект.Представление();
		
		Если ВыбранныеМетаданные.НайтиПоЗначению(НоваяСтр.Имя) <> Неопределено Тогда
			НоваяСтр.Пометка = 1;
		КонецЕсли;	
		НоваяСтр.Картинка = Стр.Картинка;
	КонецЦикла;	
КонецПроцедуры	

Процедура ДобавитьВыбранныеВСписок(Строки)
	Для Каждого Стр ИЗ Строки Цикл
		Если Стр.Пометка <> 0 Тогда
			ВыбранныеМетаданные.Добавить(Стр.Имя);
			ДобавитьВыбранныеВСписок(Стр.Строки);
		КонецЕсли;	
	КонецЦикла;	
КонецПроцедуры	

Процедура КнопкаВыполнитьНажатие(Кнопка)
	ВыбранныеМетаданные.Очистить();
	ДобавитьВыбранныеВСписок(Дерево.Строки);
	Закрыть();
КонецПроцедуры

Процедура ПередОткрытием(Отказ, СтандартнаяОбработка)
	ЗаполнитьДерево();
КонецПроцедуры

Процедура ДеревоПриВыводеСтроки(Элемент, ОформлениеСтроки, ДанныеСтроки)
	ОформлениеСтроки.Ячейки.Представление.УстановитьФлажок(ДанныеСтроки.Пометка);
	ОформлениеСтроки.Ячейки.Представление.УстановитьКартинку(БиблиотекаКартинок[ДанныеСтроки.Картинка]);
КонецПроцедуры

Процедура ДеревоПриИзмененииФлажка(Элемент, Колонка)
	ТекСтрока = Элемент.ТекущаяСтрока;
	Если ТекСтрока.Пометка = 2 Тогда
		Текстрока.Пометка = 1;
	Иначе	
		ТекСтрока.Пометка = 1 - ТекСтрока.Пометка;
	КонецЕсли;	
	
	Если ТекСтрока.Строки.Количество() > 0 Тогда
		Для Каждого Стр ИЗ ТекСтрока.Строки Цикл
			Стр.Пометка = ТекСтрока.Пометка;
		КонецЦикла;	
	КонецЕсли;	
	
	Если ТекСтрока.Родитель <> Неопределено Тогда
		УстановитьПометкуГруппы(ТекСтрока.Родитель);
	КонецЕсли;	
КонецПроцедуры
