
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Объект.Период = НачалоМесяца(НачалоМесяца(ТекущаяДата()) - 1);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПредставлениеПериодаРегистрации = ОбщегоНазначенияУТКлиент.ПолучитьПредставлениеПериодаРегистрации(Объект.Период);
	
КонецПроцедуры

#КонецОбласти

#Область ОбщиеПроцедуры

&НаКлиенте
Процедура ПредставлениеПериодаРегистрацииНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Оповещение = Новый ОписаниеОповещения("ПредставлениеПериодаРегистрацииНачалоВыбораЗавершение", ЭтотОбъект);
	ОбщегоНазначенияУТКлиент.НачалоВыбораПредставленияПериодаРегистрации(Элемент,
		СтандартнаяОбработка,
		Объект.Период,
		ЭтаФорма,
		Оповещение);
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеПериодаРегистрацииНачалоВыбораЗавершение(ВыбранныйПериод, ДополнительныеПараметры) Экспорт 
	Если ВыбранныйПериод <> Неопределено Тогда
		Объект.Период = ВыбранныйПериод;
		ПредставлениеПериодаРегистрации = ОбщегоНазначенияУТКлиент.ПолучитьПредставлениеПериодаРегистрации(Объект.Период);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеПериодаРегистрацииРегулирование(Элемент, Направление, СтандартнаяОбработка)
	ОбщегоНазначенияУТКлиент.РегулированиеПредставленияПериодаРегистрации(Направление,
		СтандартнаяОбработка,
		Объект.Период,
		ПредставлениеПериодаРегистрации);
КонецПроцедуры

#КонецОбласти

#Область МаршрутныеЛисты

&НаКлиенте
Процедура МЛВклВсе(Команда)
	
	Для каждого СтрокаТЗ из ТаблицаМаршрутныеЛисты Цикл
		СтрокаТЗ.Пометка = Истина;
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура МЛВыклВсе(Команда)
	
	Для каждого СтрокаТЗ из ТаблицаМаршрутныеЛисты Цикл
		СтрокаТЗ.Пометка = Ложь;
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаМаршрутныеЛистыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Имя = СтрЗаменить(Поле.Имя, "ТаблицаМаршрутныеЛисты", "");
	
	СтрокаТЗ = ТаблицаМаршрутныеЛисты.НайтиПоИдентификатору(ВыбраннаяСтрока);
	ПоказатьЗначение(, СтрокаТЗ[Имя]);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьМЛ(Команда)
	ЗаполнитьМЛНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьМЛНаСервере()
	
	Запрос = Новый ПостроительЗапроса;
	Запрос.Параметры.Вставить("Организация", Объект.Организация);
	Запрос.Параметры.Вставить("Дата1",       НачалоМесяца(Объект.Период));
	Запрос.Параметры.Вставить("Дата2",       КонецМесяца(Объект.Период));
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ИСТИНА КАК Пометка,
	|	Док.Ссылка КАК Документ,
	|	Док.Распоряжение КАК Заказ,
	|	Док.Подразделение
	|ИЗ
	|	Документ.МаршрутныйЛистПроизводства КАК Док
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.МаршрутныйЛистПроизводства.ВыходныеИзделия КАК ДокВыходныеИзделия
	|		ПО (ДокВыходныеИзделия.Ссылка = Док.Ссылка)
	|ГДЕ
	|	Док.Распоряжение.Дата МЕЖДУ &Дата1 И &Дата2
	|	И Док.Проведен
	|	И Док.Организация = &Организация
	|	И Док.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыМаршрутныхЛистовПроизводства.Выполнен)
	|	И ДокВыходныеИзделия.Ссылка ЕСТЬ NULL 
	|{ГДЕ
	|	Док.Подразделение.*}
	|
	|УПОРЯДОЧИТЬ ПО
	|	Док.Дата";
	
	Если ЗначениеЗаполнено(Объект.Подразделение) Тогда
		
		ЭлементОтбора = Запрос.Отбор.Добавить("Подразделение");
		ЭлементОтбора.Установить(Объект.Подразделение, Истина);
		
	КонецЕсли;	
	
	Запрос.Выполнить();
	
	Таблица = Запрос.Результат.Выгрузить();
	ТаблицаМаршрутныеЛисты.Загрузить(Таблица);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьМЛ(Команда)
	
	ПоказатьВопрос(Новый ОписаниеОповещения("ОтменитьМЛОтвет", ЭтотОбъект), "Отменить маршрутные листы?", РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьМЛОтвет(Ответ, ДопПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		
		Состояние("Отмена маршрутных листов");
		ОтменитьМЛСервер();
		Состояние("Маршрутные листы отменены");
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОтменитьМЛСервер()
	
	Для каждого СтрокаТЗ из ТаблицаМаршрутныеЛисты Цикл
		
		Если НЕ СтрокаТЗ.Пометка Тогда
			Продолжить;
		КонецЕсли;	
		
		ДокументОбъект = СтрокаТЗ.Документ.ПолучитьОбъект();
		ДокументОбъект.Статус = Перечисления.СтатусыМаршрутныхЛистовПроизводства.Отменен;
		ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ЗаказыНаПроизводство

&НаКлиенте
Процедура ДеревоЗаказыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтрокаТЗ = ДеревоЗаказы.НайтиПоИдентификатору(ВыбраннаяСтрока);
	ПоказатьЗначение(, СтрокаТЗ.Заказ);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаказыВклВсе(Команда)
	
	Для каждого Строка1 из ДеревоЗаказы.ПолучитьЭлементы() Цикл
		Строка1.Пометка = Истина;
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаказыВыклВсе(Команда)
	
	Для каждого Строка1 из ДеревоЗаказы.ПолучитьЭлементы() Цикл
		Строка1.Пометка = Ложь;
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьЗаказы(Команда)
	
	ЗаполнитьЗаказыНаСервере();
	
	Для каждого Строка1 из ДеревоЗаказы.ПолучитьЭлементы() Цикл
		Элементы.ДеревоЗаказы.Развернуть(Строка1.ПолучитьИдентификатор());
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЗаказыНаСервере()
	
	Запрос = Новый ПостроительЗапроса;
	Запрос.Параметры.Вставить("Организация", Объект.Организация);
	Запрос.Параметры.Вставить("Дата1",       НачалоМесяца(Объект.Период));
	Запрос.Параметры.Вставить("Дата2",       КонецМесяца(Объект.Период));
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Выборка.Заказ КАК Заказ,
	|	Выборка.Номенклатура КАК Номенклатура,
	|	Выборка.Характеристика КАК Характеристика,
	|	Выборка.Назначение,
	|	СУММА(Выборка.КоличествоЗаказ) КАК КоличествоЗаказ,
	|	СУММА(Выборка.КоличествоВыполнено) КАК КоличествоВыполнено,
	|	СУММА(Выборка.КоличествоЗаказ) - СУММА(Выборка.КоличествоВыполнено) КАК КоличествоОсталось
	|ИЗ
	|	(ВЫБРАТЬ
	|		Заказ.Ссылка КАК Заказ,
	|		Заказ.Номенклатура КАК Номенклатура,
	|		Заказ.Характеристика КАК Характеристика,
	|		Заказ.Назначение КАК Назначение,
	|		Заказ.Количество КАК КоличествоЗаказ,
	|		0 КАК КоличествоВыполнено
	|	ИЗ
	|		Документ.ЗаказНаПроизводство.ВыходныеИзделия КАК Заказ
	|	ГДЕ
	|		Заказ.Ссылка.Дата МЕЖДУ &Дата1 И &Дата2
	|		И Заказ.Ссылка.Проведен
	|		И Заказ.Ссылка.Организация = &Организация
	|	{ГДЕ
	|		Заказ.Ссылка.Подразделение.*}
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		МЛ.Ссылка.Распоряжение,
	|		МЛ.Номенклатура,
	|		МЛ.Характеристика,
	|		МЛ.Назначение,
	|		0,
	|		МЛ.Количество
	|	ИЗ
	|		Документ.МаршрутныйЛистПроизводства.ВыходныеИзделия КАК МЛ
	|	ГДЕ
	|		МЛ.Ссылка.Дата МЕЖДУ &Дата1 И &Дата2
	|		И МЛ.Ссылка.Проведен
	|		И МЛ.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыМаршрутныхЛистовПроизводства.Выполнен)
	|	{ГДЕ
	|		МЛ.Ссылка.Подразделение.*}) КАК Выборка
	|
	|СГРУППИРОВАТЬ ПО
	|	Выборка.Заказ,
	|	Выборка.Номенклатура,
	|	Выборка.Характеристика,
	|	Выборка.Назначение
	|
	|ИМЕЮЩИЕ
	|	СУММА(Выборка.КоличествоЗаказ) > СУММА(Выборка.КоличествоВыполнено)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Заказ,
	|	Номенклатура,
	|	Характеристика
	|ИТОГИ
	|	СУММА(КоличествоЗаказ),
	|	СУММА(КоличествоВыполнено),
	|	СУММА(КоличествоОсталось)
	|ПО
	|	Заказ
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	Если ЗначениеЗаполнено(Объект.Подразделение) Тогда
		
		ЭлементОтбора = Запрос.Отбор.Добавить("Подразделение");
		ЭлементОтбора.Установить(Объект.Подразделение, Истина);
		
	КонецЕсли;	
	
	Запрос.Выполнить();
	
	Дерево = Запрос.Результат.Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
	ДеревоЗаказы.ПолучитьЭлементы().Очистить();
	
	Для каждого Строка1 из Дерево.Строки Цикл
		
		НоваяСтрока1 = ДеревоЗаказы.ПолучитьЭлементы().Добавить();	
		ЗаполнитьЗначенияСвойств(НоваяСтрока1, Строка1);
		НоваяСтрока1.Представление = Строка(Строка1.Заказ);
		НоваяСтрока1.Уровень       = 0;
		НоваяСтрока1.Пометка       = Истина;
		
		Для каждого Строка2 из Строка1.Строки Цикл
			
			НоваяСтрока2 = НоваяСтрока1.ПолучитьЭлементы().Добавить();	
			ЗаполнитьЗначенияСвойств(НоваяСтрока2, Строка2);
			НоваяСтрока2.Уровень = 1;
			
			НоваяСтрока2.Представление = Строка(Строка2.Номенклатура);
			Если ЗначениеЗаполнено(Строка2.Характеристика) Тогда
				НоваяСтрока2.Представление = НоваяСтрока2.Представление + ", " + Строка(Строка2.Характеристика);
			КонецЕсли;	
			
			Если ЗначениеЗаполнено(Строка2.Назначение) Тогда
				НоваяСтрока2.Представление = НоваяСтрока2.Представление + ", " + Строка(Строка2.Назначение);
			КонецЕсли;	
			
		КонецЦикла;
		
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура СократитьПроизводство(Команда)
	ПоказатьВопрос(Новый ОписаниеОповещения("СократитьПроизводствоОтвет", ЭтотОбъект), "ОСократить производство?", РежимДиалогаВопрос.ДаНет);
КонецПроцедуры

&НаКлиенте
Процедура СократитьПроизводствоОтвет(Ответ, ДопПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		
		Состояние("Сокращение производства");
		СократитьПроизводствоНаСервере();
		Состояние("Производство сокращено");
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СократитьПроизводствоНаСервере()
	
КонецПроцедуры

#КонецОбласти
