
#Область РегистрацияОбработки

Функция СведенияОВнешнейОбработке() Экспорт //Iternia (&) Geg AddOn Begin
	
	ИмяОбработки	= Метаданные().Имя;
	Синоним			= Метаданные().Синоним;
	Комментарий 	= Метаданные().Комментарий;
	
	ПараметрыРегистрации = Новый Структура;
	ПараметрыРегистрации.Вставить("Вид", ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиДополнительныйОтчет());
	ПараметрыРегистрации.Вставить("Наименование", Синоним);
	ПараметрыРегистрации.Вставить("Версия", "11.2.3.66");
	ПараметрыРегистрации.Вставить("ВерсияБСП", СтандартныеПодсистемыСервер.ВерсияБиблиотеки());
	ПараметрыРегистрации.Вставить("БезопасныйРежим", Ложь);
	ПараметрыРегистрации.Вставить("Разрешения", ПолучитьМассивРазрешений());
	ПараметрыРегистрации.Вставить("Информация", ?(ЗначениеЗаполнено(Комментарий), Синоним, Комментарий));
	
	ТаблицаКоманд = ПолучитьТаблицуКоманд();
	ДобавитьКоманду(ТаблицаКоманд, Синоним, ИмяОбработки, "ОткрытиеФормы");
	
	ПараметрыРегистрации.Вставить("Команды", ТаблицаКоманд);
	
	Возврат ПараметрыРегистрации;
	
КонецФункции //Iternia (&) Geg AddOn End

Функция ПолучитьТаблицуКоманд() //Iternia (&) Geg AddOn Begin
	
	Команды = Новый ТаблицаЗначений;
	Команды.Колонки.Добавить("Представление", Новый ОписаниеТипов("Строка"));
	Команды.Колонки.Добавить("Идентификатор", Новый ОписаниеТипов("Строка"));
	Команды.Колонки.Добавить("Использование", Новый ОписаниеТипов("Строка"));
	Команды.Колонки.Добавить("ПоказыватьОповещение", Новый ОписаниеТипов("Булево"));
	Команды.Колонки.Добавить("Модификатор", Новый ОписаниеТипов("Строка"));
	
	Возврат Команды;
	
КонецФункции //Iternia (&) Geg AddOn End

Процедура ДобавитьКоманду(ТаблицаКоманд, Представление, Идентификатор, Использование, ПоказыватьОповещение = Ложь, Модификатор = "") //Iternia (&) Geg AddOn Begin
	
	НоваяКоманда = ТаблицаКоманд.Добавить();
	НоваяКоманда.Представление = Представление;
	НоваяКоманда.Идентификатор = Идентификатор;
	НоваяКоманда.Использование = Использование;
	НоваяКоманда.ПоказыватьОповещение = ПоказыватьОповещение;
	НоваяКоманда.Модификатор = Модификатор;
	
КонецПроцедуры //Iternia (&) Geg AddOn End

Функция ПолучитьМассивРазрешений() //Iternia (&) Geg AddOn Begin
	
	МассивРазрешений = Новый Массив;
	МассивРазрешений.Добавить(РаботаВБезопасномРежиме.РазрешениеНаИспользованиеПривилегированногоРежима());
	
	Возврат МассивРазрешений;
	
КонецФункции //Iternia (&) Geg AddOn End

#КонецОбласти	
