
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьПоОснованиям(Параметры.ОбъектыОснований);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоОснованиям(ОбъектыОснований)
	
	Если НЕ ЗначениеЗаполнено(ОбъектыОснований) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Параметры.Вставить("ОбъектыОснований", ОбъектыОснований);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА СписаниеДС.Ссылка ЕСТЬ NULL
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Пометка,
	|	Заявка.Ссылка КАК Заявка,
	|	СписаниеДС.Ссылка КАК СписаниеДС
	|ИЗ
	|	Документ.ЗаявкаНаРасходованиеДенежныхСредств КАК Заявка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СписаниеБезналичныхДенежныхСредств КАК СписаниеДС
	|		ПО (СписаниеДС.ЗаявкаНаРасходованиеДенежныхСредств = Заявка.Ссылка)
	|ГДЕ
	|	СписаниеДС.ЗаявкаНаРасходованиеДенежныхСредств.Ссылка В(&ОбъектыОснований)";
	
	ТаблицаДанных.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры	

&НаКлиенте
Процедура ВклВсе(Команда)
	
	Для каждого СтрокаТЗ из ТаблицаДанных Цикл
		СтрокаТЗ.Пометка = Истина;
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура ВыклВсе(Команда)
	
	Для каждого СтрокаТЗ из ТаблицаДанных Цикл
		СтрокаТЗ.Пометка = Ложь;
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	
	ПоказатьВопрос(Новый ОписаниеОповещения("СформироватьЗавершение", ЭтаФорма), "Сформирвоать документы?", РежимДиалогаВопрос.ДаНет,, КодВозвратаДиалога.Да);
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		СформироватьНаСервере();
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура СформироватьНаСервере()
	
	
КонецПроцедуры


