////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

Процедура ПриОткрытии(Отказ)
	
	ОбновитьКартуМаршрута();
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

Процедура ОМОбновить(Кнопка)
	
	ОбновитьКартуМаршрута();
	
КонецПроцедуры

Процедура ЗадачиВТочкеМаршрута(Кнопка)
	
	ОткрытьСписокЗадачТочкиМаршрута();
	
КонецПроцедуры

Процедура КартаМаршрутаВыбор(Элемент)

	ОткрытьСписокЗадачТочкиМаршрута();
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ВСПОМОГАТЕЛЬНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

Процедура ОбновитьКартуМаршрута()
	
	КартаМаршрута = ЭлементыФормы.КартаМаршрута;

	Если ЗначениеЗаполнено(БизнесПроцесс) Тогда
		КартаМаршрута.УстановитьСхему(БизнесПроцесс.ПолучитьОбъект().ПолучитьКартуМаршрута());
	ИначеЕсли БизнесПроцесс <> Неопределено Тогда
		КартаМаршрута.УстановитьСхему(БизнесПроцессы[БизнесПроцесс.Метаданные().Имя].ПолучитьКартуМаршрута());
	Иначе
		КартаМаршрута = Новый ГрафическаяСхема;
	КонецЕсли;

КонецПроцедуры

Процедура ОткрытьСписокЗадачТочкиМаршрута()
	
	ОчиститьСообщения();
	ТекЭлемент = ЭлементыФормы.КартаМаршрута.ТекущийЭлемент;

	Если НЕ ЗначениеЗаполнено(БизнесПроцесс) Тогда
		ПредупреждениеСообщение(, "Необходимо указать бизнес-процесс.");
		Возврат;
	КонецЕсли;
	
	Если ТекЭлемент = Неопределено ИЛИ
		НЕ (ТипЗнч(ТекЭлемент) = Тип("ЭлементГрафическойСхемыДействие")
		ИЛИ ТипЗнч(ТекЭлемент) = Тип("ЭлементГрафическойСхемыВложенныйБизнесПроцесс")) Тогда
		
			ПредупреждениеСообщение(, "Необходимо выбрать точку действия или вложенный бизнес-процесс карты маршрута.");
		
		Возврат;
	КонецЕсли;

	ЗаголовокФормы = ("Задачи точки маршрута бизнес-процесса");
		
	ОткрытьФорму("Задача." + БизнесПроцесс.Метаданные().Задача.Имя + ".ФормаСписка", 
		Новый Структура("Отбор,ЗаголовокФормы,ПоказыватьЗадачи,ВидимостьОтборов,БлокировкаОкнаВладельца,Задача,БизнесПроцесс", 
			Новый Структура("БизнесПроцесс,ТочкаМаршрута", БизнесПроцесс, ТекЭлемент.Значение),
			ЗаголовокФормы,0,Ложь,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца,Строка(ТекЭлемент.Значение),Строка(БизнесПроцесс)),
		ЭтаФорма, БизнесПроцесс);

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// МОДАЛЬНОЕ/НЕМОДАЛЬНОЕ ПРЕДУПРЕЖДЕНИЕ.
//

Процедура ПредупреждениеСообщение(Оповещение, ТекстПредупрежденияСообщения, Таймаут = 0, Заголовок = "")
	
	Если ИспользоватьРежимМодальности() Тогда
		// Стандартно в модальном режиме (8.2/8.3) с обработкой результата.
		Предупреждение(ТекстПредупрежденияСообщения, Таймаут, Заголовок);
	Иначе
		// Стандартно в немодальном режиме (8.3) с обработкой результата.
		Выполнить("ПоказатьПредупреждение(Оповещение, ТекстПредупрежденияСообщения, Таймаут, Заголовок)");
	КонецЕсли;;
		
КонецПроцедуры

Функция ИспользоватьРежимМодальности()
	Возврат ЭтотОбъект.РежимИспользованияМодальностиБулево;
КонецФункции
