
Процедура ПриСозданииНаСервере_ФормаДокумента(Форма, Отказ, СтандартнаяОбработка) Экспорт
	
	Объект = Форма.Объект;
	
	Элемент = Форма.Элементы.Вставить("_Ответственный", Тип("ПолеФормы"), Форма.Элементы.ГруппаЛево, );
    Элемент.Вид         = ВидПоляФормы.ПолеВвода;
	Элемент.АвтоМаксимальнаяШирина = Ложь;
	Элемент.МаксимальнаяШирина     = Форма.Элементы.Грузоотправитель.МаксимальнаяШирина;
	Элемент.ПутьКДанным = "Объект._Ответственный";
	
	Элемент = Форма.Элементы.Вставить("_НомерКонтейнера", Тип("ПолеФормы"), Форма.Элементы.ГруппаМасса, );
    Элемент.Вид         = ВидПоляФормы.ПолеВвода;
	Элемент.ПутьКДанным = "Объект._НомерКонтейнера";
	Элемент.АвтоМаксимальнаяШирина = Ложь;
	Элемент.МаксимальнаяШирина     = Форма.Элементы.ДоверенностьВыдана.МаксимальнаяШирина;
	
	Элемент = Форма.Элементы.Вставить("_ВодительТелефон", Тип("ПолеФормы"), Форма.Элементы.ГруппаВодитель, Форма.Элементы.ГруппаВодительскоеУдостоверение);
    Элемент.Вид         = ВидПоляФормы.ПолеВвода;
	Элемент.ПутьКДанным = "Объект._ВодительТелефон";
	Элемент.Заголовок   = "Телефон";
	Элемент.АвтоМаксимальнаяШирина = Ложь;
	Элемент.МаксимальнаяШирина     = 30;
	
	Группа = Форма.Элементы.Вставить("_ГруппаЗагрузка", Тип("ГруппаФормы"), Форма.Элементы.ГруппаТранспортныйРазделЛево, );
	Группа.Вид          = ВидГруппыФормы.ОбычнаяГруппа;
	Группа.Отображение  = ОтображениеОбычнойГруппы.Нет;
	Группа.Группировка  = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	Группа.Заголовок    = "Загрузка";
	Группа.ШрифтЗаголовка = Новый Шрифт(,, Истина);
	
	Элемент = Форма.Элементы.Вставить("_ДатаПрибытия", Тип("ПолеФормы"), Группа, );
    Элемент.Вид         = ВидПоляФормы.ПолеВвода;
	Элемент.ПутьКДанным = "Объект._ДатаПрибытия";
	Элемент.ОтображениеПодсказки   = ОтображениеПодсказки.Кнопка;
	Элемент.Подсказка              = "п.22 CMR";
	
	ГруппаВремя = Форма.Элементы.Вставить("_ГруппаЗагрузкаВремя", Тип("ГруппаФормы"), Группа, );
	ГруппаВремя.Вид          = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаВремя.Отображение  = ОтображениеОбычнойГруппы.Нет;
	ГруппаВремя.Группировка  = ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;
	ГруппаВремя.ОтображатьЗаголовок = Ложь;
	
	Элемент = Форма.Элементы.Вставить("_НачалоЗагрузки", Тип("ПолеФормы"), ГруппаВремя, );
    Элемент.Вид         = ВидПоляФормы.ПолеВвода;
	Элемент.ПутьКДанным = "Объект._НачалоЗагрузки";
	Элемент.Заголовок   = "Начало";
	Элемент.ФорматРедактирования   = "ДФ='HH:mm'";
	Элемент.АвтоМаксимальнаяШирина = Ложь;
	Элемент.МаксимальнаяШирина     = 10;
	Элемент.Ширина                 = 10;
	
	Элемент = Форма.Элементы.Вставить("_ОкончаниеЗагрузки", Тип("ПолеФормы"), ГруппаВремя, );
    Элемент.Вид         = ВидПоляФормы.ПолеВвода;
	Элемент.ПутьКДанным = "Объект._ОкончаниеЗагрузки";
	Элемент.Заголовок   = "Окончание";
	Элемент.ФорматРедактирования   = "ДФ='HH:mm'";
	Элемент.АвтоМаксимальнаяШирина = Ложь;
	Элемент.МаксимальнаяШирина     = 10;
	
	Элемент = Форма.Элементы.Вставить("_ФТСПунктПерехода", Тип("ПолеФормы"), Форма.Элементы.ГруппаТранспортныйРазделОсновное, );
    Элемент.Вид         = ВидПоляФормы.ПолеВвода;
	Элемент.ПутьКДанным = "Объект._ФТСПунктПерехода";
	Элемент.АвтоМаксимальнаяШирина = Ложь;
	Элемент.МаксимальнаяШирина     = Форма.Элементы.Перевозчик.МаксимальнаяШирина;
	Элемент.ОтображениеПодсказки   = ОтображениеПодсказки.Кнопка;
	Элемент.Подсказка              = "п.20 CMR" + Символы.ПС + "Особые согласованные условия";
	
	Элемент = Форма.Элементы.Вставить("_ТаможняПокупателя", Тип("ПолеФормы"), Форма.Элементы.ГруппаТранспортныйРазделОсновное, );
    Элемент.Вид         = ВидПоляФормы.ПолеВвода;
	Элемент.ПутьКДанным = "Объект._ТаможняПокупателя";
	Элемент.АвтоМаксимальнаяШирина = Ложь;
	Элемент.МаксимальнаяШирина     = Форма.Элементы.Перевозчик.МаксимальнаяШирина;
	Элемент.ОтображениеПодсказки   = ОтображениеПодсказки.Кнопка;
	Элемент.Подсказка              = "п.13 CMR" + Символы.ПС + "Указания отправителя (таможенная и прочая обработка)";
	
	Элемент = Форма.Элементы.АдресДоставки;
	Элемент.ОтображениеПодсказки   = ОтображениеПодсказки.Кнопка;
	Элемент.Подсказка              = "п.3 CMR";
	
	Элемент = Форма.Элементы.АдресПогрузки;
	Элемент.ОтображениеПодсказки   = ОтображениеПодсказки.Кнопка;
	Элемент.Подсказка              = "п.4 CMR" + Символы.ПС + "Если не указан, то берется адрес организации";
	
КонецПроцедуры

