
&НаКлиенте
Процедура ДатаВыпускаПриИзменении(Элемент)
	ДатаВыпускаПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ДатаВыпускаПриИзмененииНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Параметры.Вставить("Дата", Объект.ДатаВыпуска);
	Запрос.Параметры.Вставить("ПроизводственныйКалендарь", Справочники.ПроизводственныеКалендари.НайтиПоКоду("РФ"));
	
	МассивВидовДней = Новый Массив;
	МассивВидовДней.Добавить(Перечисления.ВидыДнейПроизводственногоКалендаря.Рабочий);
	МассивВидовДней.Добавить(Перечисления.ВидыДнейПроизводственногоКалендаря.Предпраздничный);
	Запрос.Параметры.Вставить("ВидДня", МассивВидовДней);
	
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Выборка.Дата
	|ИЗ
	|	(ВЫБРАТЬ ПЕРВЫЕ 15
	|		Рег.Дата КАК Дата
	|	ИЗ
	|		РегистрСведений.ДанныеПроизводственногоКалендаря КАК Рег
	|	ГДЕ
	|		Рег.ВидДня В(&ВидДня)
	|		И Рег.Дата > &Дата
	|		И Рег.ПроизводственныйКалендарь = &ПроизводственныйКалендарь
	|	
	|	УПОРЯДОЧИТЬ ПО
	|		Дата) КАК Выборка
	|
	|УПОРЯДОЧИТЬ ПО
	|	Выборка.Дата УБЫВ";
	
	Результат = Запрос.Выполнить();
	Если НЕ Результат.Пустой() Тогда
		Объект.КонечныйСрокСПД = Результат.Выгрузить()[0][0];
	КонецЕсли;	
	
КонецПроцедуры
