
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Отчет.ДокументСсылка = Параметры.ОбъектыНазначения[0];
	РеквизитыДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Отчет.ДокументСсылка, "Организация, Соглашение");
	
	Отчет.Соглашение     = РеквизитыДокумента.Соглашение;
	
КонецПроцедуры

&НаСервере
Функция ЗаполнитьОбъект(ДокументОбъект)
	
	Запрос = Новый Запрос;
	Запрос.Параметры.Вставить("Соглашение",  Отчет.Соглашение);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Рег.АналитикаУчетаНоменклатуры.Номенклатура КАК Номенклатура,
	|	Рег.АналитикаУчетаНоменклатуры.Характеристика КАК Характеристика,
	|	Рег.АналитикаУчетаНоменклатуры.Склад КАК Склад,
	|	Рег.КоличествоОстаток КАК Количество,
	|	Рег.КоличествоОстаток КАК КоличествоУпаковок,
	|	ДокТовары.СтавкаНДС,
	|	ДокТовары.Цена,
	|	ДокТовары.Сумма,
	|	ДокТовары.СуммаНДС,
	|	ДокТовары.СуммаСНДС,
	|	ДокТовары.Цена КАК ЦенаПродажи,
	|	ДокТовары.Сумма КАК СуммаПродажи,
	|	ДокТовары.СуммаНДС КАК СуммаПродажиНДС,
	|	ИСТИНА КАК ХарактеристикиИспользуются,
	|	ДокТовары.Ссылка.Дата КАК ДатаСчетаФактурыКомиссионера,
	|	ДокТовары.Ссылка.Номер КАК НомерСчетаФактурыКомиссионера
	|ИЗ
	|	РегистрНакопления.ПартииТоваровПереданныеНаКомиссию.Остатки(, ДокументПередачиНаКомиссию.Соглашение = &Соглашение) КАК Рег
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.Товары КАК ДокТовары
	|		ПО Рег.ДокументПередачиНаКомиссию = ДокТовары.Ссылка
	|			И Рег.АналитикаУчетаНоменклатуры.Номенклатура = ДокТовары.Номенклатура
	|			И Рег.АналитикаУчетаНоменклатуры.Характеристика = ДокТовары.Характеристика
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДокТовары.Ссылка.Дата";
	
	Таблица = Запрос.Выполнить().Выгрузить();
	ДокументОбъект.Товары.Загрузить(Таблица);
	
КонецФункции

&НаКлиенте
Процедура Заполнить(Команда)
	
	Окна = ПолучитьОкна();
	МассивОкон = Новый Массив;
	Для ИндексОкон = 0 По  Окна.Количество() -1 Цикл
		Попытка
			ТекущееОкно = Окна.Получить(ИндексОкон);
			Если  ТипЗнч(ТекущееОкно) = Тип("ОкноКлиентскогоПриложения") ТОгда
				МассивОкон.Добавить(ТекущееОкно);
			КонецЕсли;
		Исключение
		КонецПопытки;
	КонецЦикла;	
	
	Для каждого Окно из МассивОкон Цикл
		
		Если Окно.Основное Тогда
			Продолжить;
		КонецЕсли;	
		
		Попытка
			
			ФормаОбъекта   = Окно.Содержимое[0];
			ДокументОбъект = ФормаОбъекта.Объект;
			
			Если ДокументОбъект.Ссылка = Отчет.ДокументСсылка Тогда	
				
				КопироватьДанныеФормы(ФормаОбъекта.Объект, ДокументОбъект);
				ЗаполнитьОбъект(ДокументОбъект);
				КопироватьДанныеФормы(ДокументОбъект, ФормаОбъекта.Объект);
				
				ФормаОбъекта.Модифицированность = Истина;
				Закрыть();
				
			КонецЕсли;
			
		Исключение
			Продолжить;
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть();
КонецПроцедуры
