
Функция НайтиДокументКорректировку(Комментарий, Дата = '2015-12-31')
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КорректировкаРегистров.Ссылка
	|ИЗ
	|	Документ.КорректировкаРегистров КАК КорректировкаРегистров
	|ГДЕ
	|	НАЧАЛОПЕРИОДА(КорректировкаРегистров.Дата, ДЕНЬ) = &Дата
	|	И КорректировкаРегистров.Комментарий ПОДОБНО &Комментарий";
	
	Запрос.Параметры.Вставить("Дата",        НачалоДня(Дата));
	Запрос.Параметры.Вставить("Комментарий", Комментарий);
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		
		ДокументОбъект = Документы.КорректировкаРегистров.СоздатьДокумент();
		ДокументОбъект.Дата        = Дата;
		ДокументОбъект.Комментарий = Комментарий;
		
	Иначе
		
		ДокументОбъект = Результат.Выгрузить()[0][0].ПолучитьОбъект();
		ДокументОбъект.ПометкаУдаления = Ложь;
		
	КонецЕсли;	
	
	ДокументОбъект.Ответственный = Пользователи.ТекущийПользователь();
	
	Возврат ДокументОбъект;
	
КонецФункции	

&НаСервере
Процедура Сторно62НаСервере()
	
	ДатаДокумента = '2017-01-01';
	
	Запрос = Новый Запрос;
	Запрос.Параметры.Вставить("Руб",    Константы.ВалютаРегламентированногоУчета.Получить());
	Запрос.Параметры.Вставить("Дата",   ДатаДокумента);
	Запрос.Параметры.Вставить("Счет62", ПланыСчетов.Хозрасчетный.НайтиПоКоду("62"));
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	&Дата КАК Период,
	|	РасчетыСКлиентамиПоДокументамОстатки.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	РасчетыСКлиентамиПоДокументамОстатки.ЗаказКлиента КАК ЗаказКлиента,
	|	РасчетыСКлиентамиПоДокументамОстатки.РасчетныйДокумент КАК РасчетныйДокумент,
	|	РасчетыСКлиентамиПоДокументамОстатки.Валюта КАК Валюта,
	|	РасчетыСКлиентамиПоДокументамОстатки.КВозвратуОстаток КАК КВозвратуОстаток,
	|	РасчетыСКлиентамиПоДокументамОстатки.ДолгОстаток КАК Долг,
	|	РасчетыСКлиентамиПоДокументамОстатки.ДолгУпрОстаток КАК ДолгУпр,
	|	РасчетыСКлиентамиПоДокументамОстатки.ДолгРеглОстаток КАК ДолгРегл,
	|	РасчетыСКлиентамиПоДокументамОстатки.ПредоплатаОстаток КАК Предоплата,
	|	РасчетыСКлиентамиПоДокументамОстатки.ПредоплатаУпрОстаток КАК ПредоплатаУпр,
	|	РасчетыСКлиентамиПоДокументамОстатки.ПредоплатаРеглОстаток КАК ПредоплатаРегл,
	|	РасчетыСКлиентамиПоДокументамОстатки.ЗалогЗаТаруОстаток КАК ЗалогЗаТару,
	|	РасчетыСКлиентамиПоДокументамОстатки.ЗалогЗаТаруРеглОстаток КАК ЗалогЗаТаруРегл
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентамиПоДокументам.Остатки(&Дата, ) КАК РасчетыСКлиентамиПоДокументамОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Хозрасчетный.Остатки(&Дата, Счет В ИЕРАРХИИ (&Счет62), , ) КАК ХозрасчетныйОстатки
	|		ПО РасчетыСКлиентамиПоДокументамОстатки.АналитикаУчетаПоПартнерам.Организация = ХозрасчетныйОстатки.Организация
	|			И РасчетыСКлиентамиПоДокументамОстатки.АналитикаУчетаПоПартнерам.Контрагент = ХозрасчетныйОстатки.Субконто1
	|			И РасчетыСКлиентамиПоДокументамОстатки.АналитикаУчетаПоПартнерам.Договор = ХозрасчетныйОстатки.Субконто2
	|ГДЕ
	|	ЕСТЬNULL(ХозрасчетныйОстатки.ВалютнаяСуммаОстаток, 0) = 0
	|	И (РасчетыСКлиентамиПоДокументамОстатки.ДолгОстаток <> 0
	|			ИЛИ РасчетыСКлиентамиПоДокументамОстатки.ДолгУпрОстаток <> 0
	|			ИЛИ РасчетыСКлиентамиПоДокументамОстатки.ДолгРеглОстаток <> 0)
	|	И РасчетыСКлиентамиПоДокументамОстатки.Валюта <> &Руб";
	
	ДокументОбъект =  НайтиДокументКорректировку("Сторно остатков: РасчетыСКлиентамиПоДокументам", ДатаДокумента);
	ДокументОбъект.ПометкаУдаления = Ложь;
	
	ДокументОбъект.ТаблицаРегистров.Очистить();
	НоваяСтрока = ДокументОбъект.ТаблицаРегистров.Добавить();
	НоваяСтрока.Имя = "РасчетыСКлиентамиПоДокументам";
	
	Таблица = Запрос.Выполнить().Выгрузить();
	ДокументОбъект.Движения.РасчетыСКлиентамиПоДокументам.Загрузить(Таблица);
	ДокументОбъект.Записать();
	
	Корректировка = ДокументОбъект.Ссылка;
	
КонецПроцедуры

&НаКлиенте
Процедура Сторно62(Команда)
	Сторно62НаСервере();
КонецПроцедуры
