
&НаКлиенте
Процедура Сформировать(Команда)

	ПоказатьВопрос(Новый ОписаниеОповещения("СформироватьЗавершение", ЭтаФорма), "Запустить обработку?", РежимДиалогаВопрос.ДаНет,, КодВозвратаДиалога.Нет);
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		РасчетыСПоставщикамиНаСервере();
		Состояние("Обработка завершена");
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура РасчетыСПоставщикамиНаСервере()
	
	Запись = РегистрыСведений.ЗаданияКРаспределениюРасчетовСПоставщиками.СоздатьМенеджерЗаписи();
	Запись.Период = Объект.ДатаНачала;
	Запись.АналитикаУчетаПоПартнерам = Объект.Аналитика;
	Запись.Месяц       = Объект.ДатаНачала;
	Запись.Организация = Объект.Организация;
	Запись.Записать();
	
	МассивОрганизаций = Новый Массив;
	МассивОрганизаций.Добавить(Объект.Организация);
	
	МассивАналитик = Новый Массив;
	МассивАналитик.Добавить(Объект.Аналитика);
	
	АналитикиРасчета = РаспределениеВзаиморасчетов.АналитикиРасчета();
	АналитикиРасчета.Организации               = МассивОрганизаций;
	АналитикиРасчета.АналитикиУчетаПоПартнерам = МассивАналитик;
	
	РаспределениеВзаиморасчетов.РаспределитьВсеРасчетыСПоставщиками(Объект.ДатаОкончания, АналитикиРасчета);
	
КонецПроцедуры
