#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Перем Организация, Валюта, ЕдинаяВалюта, ДатаОстатковНачалоДня,
	ПериодПросроченныхПлатежей, ПериодБудущихПлатежей,
	ВыводитьЗаказы, ВыводитьПартнеров, ТолькоПодтвержденныеПлатежи,
	СпособВыводаСтатейДДС;

	
Функция СведенияОВнешнейОбработке() Экспорт
	
	РегистрационныеДанные = Новый Структура;
 	РегистрационныеДанные.Вставить("Вид", "ДополнительныйОтчет");
 	РегистрационныеДанные.Вставить("Наименование", "Платежный календарь (ERP 2.1.2)");
 	РегистрационныеДанные.Вставить("Версия", "0.1");
 	РегистрационныеДанные.Вставить("БезопасныйРежим", Ложь);
 	РегистрационныеДанные.Вставить("Информация", "Платежный календарь (ERP 2.1.2)");
	
	ТЗКоманды = Новый ТаблицаЗначений;
 	ТЗКоманды.Колонки.Добавить("Идентификатор");
 	ТЗКоманды.Колонки.Добавить("Представление");
 	ТЗКоманды.Колонки.Добавить("Модификатор");
 	ТЗКоманды.Колонки.Добавить("ПоказыватьОповещение");
 	ТЗКоманды.Колонки.Добавить("Использование");    
	
	СтрокаКоманды = ТЗКоманды.Добавить();
 	СтрокаКоманды.Представление = "Платежный календарь (ERP 2.1.2)";
 	СтрокаКоманды.ПоказыватьОповещение = Ложь;
 	СтрокаКоманды.Использование = "ОткрытиеФормы";
 	СтрокаКоманды.Идентификатор = "Платежный календарь (ERP 2.1.2)";    
 	РегистрационныеДанные.Вставить("Команды", ТЗКоманды);    
 	Возврат РегистрационныеДанные;
	
КонецФункции	
#Область СлужебныйПрограммныйИнтерфейс

// Настройки общей формы отчета подсистемы "Варианты отчетов".
//
// Параметры:
//   Форма - УправляемаяФорма - Форма отчета.
//   КлючВарианта - Строка - Имя предопределенного варианта отчета или уникальный идентификатор пользовательского.
//   Настройки - Структура - см. возвращаемое значение ОтчетыКлиентСервер.ПолучитьНастройкиОтчетаПоУмолчанию().
//
Процедура ОпределитьНастройкиФормы(Форма, КлючВарианта, Настройки) Экспорт
	Настройки.События.ПриСозданииНаСервере = Истина;
КонецПроцедуры

// Вызывается в обработчике одноименного события формы отчета после выполнения кода формы.
//
// Параметры:
//   Форма - УправляемаяФорма - Форма отчета.
//   Отказ - Передается из параметров обработчика "как есть".
//   СтандартнаяОбработка - Передается из параметров обработчика "как есть".
//
// См. также:
//   "УправляемаяФорма.ПриСозданииНаСервере" в синтакс-помощнике.
//
Процедура ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка) Экспорт
	
	
	// Дополнительные команды
	Элементы = ЭтаФорма.Элементы;
	Команды = ЭтаФорма.Команды;
	ПостоянныеКоманды = ЭтаФорма.ПостоянныеКоманды;
	
	КомандаДобавитьПоступление = Команды.Добавить("ДобавитьПоступление");
	КомандаДобавитьПоступление.Действие = "Подключаемый_Команда";
	КомандаДобавитьПоступление.Заголовок = НСтр("ru= 'Поступление'");
	КомандаДобавитьПоступление.Подсказка = НСтр("ru= 'Добавить планируемое поступление денежных средств.'");
	КомандаДобавитьПоступление.Картинка = БиблиотекаКартинок.ДобавитьЭлементСписка;
	КомандаДобавитьПоступление.Отображение = ОтображениеКнопки.КартинкаИТекст;
	ПостоянныеКоманды.Добавить("ДобавитьПоступление");
	КомандаДобавитьПоступление = Элементы.Вставить("ДобавитьПоступление", Тип("КнопкаФормы"),
		Элементы.ГруппаРаботаВТаблице, Элементы.Найти);
	КомандаДобавитьПоступление.ИмяКоманды = "ДобавитьПоступление";
	
	ГруппаДобавитьПеремещение = Элементы.Вставить("ГруппаДобавитьПеремещение", Тип("ГруппаФормы"),
		Элементы.ГруппаРаботаВТаблице, Элементы.Найти);
	ГруппаДобавитьПеремещение.Заголовок = НСтр("ru= 'Перемещение'");
	ГруппаДобавитьПеремещение.Подсказка = НСтр("ru= 'Добавить распоряжение на перемещение денежных средств.'");
	ГруппаДобавитьПеремещение.Картинка = БиблиотекаКартинок.ДобавитьЭлементСписка;
	
	СписокХозОперацийПеремещения = ПолучитьСписокХозОперацийПеремещения();
	Для каждого ХозОперация из СписокХозОперацийПеремещения.СоответствиеИмениХозОперацииПредставлению Цикл
		КомандаДобавитьПеремещение = Команды.Добавить("ДобавитьПеремещение" + ХозОперация.Ключ);
		КомандаДобавитьПеремещение.Действие = "Подключаемый_Команда";
		ПостоянныеКоманды.Добавить("ДобавитьПеремещение" + ХозОперация.Ключ);
		КомандаДобавитьПеремещение = Элементы.Вставить(ХозОперация.Ключ, Тип("КнопкаФормы"),
			ГруппаДобавитьПеремещение);
		КомандаДобавитьПеремещение.Заголовок = ХозОперация.Значение;
		КомандаДобавитьПеремещение.ИмяКоманды = "ДобавитьПеремещение" + ХозОперация.Ключ;
	КонецЦикла;
	
	// Сохранение списка хоз. операций перемещения денежных средств в реквизит формы
	ЭтаФорма.НастройкиОтчета.Вставить("СписокХозОперацийПеремещения", СписокХозОперацийПеремещения.СоответствиеИмениХозОперацииЗначению);
	

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПользовательскиеНастройкиМодифицированы = Ложь;
	
	УстановитьОбязательныеНастройки(ПользовательскиеНастройкиМодифицированы);
	УстановитьЗаголовкиПолей(ДокументРезультат);
	
	// Подготовим и выведем отчет.
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	
	НастройкиКомпоновкиДанных = КомпоновщикНастроек.ПолучитьНастройки();
		
	МакетКомпоновки = КомпоновщикМакета.Выполнить(
		СхемаКомпоновкиДанных, 
		НастройкиКомпоновкиДанных,
		ДанныеРасшифровки);
		
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	
	ТаблицаПлатежей = ПолучитьТаблицуПланируемыхПлатежей();
	
	ВнешниеНаборыДанных = Новый Структура("ТаблицаПлатежей", ТаблицаПлатежей);
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, ДанныеРасшифровки, Истина);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.НачатьВывод();
	ПроцессорВывода.Вывести(ПроцессорКомпоновки, Истина);
	ПроцессорВывода.ЗакончитьВывод();
	
	ФиксацияСтрокСверху = КомпоновкаДанныхКлиентСервер.ПолучитьПараметр(КомпоновщикНастроек, "ФиксацияСтрокСверху");
	Если ФиксацияСтрокСверху <> Неопределено Тогда
		ДокументРезультат.ФиксацияСверху = ФиксацияСтрокСверху.Значение;
	КонецЕсли;
	
	ФиксацияСтрокСлева = КомпоновкаДанныхКлиентСервер.ПолучитьПараметр(КомпоновщикНастроек, "ФиксацияСтрокСлева");
	Если ФиксацияСтрокСверху <> Неопределено Тогда
		ДокументРезультат.ФиксацияСлева = ФиксацияСтрокСлева.Значение;
	КонецЕсли;
	
	// Сообщим форме отчета, что настройки модифицированы
	Если ПользовательскиеНастройкиМодифицированы Тогда
		КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("ПользовательскиеНастройкиМодифицированы", Истина);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	ПараметрПериодПросроченныхПлатежей = КомпоновкаДанныхКлиентСервер.ПолучитьПараметр(КомпоновщикНастроек, "ПериодПросроченныхПлатежей");
	Если ПараметрПериодПросроченныхПлатежей <> Неопределено Тогда
		Если ЗначениеЗаполнено(ПараметрПериодПросроченныхПлатежей.Значение) Тогда
			Если Дата(ПараметрПериодПросроченныхПлатежей.Значение) > ТекущаяДата() Тогда
				ТекстОшибки = НСтр("ru='Период просроченных платежей не может быть больше текущей даты'");
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, , , , Отказ);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
			
	ПараметрПериодБудущихПлатежей = КомпоновкаДанныхКлиентСервер.ПолучитьПараметр(КомпоновщикНастроек, "ПериодБудущихПлатежей");
	Если ПараметрПериодБудущихПлатежей <> Неопределено Тогда
		Если ЗначениеЗаполнено(ПараметрПериодБудущихПлатежей.Значение) Тогда
			Если Дата(ПараметрПериодБудущихПлатежей.Значение) < НачалоДня(ТекущаяДата()) Тогда
				ТекстОшибки = НСтр("ru='Период будущих платежей не может быть меньше текущей даты'");
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, , , , Отказ);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура УстановитьОбязательныеНастройки(ПользовательскиеНастройкиМодифицированы)
	
	ТекущаяДата = ТекущаяДата();
	ДатаОстатковНачалоДня = НачалоДня(ТекущаяДата);
	ДатаОстатковКонецДня = КонецДня(ТекущаяДата);
	
	ПараметрПериодПросроченныхПлатежей = КомпоновкаДанныхКлиентСервер.ПолучитьПараметр(КомпоновщикНастроек, "ПериодПросроченныхПлатежей");
	Если ПараметрПериодПросроченныхПлатежей <> Неопределено Тогда
		Если Не ЗначениеЗаполнено(ПараметрПериодПросроченныхПлатежей.Значение) Тогда
			КомпоновкаДанныхКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "ПериодПросроченныхПлатежей", ДатаОстатковНачалоДня);
			ПользовательскиеНастройкиМодифицированы = Истина;
		КонецЕсли;
		ПериодПросроченныхПлатежей = Новый СтандартныйПериод(ПараметрПериодПросроченныхПлатежей.Значение, ТекущаяДата);
	КонецЕсли;
	
	ПараметрПериодБудущихПлатежей = КомпоновкаДанныхКлиентСервер.ПолучитьПараметр(КомпоновщикНастроек, "ПериодБудущихПлатежей");
	Если ПараметрПериодБудущихПлатежей <> Неопределено Тогда
		Если Не ЗначениеЗаполнено(ПараметрПериодБудущихПлатежей.Значение) Тогда
			КомпоновкаДанныхКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "ПериодБудущихПлатежей", ДатаОстатковКонецДня);
			ПользовательскиеНастройкиМодифицированы = Истина;
		КонецЕсли;
		ПериодБудущихПлатежей = Новый СтандартныйПериод(ТекущаяДата, ПараметрПериодБудущихПлатежей.Значение);
	КонецЕсли;
	
	ПараметрВалюта = КомпоновкаДанныхКлиентСервер.ПолучитьПараметр(КомпоновщикНастроек, "Валюта");
	Если ПараметрВалюта <> Неопределено Тогда
		Если ПараметрВалюта.Использование Тогда
			Валюта = ПараметрВалюта.Значение;
		КонецЕсли;
	КонецЕсли;
	
	ПараметрДанныеКалендаря = КомпоновкаДанныхКлиентСервер.ПолучитьПараметр(КомпоновщикНастроек, "ДанныеКалендаря");
	Если ПараметрДанныеКалендаря <> Неопределено Тогда
		ВалютаУправленческогоУчета = Константы.ВалютаУправленческогоУчета.Получить();
		ВалютаРегламентированногоУчета = Константы.ВалютаРегламентированногоУчета.Получить();
		Если ПараметрДанныеКалендаря.Значение = 1 Тогда
			ЕдинаяВалюта = ВалютаУправленческогоУчета;
		ИначеЕсли ПараметрДанныеКалендаря.Значение = 2 Тогда
			ЕдинаяВалюта = ВалютаРегламентированногоУчета;
		КонецЕсли;
		КомпоновкаДанныхКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "ЕдинаяВалюта", ЕдинаяВалюта);
	КонецЕсли;
	
	ПараметрОрганизация = КомпоновкаДанныхКлиентСервер.ПолучитьПараметр(КомпоновщикНастроек, "Организация");
	Если ПараметрОрганизация <> Неопределено Тогда
		Если ПараметрОрганизация.Использование Тогда
			Организация = ПараметрОрганизация.Значение;
		КонецЕсли;
	КонецЕсли;
	
	ПараметрВыводитьПартнеров = КомпоновкаДанныхКлиентСервер.ПолучитьПараметр(КомпоновщикНастроек, "ВыводитьПартнеров");
	Если ПараметрВыводитьПартнеров <> Неопределено Тогда
		ВыводитьПартнеров = ПараметрВыводитьПартнеров.Значение;
	КонецЕсли;
	
	ПараметрВыводитьЗаказы = КомпоновкаДанныхКлиентСервер.ПолучитьПараметр(КомпоновщикНастроек, "ВыводитьЗаказы");
	Если ПараметрВыводитьЗаказы <> Неопределено Тогда
		ВыводитьЗаказы = ПараметрВыводитьЗаказы.Значение;
	КонецЕсли;
	
	ПараметрТолькоПодтвержденныеПлатежи = КомпоновкаДанныхКлиентСервер.ПолучитьПараметр(КомпоновщикНастроек, "ТолькоПодтвержденныеПлатежи");
	Если ПараметрТолькоПодтвержденныеПлатежи <> Неопределено Тогда
		ТолькоПодтвержденныеПлатежи = ПараметрТолькоПодтвержденныеПлатежи.Значение;
	КонецЕсли;
	
	ПараметрСпособВыводаСтатейДДС = КомпоновкаДанныхКлиентСервер.ПолучитьПараметр(КомпоновщикНастроек, "СпособВыводаСтатейДДС");
	Если ПараметрСпособВыводаСтатейДДС <> Неопределено Тогда
		СпособВыводаСтатейДДС = ПараметрСпособВыводаСтатейДДС.Значение;
		
		СписокГруппировок = КомпоновкаДанныхКлиентСервер.ПолучитьГруппировки(КомпоновщикНастроек);
		Для каждого Группировка из СписокГруппировок  Цикл
			Если Группировка.Значение.Имя = "ГруппироватьПоСтатьям" Тогда
				Группировка.Значение.Использование = НЕ Булево(ПараметрСпособВыводаСтатейДДС.Значение);
			ИначеЕсли Группировка.Значение.Имя = "СтатьиВСтроках" Тогда
				Группировка.Значение.Использование = Булево(ПараметрСпособВыводаСтатейДДС.Значение);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура УстановитьЗаголовкиПолей(ДокументРезультат)

	Если СпособВыводаСтатейДДС = 1 Тогда
		ПолеДокумент = СхемаКомпоновкиДанных.НаборыДанных.Платежи.Поля.Найти("Документ");
		Если ПолеДокумент <> Неопределено Тогда
			ПолеДокумент.Заголовок = НСтр("ru = 'Статья ДДС, Получатель / Плательщик, Заказ'");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Функция ЗапросПоОстаткамДенежныхСредств()

	Запрос = Новый Запрос(ТекстЗапросаВременнаяТаблицаКурсыВалютПересчетаВЕдинуюВалюту() + "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	1 КАК СтатусПлатежа, // Доступный остаток
	|	ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.Наличные) КАК ТипДенежныхСредств,
	|	&РабочаяДата КАК День,
	|	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаПлатежа,
	|	&Платеж КАК Платеж,
	|	ИСТИНА КАК СтрокаТекущийОстаток,
	|	ДенежныеСредства.Касса КАК БанковскийСчетКасса,
	|	ДенежныеСредства.Касса.ВалютаДенежныхСредств КАК Валюта,
	|	ДенежныеСредства.Организация КАК Организация,
	|	0 КАК СуммаНачальныйОстаток,
	|	ДенежныеСредства.СуммаОстаток КАК СуммаКонечныйОстаток,
	|	0 КАК Сумма,
	|	0 КАК СуммаНачальныйОстатокУтв,
	|	ДенежныеСредства.СуммаОстаток КАК СуммаКонечныйОстатокУтв,
	|	0 КАК СуммаУтв,
	|	0 КАК СуммаНачальныйОстатокВЕдинойВалюте,
	|	ДенежныеСредства.СуммаОстаток * ЕСТЬNULL(КурсыВалютПересчета.КоэффициентПересчета, 1) КАК СуммаКонечныйОстатокВЕдинойВалюте,
	|	0 КАК СуммаВЕдинойВалюте,
	|	0 КАК СуммаНачальныйОстатокВЕдинойВалютеУтв,
	|	ДенежныеСредства.СуммаОстаток * ЕСТЬNULL(КурсыВалютПересчета.КоэффициентПересчета, 1) КАК СуммаКонечныйОстатокВЕдинойВалютеУтв,
	|	0 КАК СуммаВЕдинойВалютеУтв
	|ИЗ
	|	РегистрНакопления.ДенежныеСредстваНаличные.Остатки(, 
	|		(Организация = &Организация
	|			ИЛИ &Организация = Неопределено)
	|		И (Касса.ВалютаДенежныхСредств = &Валюта
	|			ИЛИ &Валюта = Неопределено)
	|	) КАК ДенежныеСредства
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		КурсыВалютПересчета КАК КурсыВалютПересчета
	|	ПО
	|		ДенежныеСредства.Касса.ВалютаДенежныхСредств = КурсыВалютПересчета.Валюта
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	1 КАК СтатусПлатежа, // Доступный остаток
	|	ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.Безналичные) КАК ТипДенежныхСредств,
	|	&РабочаяДата КАК День,
	|	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаПлатежа,
	|	&Платеж КАК Платеж,
	|	ИСТИНА КАК СтрокаТекущийОстаток,
	|	ДенежныеСредства.БанковскийСчет КАК БанковскийСчетКасса,
	|	ДенежныеСредства.БанковскийСчет.ВалютаДенежныхСредств КАК Валюта,
	|	ДенежныеСредства.Организация КАК Организация,
	|	0 КАК СуммаНачальныйОстаток,
	|	ДенежныеСредства.СуммаОстаток КАК СуммаКонечныйОстаток,
	|	0 КАК Сумма,
	|	0 КАК СуммаНачальныйОстатокУтв,
	|	ДенежныеСредства.СуммаОстаток КАК СуммаКонечныйОстатокУтв,
	|	0 КАК СуммаУтв,
	|	0 КАК СуммаНачальныйОстатокВЕдинойВалюте,
	|	ДенежныеСредства.СуммаОстаток * ЕСТЬNULL(КурсыВалютПересчета.КоэффициентПересчета, 1) КАК СуммаКонечныйОстатокВЕдинойВалюте,
	|	0 КАК СуммаВЕдинойВалюте,
	|	0 КАК СуммаНачальныйОстатокВЕдинойВалютеУтв,
	|	ДенежныеСредства.СуммаОстаток * ЕСТЬNULL(КурсыВалютПересчета.КоэффициентПересчета, 1) КАК СуммаКонечныйОстатокВЕдинойВалютеУтв,
	|	0 КАК СуммаВЕдинойВалютеУтв
	|ИЗ
	|	РегистрНакопления.ДенежныеСредстваБезналичные.Остатки(, 
	|		(Организация = &Организация
	|			ИЛИ &Организация = Неопределено)
	|		И (БанковскийСчет.ВалютаДенежныхСредств = &Валюта
	|			ИЛИ &Валюта = Неопределено)
	|	) КАК ДенежныеСредства
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		КурсыВалютПересчета КАК КурсыВалютПересчета
	|	ПО
	|		ДенежныеСредства.БанковскийСчет.ВалютаДенежныхСредств = КурсыВалютПересчета.Валюта
	|
	|УПОРЯДОЧИТЬ ПО
	|	БанковскийСчетКасса
	|");
	
	Запрос.УстановитьПараметр("Организация", ?(ЗначениеЗаполнено(Организация), Организация, Неопределено));
	Запрос.УстановитьПараметр("Валюта", ?(ЗначениеЗаполнено(Валюта), Валюта, Неопределено));
	Запрос.УстановитьПараметр("ЕдинаяВалюта", ?(ЗначениеЗаполнено(ЕдинаяВалюта), ЕдинаяВалюта, Неопределено));
	Запрос.УстановитьПараметр("РабочаяДата", ДатаОстатковНачалоДня);
	Запрос.УстановитьПараметр("ДатаОстатков", КонецДня(ДатаОстатковНачалоДня));
	Запрос.УстановитьПараметр("Платеж", НСтр("ru = 'Текущий остаток'"));
	
	Возврат Запрос;

КонецФункции

Функция ОстаткиПоКредитамДепозитам() 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДоговорыКредитовИДепозитов.Ссылка КАК Договор,
	|	ДоговорыКредитовИДепозитов.Организация КАК Организация,
	|	ДоговорыКредитовИДепозитов.ПорядокОплаты КАК ПорядокОплаты,
	|	ДоговорыКредитовИДепозитов.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
	|	ДоговорыКредитовИДепозитов.СтатьяДДСПоступленияВыдачи,
	|	ДоговорыКредитовИДепозитов.СтатьяДДСОсновногоДолга,
	|	ДоговорыКредитовИДепозитов.СтатьяДДСПроцентов,
	|	ДоговорыКредитовИДепозитов.СтатьяДДСКомиссии
	|ПОМЕСТИТЬ втДоговораЗаПериод
	|ИЗ
	|	РегистрСведений.ГрафикТраншейКредитовИДепозитов КАК ГрафикТраншейКредитовИДепозитов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ДоговорыКредитовИДепозитов КАК ДоговорыКредитовИДепозитов
	|		ПО ГрафикТраншейКредитовИДепозитов.ВариантГрафика.Ссылка = ДоговорыКредитовИДепозитов.Ссылка
	|			И ГрафикТраншейКредитовИДепозитов.ВариантГрафика.Утвержден
	|ГДЕ
	|	ГрафикТраншейКредитовИДепозитов.Период МЕЖДУ &РабочаяДата И &ДатаОкончания
	|	И ДоговорыКредитовИДепозитов.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыДоговоровКонтрагентов.Действует)
	|
	|СГРУППИРОВАТЬ ПО
	|	ДоговорыКредитовИДепозитов.Организация,
	|	ДоговорыКредитовИДепозитов.ПорядокОплаты,
	|	ДоговорыКредитовИДепозитов.ВалютаВзаиморасчетов,
	|	ДоговорыКредитовИДепозитов.Ссылка,
	|	ДоговорыКредитовИДепозитов.СтатьяДДСПоступленияВыдачи,
	|	ДоговорыКредитовИДепозитов.СтатьяДДСОсновногоДолга,
	|	ДоговорыКредитовИДепозитов.СтатьяДДСПроцентов,
	|	ДоговорыКредитовИДепозитов.СтатьяДДСКомиссии
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДоговорыКредитовИДепозитов.Ссылка,
	|	ДоговорыКредитовИДепозитов.Организация,
	|	ДоговорыКредитовИДепозитов.ПорядокОплаты,
	|	ДоговорыКредитовИДепозитов.ВалютаВзаиморасчетов,
	|	ДоговорыКредитовИДепозитов.СтатьяДДСПоступленияВыдачи,
	|	ДоговорыКредитовИДепозитов.СтатьяДДСОсновногоДолга,
	|	ДоговорыКредитовИДепозитов.СтатьяДДСПроцентов,
	|	ДоговорыКредитовИДепозитов.СтатьяДДСКомиссии
	|ИЗ
	|	РегистрСведений.ГрафикОплатКредитовИДепозитов КАК ГрафикОплатКредитовИДепозитов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ДоговорыКредитовИДепозитов КАК ДоговорыКредитовИДепозитов
	|		ПО ГрафикОплатКредитовИДепозитов.ВариантГрафика.Владелец = ДоговорыКредитовИДепозитов.Ссылка
	|			И ГрафикОплатКредитовИДепозитов.ВариантГрафика.Утвержден
	|ГДЕ
	|	ГрафикОплатКредитовИДепозитов.Период МЕЖДУ &РабочаяДата И &ДатаОкончания
	|	И ДоговорыКредитовИДепозитов.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыДоговоровКонтрагентов.Действует)
	|
	|СГРУППИРОВАТЬ ПО
	|	ДоговорыКредитовИДепозитов.Организация,
	|	ДоговорыКредитовИДепозитов.ПорядокОплаты,
	|	ДоговорыКредитовИДепозитов.ВалютаВзаиморасчетов,
	|	ДоговорыКредитовИДепозитов.Ссылка,
	|	ДоговорыКредитовИДепозитов.СтатьяДДСПоступленияВыдачи,
	|	ДоговорыКредитовИДепозитов.СтатьяДДСОсновногоДолга,
	|	ДоговорыКредитовИДепозитов.СтатьяДДСПроцентов,
	|	ДоговорыКредитовИДепозитов.СтатьяДДСКомиссии
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	втДоговораЗаПериод.Договор КАК Договор,
	|	втДоговораЗаПериод.СтатьяДДСПоступленияВыдачи,
	|	втДоговораЗаПериод.СтатьяДДСОсновногоДолга,
	|	втДоговораЗаПериод.СтатьяДДСПроцентов,
	|	втДоговораЗаПериод.СтатьяДДСКомиссии
	|ПОМЕСТИТЬ втДоговора
	|ИЗ
	|	втДоговораЗаПериод КАК втДоговораЗаПериод
	|ГДЕ
	|	(втДоговораЗаПериод.Организация = &Организация
	|			ИЛИ &Организация = НЕОПРЕДЕЛЕНО)
	|	И (ВЫБОР
	|			КОГДА втДоговораЗаПериод.ВалютаВзаиморасчетов <> &ВалютаРегламентированногоУчета
	|					И втДоговораЗаПериод.ПорядокОплаты = ЗНАЧЕНИЕ(Перечисление.ПорядокОплатыПоСоглашениям.РасчетыВВалютеОплатаВВалюте)
	|				ТОГДА втДоговораЗаПериод.ВалютаВзаиморасчетов
	|			ИНАЧЕ &ВалютаРегламентированногоУчета
	|		КОНЕЦ = &Валюта
	|		ИЛИ &Валюта = НЕОПРЕДЕЛЕНО)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ФактПоДоговорам.Договор,
	|	ФактПоДоговорам.Назначение,
	|	ФактПоДоговорам.СуммаФакт
	|ПОМЕСТИТЬ втФакт
	|ИЗ
	|	(ВЫБРАТЬ
	|		РасчетыПоДоговорамКредитовИДепозитов.Договор КАК Договор,
	|		РасчетыПоДоговорамКредитовИДепозитов.СтатьяАналитики КАК Назначение,
	|		СУММА(РасчетыПоДоговорамКредитовИДепозитов.СуммаВВалюте) КАК СуммаФакт
	|	ИЗ
	|		РегистрНакопления.РасчетыПоДоговорамКредитовИДепозитов КАК РасчетыПоДоговорамКредитовИДепозитов
	|	ГДЕ
	|		РасчетыПоДоговорамКредитовИДепозитов.Период <= &ДатаОкончания
	|		И РасчетыПоДоговорамКредитовИДепозитов.Договор В (ВЫБРАТЬ втДоговора.Договор ИЗ втДоговора)
	|		И РасчетыПоДоговорамКредитовИДепозитов.ТипСуммы = ЗНАЧЕНИЕ(Перечисление.ТипыСуммГрафикаКредитовИДепозитов.ОсновнойДолг)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		РасчетыПоДоговорамКредитовИДепозитов.Договор,
	|		РасчетыПоДоговорамКредитовИДепозитов.СтатьяАналитики
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		РасчетыПоДоговорамКредитовИДепозитов.Договор,
	|		РасчетыПоДоговорамКредитовИДепозитов.СтатьяАналитики,
	|		СУММА(РасчетыПоДоговорамКредитовИДепозитов.СуммаВВалюте)
	|	ИЗ
	|		РегистрНакопления.РасчетыПоДоговорамКредитовИДепозитов КАК РасчетыПоДоговорамКредитовИДепозитов
	|	ГДЕ
	|		РасчетыПоДоговорамКредитовИДепозитов.Период <= &ДатаОкончания
	|		И РасчетыПоДоговорамКредитовИДепозитов.Договор В (ВЫБРАТЬ втДоговора.Договор ИЗ втДоговора)
	|		И РасчетыПоДоговорамКредитовИДепозитов.ТипСуммы = ЗНАЧЕНИЕ(Перечисление.ТипыСуммГрафикаКредитовИДепозитов.ОсновнойДолг)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		РасчетыПоДоговорамКредитовИДепозитов.Договор,
	|		РасчетыПоДоговорамКредитовИДепозитов.СтатьяАналитики
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		РасчетыПоДоговорамКредитовИДепозитов.Договор,
	|		РасчетыПоДоговорамКредитовИДепозитов.СтатьяАналитики,
	|		СУММА(РасчетыПоДоговорамКредитовИДепозитов.СуммаВВалюте)
	|	ИЗ
	|		РегистрНакопления.РасчетыПоДоговорамКредитовИДепозитов КАК РасчетыПоДоговорамКредитовИДепозитов
	|	ГДЕ
	|		РасчетыПоДоговорамКредитовИДепозитов.Период <= &ДатаОкончания
	|		И РасчетыПоДоговорамКредитовИДепозитов.Договор В (ВЫБРАТЬ втДоговора.Договор ИЗ втДоговора)
	|		И РасчетыПоДоговорамКредитовИДепозитов.ТипСуммы = ЗНАЧЕНИЕ(Перечисление.ТипыСуммГрафикаКредитовИДепозитов.Проценты)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		РасчетыПоДоговорамКредитовИДепозитов.Договор,
	|		РасчетыПоДоговорамКредитовИДепозитов.СтатьяАналитики
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		РасчетыПоДоговорамКредитовИДепозитов.Договор,
	|		РасчетыПоДоговорамКредитовИДепозитов.СтатьяАналитики,
	|		СУММА(РасчетыПоДоговорамКредитовИДепозитов.СуммаВВалюте)
	|	ИЗ
	|		РегистрНакопления.РасчетыПоДоговорамКредитовИДепозитов КАК РасчетыПоДоговорамКредитовИДепозитов
	|	ГДЕ
	|		РасчетыПоДоговорамКредитовИДепозитов.Период <= &ДатаОкончания
	|		И РасчетыПоДоговорамКредитовИДепозитов.Договор В (ВЫБРАТЬ втДоговора.Договор ИЗ втДоговора)
	|		И РасчетыПоДоговорамКредитовИДепозитов.ТипСуммы = ЗНАЧЕНИЕ(Перечисление.ТипыСуммГрафикаКредитовИДепозитов.Комиссия)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		РасчетыПоДоговорамКредитовИДепозитов.Договор,
	|		РасчетыПоДоговорамКредитовИДепозитов.СтатьяАналитики) КАК ФактПоДоговорам
	|
	|СГРУППИРОВАТЬ ПО
	|	ФактПоДоговорам.Договор,
	|	ФактПоДоговорам.Назначение,
	|	ФактПоДоговорам.СуммаФакт
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПланПоДоговорам.Договор,
	|	ПланПоДоговорам.Назначение,
	|	ПланПоДоговорам.СуммаПлан
	|ПОМЕСТИТЬ втПлан
	|ИЗ
	|	(ВЫБРАТЬ
	|		втДоговора.Договор КАК Договор,
	|		втДоговора.СтатьяДДСПоступленияВыдачи КАК Назначение,
	|		СУММА(ЕСТЬNULL(ГрафикТраншейКредитовИДепозитов.Сумма, 0)) КАК СуммаПлан
	|	ИЗ
	|		втДоговора КАК втДоговора
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГрафикТраншейКредитовИДепозитов КАК ГрафикТраншейКредитовИДепозитов
	|			ПО втДоговора.Договор = ГрафикТраншейКредитовИДепозитов.ВариантГрафика.Владелец
	|				И (ГрафикТраншейКредитовИДепозитов.Период <= &ДатаОстатков)
	|				И (ГрафикТраншейКредитовИДепозитов.ВариантГрафика.Используется)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		втДоговора.Договор,
	|		втДоговора.СтатьяДДСПоступленияВыдачи
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		втДоговора.Договор,
	|		втДоговора.СтатьяДДСОсновногоДолга,
	|		СУММА(ЕСТЬNULL(ГрафикОплатКредитовИДепозитов.Сумма, 0))
	|	ИЗ
	|		втДоговора КАК втДоговора
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГрафикОплатКредитовИДепозитов КАК ГрафикОплатКредитовИДепозитов
	|			ПО втДоговора.Договор = ГрафикОплатКредитовИДепозитов.ВариантГрафика.Владелец
	|				И (ГрафикОплатКредитовИДепозитов.Период <= &ДатаОстатков)
	|				И (ГрафикОплатКредитовИДепозитов.ВариантГрафика.Используется)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		втДоговора.Договор,
	|		втДоговора.СтатьяДДСОсновногоДолга
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		втДоговора.Договор,
	|		втДоговора.СтатьяДДСПроцентов,
	|		СУММА(ЕСТЬNULL(ГрафикОплатКредитовИДепозитов.Проценты, 0))
	|	ИЗ
	|		втДоговора КАК втДоговора
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГрафикОплатКредитовИДепозитов КАК ГрафикОплатКредитовИДепозитов
	|			ПО втДоговора.Договор = ГрафикОплатКредитовИДепозитов.ВариантГрафика.Владелец
	|				И (ГрафикОплатКредитовИДепозитов.Период <= &ДатаОстатков)
	|				И (ГрафикОплатКредитовИДепозитов.ВариантГрафика.Используется)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		втДоговора.Договор,
	|		втДоговора.СтатьяДДСПроцентов
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		втДоговора.Договор,
	|		втДоговора.СтатьяДДСКомиссии,
	|		СУММА(ЕСТЬNULL(ГрафикОплатКредитовИДепозитов.Комиссия, 0))
	|	ИЗ
	|		втДоговора КАК втДоговора
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГрафикОплатКредитовИДепозитов КАК ГрафикОплатКредитовИДепозитов
	|			ПО втДоговора.Договор = ГрафикОплатКредитовИДепозитов.ВариантГрафика.Владелец
	|				И (ГрафикОплатКредитовИДепозитов.Период <= &ДатаОстатков)
	|				И (ГрафикОплатКредитовИДепозитов.ВариантГрафика.Используется)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		втДоговора.Договор,
	|		втДоговора.СтатьяДДСКомиссии) КАК ПланПоДоговорам
	|
	|СГРУППИРОВАТЬ ПО
	|	ПланПоДоговорам.Договор,
	|	ПланПоДоговорам.Назначение,
	|	ПланПоДоговорам.СуммаПлан
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&ДатаОстатков КАК НаДату,
	|	втПлан.Договор,
	|	втПлан.Назначение,
	|	втПлан.СуммаПлан,
	|	ЕСТЬNULL(втФакт.СуммаФакт, 0) КАК СуммаФакт
	|ИЗ
	|	втПлан КАК втПлан
	|		ЛЕВОЕ СОЕДИНЕНИЕ втФакт КАК втФакт
	|		ПО втПлан.Договор = втФакт.Договор
	|			И втПлан.Назначение = втФакт.Назначение
	|ГДЕ
	|	втПлан.Назначение <> ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ПустаяСсылка)";
	
	Запрос.УстановитьПараметр("Организация", ?(ЗначениеЗаполнено(Организация), Организация, Неопределено));
	Запрос.УстановитьПараметр("Валюта", ?(ЗначениеЗаполнено(Валюта), Валюта, Неопределено));
	Запрос.УстановитьПараметр("ВалютаРегламентированногоУчета", Константы.ВалютаРегламентированногоУчета.Получить());
	Запрос.УстановитьПараметр("РабочаяДата", ДатаОстатковНачалоДня);
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(ПериодБудущихПлатежей.ДатаОкончания));
	Запрос.УстановитьПараметр("ДатаОстатков", КонецДня(ДатаОстатковНачалоДня));
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция ТекстЗапросаПоАналитикеУчетаПоПартнерам()

	ТекстЗапроса = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КлючАналитики КАК КлючАналитики
	|
	|ПОМЕСТИТЬ АналитикаУчетаПоПартнерам
	|ИЗ
	|	РегистрСведений.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам
	|ГДЕ
	|	(АналитикаУчетаПоПартнерам.Организация = &Организация
	|		ИЛИ &Организация = Неопределено)
	|	И АналитикаУчетаПоПартнерам.Партнер <> ЗНАЧЕНИЕ(Справочник.Партнеры.НашеПредприятие)
	|;
	|/////////////////////////////////////////////////////////////////////////////
	|";
	
	Возврат ТекстЗапроса
	
КонецФункции

Функция ТекстЗапросаВременныеТаблицыПланируемыеИФактическиеПоступления()

	ТекстЗапроса = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НАЧАЛОПЕРИОДА(ДанныеДокумента.Дата, ДЕНЬ) КАК День,
	|	ДанныеДокумента.Организация КАК Организация,
	|	ДанныеДокумента.Дата КАК Дата,
	|	ДанныеДокумента.Ссылка КАК Документ,
	|	ДанныеДокумента.Валюта КАК Валюта,
	|	ДанныеДокумента.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
	|	ДанныеДокумента.ФормаОплаты КАК ФормаОплаты,
	|
	|	ВЫБОР КОГДА ДанныеДокумента.ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Наличная) ТОГДА
	|		ДанныеДокумента.Касса
	|	КОГДА ДанныеДокумента.ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Безналичная) ТОГДА
	|		ДанныеДокумента.БанковскийСчет
	|	ИНАЧЕ
	|		Неопределено
	|	КОНЕЦ КАК БанковскийСчетКасса,
    |
	|	МАКСИМУМ(ДанныеДокумента.СуммаДокумента) КАК СуммаДокумента,
	|	МАКСИМУМ(ДанныеДокумента.СуммаДокумента)
	|	 + СУММА(ЕСТЬNULL(ДанныеДокументаИтоги.СуммаДокумента, 0)) КАК СуммаИтог
	|
	|ПОМЕСТИТЬ ПланируемыеПоступления
	|ИЗ
	|	Документ.ОжидаемоеПоступлениеДенежныхСредств КАК ДанныеДокумента
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		Документ.ОжидаемоеПоступлениеДенежныхСредств КАК ДанныеДокументаИтоги
	|	ПО
	|		ДанныеДокумента.Организация = ДанныеДокументаИтоги.Организация
	|		И ДанныеДокумента.Валюта = ДанныеДокументаИтоги.Валюта
	|		И ДанныеДокумента.ФормаОплаты = ДанныеДокументаИтоги.ФормаОплаты
	|		И ДанныеДокумента.Касса = ДанныеДокументаИтоги.Касса
	|		И ДанныеДокумента.БанковскийСчет = ДанныеДокументаИтоги.БанковскийСчет
	|		И ДанныеДокумента.СтатьяДвиженияДенежныхСредств = ДанныеДокументаИтоги.СтатьяДвиженияДенежныхСредств
	|		И НАЧАЛОПЕРИОДА(ДанныеДокумента.Дата, ДЕНЬ) = НАЧАЛОПЕРИОДА(ДанныеДокументаИтоги.Дата, ДЕНЬ)
	|		И ДанныеДокумента.Дата >= ДанныеДокументаИтоги.Дата
	|		И ДанныеДокумента.Ссылка > ДанныеДокументаИтоги.Ссылка
	|		И ДанныеДокументаИтоги.Проведен
	|		
	|ГДЕ
	|	ДанныеДокумента.Дата МЕЖДУ &РабочаяДата И &ДатаОкончания
	|	И (ДанныеДокумента.Организация = &Организация
	|		ИЛИ &Организация = Неопределено)
	|	И (ДанныеДокумента.Валюта = &Валюта
	|		ИЛИ &Валюта = Неопределено)
	|	И ДанныеДокумента.Проведен
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеДокумента.Организация,
	|	ДанныеДокумента.Дата,
	|	ДанныеДокумента.Ссылка,
	|	ДанныеДокумента.Валюта,
	|	ДанныеДокумента.СтатьяДвиженияДенежныхСредств,
	|	ДанныеДокумента.ФормаОплаты,
	|	ВЫБОР КОГДА ДанныеДокумента.ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Наличная) ТОГДА
	|		ДанныеДокумента.Касса
	|	КОГДА ДанныеДокумента.ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Безналичная) ТОГДА
	|		ДанныеДокумента.БанковскийСчет
	|	ИНАЧЕ
	|		Неопределено
	|	КОНЕЦ
	|;
	|/////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НАЧАЛОПЕРИОДА(ДенежныеСредства.Период, ДЕНЬ) КАК День,
	|	ДенежныеСредства.Организация КАК Организация,
	|	ДенежныеСредства.Валюта КАК Валюта,
	|	ДенежныеСредства.БанковскийСчетКасса КАК БанковскийСчетКасса,
	|	ДенежныеСредства.ФормаОплаты КАК ФормаОплаты,
	|	ДенежныеСредства.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
	|	СУММА(ДенежныеСредства.Сумма) КАК Сумма
	|
	|ПОМЕСТИТЬ ФактическиеПоступления
	|ИЗ (
	|	ВЫБРАТЬ
	|		ДенежныеСредства.Период КАК Период,
	|		ДенежныеСредства.Организация КАК Организация,
	|		ДенежныеСредства.Касса.ВалютаДенежныхСредств КАК Валюта,
	|		ДенежныеСредства.Касса КАК БанковскийСчетКасса,
	|		ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Наличная) КАК ФормаОплаты,
	|		ДенежныеСредства.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
	|		ВЫБОР КОГДА ДенежныеСредства.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) ТОГДА
	|			ДенежныеСредства.Сумма
	|		ИНАЧЕ
	|			0
	|		КОНЕЦ КАК Сумма
	|	ИЗ
	|		РегистрНакопления.ДенежныеСредстваНаличные КАК ДенежныеСредства
	|	ГДЕ
	|		ДенежныеСредства.Период МЕЖДУ &РабочаяДата И &ДатаОкончания
	|		И (
	|			ДенежныеСредства.Организация,
	|			ДенежныеСредства.СтатьяДвиженияДенежныхСредств
	|			) В (
	|			ВЫБРАТЬ
	|				ПланируемыеПоступления.Организация,
	|				ПланируемыеПоступления.СтатьяДвиженияДенежныхСредств
	|			ИЗ
	|				ПланируемыеПоступления КАК ПланируемыеПоступления
	|			)
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|		
	|	ВЫБРАТЬ
	|		ДенежныеСредства.Период КАК Период,
	|		ДенежныеСредства.Организация КАК Организация,
	|		ДенежныеСредства.БанковскийСчет.ВалютаДенежныхСредств КАК Валюта,
	|		ДенежныеСредства.БанковскийСчет КАК БанковскийСчетКасса,
	|		ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Безналичная) КАК ФормаОплаты,
	|		ДенежныеСредства.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
	|		ВЫБОР КОГДА ДенежныеСредства.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) ТОГДА
	|			ДенежныеСредства.Сумма
	|		ИНАЧЕ
	|			0
	|		КОНЕЦ КАК Сумма
	|	ИЗ
	|		РегистрНакопления.ДенежныеСредстваБезналичные КАК ДенежныеСредства
	|	ГДЕ
	|		ДенежныеСредства.Период МЕЖДУ &РабочаяДата И &ДатаОкончания
	|		И (
	|			ДенежныеСредства.Организация,
	|			ДенежныеСредства.СтатьяДвиженияДенежныхСредств
	|			) В (
	|			ВЫБРАТЬ
	|				ПланируемыеПоступления.Организация,
	|				ПланируемыеПоступления.СтатьяДвиженияДенежныхСредств
	|			ИЗ
	|				ПланируемыеПоступления КАК ПланируемыеПоступления
	|			)
	|	) КАК ДенежныеСредства
	|
	|СГРУППИРОВАТЬ ПО
	|	НАЧАЛОПЕРИОДА(ДенежныеСредства.Период, ДЕНЬ),
	|	ДенежныеСредства.Организация,
	|	ДенежныеСредства.Валюта,
	|	ДенежныеСредства.БанковскийСчетКасса,
	|	ДенежныеСредства.ФормаОплаты,
	|	ДенежныеСредства.СтатьяДвиженияДенежныхСредств
	|;
	|/////////////////////////////////////////////////////////////////////////////
	|";
	
	Возврат ТекстЗапроса
	
КонецФункции

Функция ТекстЗапросаВременнаяТаблицаКурсыВалют()
	
	ТекстЗапроса = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КурсыВалют.Валюта,
	|	ВЫБОР КОГДА КурсыВалют.Кратность = 0
	|		ИЛИ ЕСТЬNULL(КурсВалютыОтчета.Курс, 0) = 0
	|	ТОГДА
	|		1
	|	ИНАЧЕ
	|		(КурсыВалют.Курс * КурсВалютыОтчета.Кратность)
	|		/ (КурсыВалют.Кратность * КурсВалютыОтчета.Курс)
	|	КОНЕЦ КАК КоэффициентПересчета
	|	
	|ПОМЕСТИТЬ КурсыВалют
	|ИЗ
	|	РегистрСведений.КурсыВалют.СрезПоследних(&ДатаОстатков,
	|		Валюта <> ВЫБОР КОГДА &Валюта = Неопределено ТОГДА &ВалютаРегламентированногоУчета ИНАЧЕ &Валюта КОНЕЦ
	|		) КАК КурсыВалют
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		РегистрСведений.КурсыВалют.СрезПоследних(&ДатаОстатков,
	|			Валюта = ВЫБОР КОГДА &Валюта = Неопределено ТОГДА &ВалютаРегламентированногоУчета ИНАЧЕ &Валюта КОНЕЦ
	|		) КАК КурсВалютыОтчета
	|	ПО
	|		Истина
	|;
	|/////////////////////////////////////////////////////////////////////////////
	|";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаВременнаяТаблицаКурсыВалютПересчетаВЕдинуюВалюту()
	
	ТекстЗапроса = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КурсВалюты.Валюта КАК Валюта,
	|	КурсВалюты.Курс * КурсВалютыОтчета.Кратность / (КурсВалюты.Кратность * КурсВалютыОтчета.Курс) КАК КоэффициентПересчета
	|ПОМЕСТИТЬ КурсыВалютПересчета
	|ИЗ
	|	РегистрСведений.КурсыВалют.СрезПоследних(&ДатаОстатков, ) КАК КурсВалюты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(, Валюта = &ЕдинаяВалюта) КАК КурсВалютыОтчета
	|		ПО (ИСТИНА)
	|ГДЕ
	|	КурсВалюты.Кратность <> 0
	|	И КурсВалютыОтчета.Курс <> 0
	|;
	|/////////////////////////////////////////////////////////////////////////////
	|";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаВременнаяТаблицаРасчетыСКлиентами()
	
	ТекстЗапроса = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Расчеты.Период КАК Период,
	|	Расчеты.ЗаказКлиента КАК ЗаказКлиента,
	|	Расчеты.Валюта КАК Валюта,
	|	Расчеты.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	
	|	Расчеты.КОплатеПриход КАК КОплатеПриход
	|
	|ПОМЕСТИТЬ РасчетыСКлиентамиОбороты
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентами.Обороты(
	|		&ДатаНачала,
	|		&ДатаОкончания,
	|		День,
	|		АналитикаУчетаПоПартнерам В (
	|			ВЫБРАТЬ
	|				Аналитика.КлючАналитики КАК КлючАналитики
	|			ИЗ
	|				АналитикаУчетаПоПартнерам КАК Аналитика
	|			)
	|	) КАК Расчеты
	|	
	|ИНДЕКСИРОВАТЬ ПО
	|	АналитикаУчетаПоПартнерам,
	|	Валюта,
	|	ЗаказКлиента
	|	
	|;
	|///////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Расчеты.ЗаказКлиента КАК ЗаказКлиента,
	|	Расчеты.Валюта КАК Валюта,
	|	Расчеты.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	
	|	- Расчеты.КОплатеНачальныйОстаток + Расчеты.ОплачиваетсяНачальныйОстаток
	|	+ Расчеты.КОплатеРасход + Расчеты.ОплачиваетсяПриход - Расчеты.ОплачиваетсяРасход КАК КОплатеРасход
	|
	|ПОМЕСТИТЬ РасчетыСКлиентамиОплата
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентами.ОстаткиИОбороты(
	|		&ДатаНачала,
	|		&ДатаОкончания,
	|		Период,
	|		,
	|		АналитикаУчетаПоПартнерам В (
	|			ВЫБРАТЬ
	|				Аналитика.КлючАналитики КАК КлючАналитики
	|			ИЗ
	|				АналитикаУчетаПоПартнерам КАК Аналитика
	|			)
	|	) КАК Расчеты
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	АналитикаУчетаПоПартнерам,
	|	Валюта,
	|	ЗаказКлиента
	|;
	|///////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Расчеты.Период КАК Период,
	|	Расчеты.ЗаказКлиента КАК ЗаказКлиента,
	|	Расчеты.ЗаказКлиента.ФормаОплаты КАК ФормаОплаты,
	|	Расчеты.ЗаказКлиента.Касса КАК Касса,
	|	Расчеты.ЗаказКлиента.БанковскийСчет КАК БанковскийСчет,
	|	Расчеты.ЗаказКлиента.БанковскийСчетОрганизации КАК БанковскийСчетОрганизации,
	|	Расчеты.Валюта КАК Валюта,
	|	Расчеты.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	
	|	МАКСИМУМ(Расчеты.КОплатеПриход) КАК КОплатеПриход,
	|	СУММА(ЕСТЬNULL(РасчетыИтоги.КОплатеПриход, 0)) КАК КОплатеПриходИтог,
	|	МАКСИМУМ(ЕСТЬNULL(РасчетыОплата.КОплатеРасход, 0)) КАК КОплатеРасход
	|
	|ПОМЕСТИТЬ РасчетыСКлиентами
	|ИЗ
	|	РасчетыСКлиентамиОбороты КАК Расчеты
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		РасчетыСКлиентамиОбороты КАК РасчетыИтоги
	|	ПО
	|		Расчеты.АналитикаУчетаПоПартнерам = РасчетыИтоги.АналитикаУчетаПоПартнерам
	|		И Расчеты.ЗаказКлиента = РасчетыИтоги.ЗаказКлиента
	|		И Расчеты.Валюта = РасчетыИтоги.Валюта
	|		И Расчеты.Период > РасчетыИтоги.Период
	|		
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		РасчетыСКлиентамиОплата КАК РасчетыОплата
	|	ПО
	|		Расчеты.АналитикаУчетаПоПартнерам = РасчетыОплата.АналитикаУчетаПоПартнерам
	|		И Расчеты.ЗаказКлиента = РасчетыОплата.ЗаказКлиента
	|		И Расчеты.Валюта = РасчетыОплата.Валюта
	|
	|СГРУППИРОВАТЬ ПО
	|	Расчеты.Период,
	|	Расчеты.ЗаказКлиента,
	|	Расчеты.ЗаказКлиента.ФормаОплаты,
	|	Расчеты.ЗаказКлиента.Касса,
	|	Расчеты.ЗаказКлиента.БанковскийСчет,
	|	Расчеты.ЗаказКлиента.БанковскийСчетОрганизации,
	|	Расчеты.Валюта,
	|	Расчеты.АналитикаУчетаПоПартнерам
	|		
	|;
	|/////////////////////////////////////////////////////////////////////////////
	|";

	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаВременнаяТаблицаРасчетыСПоставщиками()
	
	ТекстЗапроса = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Расчеты.Период КАК Период,
	|	Расчеты.ЗаказПоставщику КАК ЗаказПоставщику,
	|	Расчеты.Валюта КАК Валюта,
	|	Расчеты.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	
	|	Расчеты.КОплатеРасход КАК КОплатеРасход
	|
	|ПОМЕСТИТЬ РасчетыСПоставщикамиОбороты
	|ИЗ
	|	РегистрНакопления.РасчетыСПоставщиками.Обороты(
	|		&ДатаНачала,
	|		&ДатаОкончания,
	|		День,
	|		АналитикаУчетаПоПартнерам В (
	|			ВЫБРАТЬ
	|				Аналитика.КлючАналитики КАК КлючАналитики
	|			ИЗ
	|				АналитикаУчетаПоПартнерам КАК Аналитика
	|			)
	|	) КАК Расчеты
	|	
	|ИНДЕКСИРОВАТЬ ПО
	|	АналитикаУчетаПоПартнерам,
	|	Валюта,
	|	ЗаказПоставщику
	|	
	|;
	|///////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Расчеты.ЗаказПоставщику КАК ЗаказПоставщику,
	|	Расчеты.Валюта КАК Валюта,
	|	Расчеты.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	Расчеты.КОплатеОстаток КАК КОплатеПриход
	|
	|ПОМЕСТИТЬ РасчетыСПоставщикамиОплатаВрем
	|ИЗ
	|	РегистрНакопления.РасчетыСПоставщиками.Остатки(
	|		&ДатаНачала,
	|		АналитикаУчетаПоПартнерам В (
	|			ВЫБРАТЬ
	|				Аналитика.КлючАналитики КАК КлючАналитики
	|			ИЗ
	|				АналитикаУчетаПоПартнерам КАК Аналитика
	|			)
	|	) КАК Расчеты
	|ГДЕ
	|	Расчеты.КОплатеОстаток > 0
	|	
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Расчеты.ЗаказПоставщику КАК ЗаказПоставщику,
	|	Расчеты.Валюта КАК Валюта,
	|	Расчеты.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	Расчеты.КОплате КАК КОплатеПриход
	|
	|ИЗ
	|	РегистрНакопления.РасчетыСПоставщиками КАК Расчеты
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		АналитикаУчетаПоПартнерам КАК КлючиАналитики
	|	ПО
	|		Расчеты.АналитикаУчетаПоПартнерам = КлючиАналитики.КлючАналитики
	|ГДЕ
	|	Расчеты.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И Расчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	И Расчеты.ЗаявкаНаРасходованиеДенежныхСредств = ЗНАЧЕНИЕ(Документ.ЗаявкаНаРасходованиеДенежныхСредств.ПустаяСсылка)
	|	
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Расчеты.ЗаказПоставщику КАК ЗаказПоставщику,
	|	Расчеты.Валюта КАК Валюта,
	|	Расчеты.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	-Расчеты.Оплачивается КАК КОплатеПриход
	|
	|ИЗ
	|	РегистрНакопления.РасчетыСПоставщиками КАК Расчеты
	|
	|ГДЕ
	|	Расчеты.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И Расчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	И Расчеты.ЗаявкаНаРасходованиеДенежныхСредств = ЗНАЧЕНИЕ(Документ.ЗаявкаНаРасходованиеДенежныхСредств.ПустаяСсылка)
	|	
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Расчеты.ЗаказПоставщику КАК ЗаказПоставщику,
	|	Расчеты.Валюта КАК Валюта,
	|	Расчеты.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	Расчеты.Оплачивается КАК КОплатеПриход
	|
	|ИЗ
	|	РегистрНакопления.РасчетыСПоставщиками КАК Расчеты
	|
	|ГДЕ
	|	Расчеты.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И Расчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И Расчеты.ЗаявкаНаРасходованиеДенежныхСредств = ЗНАЧЕНИЕ(Документ.ЗаявкаНаРасходованиеДенежныхСредств.ПустаяСсылка)
	|	
	|ОБЪЕДИНИТЬ ВСЕ
	|	
	|ВЫБРАТЬ
	|	ДенежныеСредстваКВыплате.Заказ КАК ЗаказПоставщику,
	|	ТаблицаРасшифровкаПлатежа.ВалютаВзаиморасчетов КАК Валюта,
	|	ДенежныеСредстваКВыплате.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	ТаблицаРасшифровкаПлатежа.СуммаВзаиморасчетов КАК КОплатеПриход
	|ИЗ
	|	РегистрНакопления.ДенежныеСредстваКВыплате КАК ДенежныеСредстваКВыплате
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.ЗаявкаНаРасходованиеДенежныхСредств.РасшифровкаПлатежа КАК ТаблицаРасшифровкаПлатежа
	|	ПО
	|		ТаблицаРасшифровкаПлатежа.Ссылка = ДенежныеСредстваКВыплате.Регистратор
	|		И ТаблицаРасшифровкаПлатежа.НомерСтроки = ДенежныеСредстваКВыплате.НомерСтроки
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		АналитикаУчетаПоПартнерам КАК КлючиАналитики
	|	ПО
	|		ДенежныеСредстваКВыплате.АналитикаУчетаПоПартнерам = КлючиАналитики.КлючАналитики
	|ГДЕ
	|	ДенежныеСредстваКВыплате.Заказ <> НЕОПРЕДЕЛЕНО
	|
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	РасчетыСПоставщикамиОплатаВрем.ЗаказПоставщику КАК ЗаказПоставщику,
	|	РасчетыСПоставщикамиОплатаВрем.Валюта КАК Валюта,
	|	РасчетыСПоставщикамиОплатаВрем.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	СУММА(РасчетыСПоставщикамиОплатаВрем.КОплатеПриход) КАК КОплатеПриход
	|
	|ПОМЕСТИТЬ РасчетыСПоставщикамиОплата
	|ИЗ РасчетыСПоставщикамиОплатаВрем КАК РасчетыСПоставщикамиОплатаВрем
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаказПоставщику,
	|	Валюта,
	|	АналитикаУчетаПоПартнерам
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	АналитикаУчетаПоПартнерам,
	|	Валюта,
	|	ЗаказПоставщику
	|;
	|///////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Расчеты.Период КАК Период,
	|	Расчеты.ЗаказПоставщику КАК ЗаказПоставщику,
	|	Расчеты.Валюта КАК Валюта,
	|	Расчеты.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	
	|	МАКСИМУМ(Расчеты.КОплатеРасход) КАК КОплатеРасход,
	|	СУММА(ЕСТЬNULL(РасчетыИтоги.КОплатеРасход, 0)) КАК КОплатеРасходИтог,
	|	МАКСИМУМ(ЕСТЬNULL(РасчетыОплата.КОплатеПриход, 0)) КАК КОплатеПриход
	|
	|ПОМЕСТИТЬ РасчетыСПоставщиками
	|ИЗ
	|	РасчетыСПоставщикамиОбороты КАК Расчеты
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		РасчетыСПоставщикамиОбороты КАК РасчетыИтоги
	|	ПО
	|		Расчеты.АналитикаУчетаПоПартнерам = РасчетыИтоги.АналитикаУчетаПоПартнерам
	|		И Расчеты.ЗаказПоставщику = РасчетыИтоги.ЗаказПоставщику
	|		И Расчеты.Валюта = РасчетыИтоги.Валюта
	|		И Расчеты.Период > РасчетыИтоги.Период
	|		
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		РасчетыСПоставщикамиОплата КАК РасчетыОплата
	|	ПО
	|		Расчеты.АналитикаУчетаПоПартнерам = РасчетыОплата.АналитикаУчетаПоПартнерам
	|		И Расчеты.ЗаказПоставщику = РасчетыОплата.ЗаказПоставщику
	|		И Расчеты.Валюта = РасчетыОплата.Валюта
	|
	|СГРУППИРОВАТЬ ПО
	|	Расчеты.Период,
	|	Расчеты.ЗаказПоставщику,
	|	Расчеты.Валюта,
	|	Расчеты.АналитикаУчетаПоПартнерам
	|;
	|/////////////////////////////////////////////////////////////////////////////
	|";

	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаВременнаяТаблицаВозвратыКлиентам()
	
	ТекстЗапроса = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Расчеты.Период КАК Период,
	|	Расчеты.ЗаказКлиента КАК ЗаказКлиента,
	|	Расчеты.Валюта КАК Валюта,
	|	Расчеты.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	
	|	Расчеты.КОплатеРасход КАК КОплатеРасход
	|
	|ПОМЕСТИТЬ ВтВозвратыКлиентамКОплате
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентами.Обороты(
	|		&ДатаНачала,
	|		&ДатаОкончания,
	|		День,
	|		АналитикаУчетаПоПартнерам В (
	|			ВЫБРАТЬ
	|				Аналитика.КлючАналитики КАК КлючАналитики
	|			ИЗ
	|				АналитикаУчетаПоПартнерам КАК Аналитика
	|			)
	|		И (ЗаказКлиента ССЫЛКА Документ.ЗаявкаНаВозвратТоваровОтКлиента
	|			ИЛИ ЗаказКлиента ССЫЛКА Документ.ВозвратТоваровОтКлиента)
	|	) КАК Расчеты
	|	
	|ГДЕ
	|	Расчеты.КОплатеРасход > 0
	|	
	|ИНДЕКСИРОВАТЬ ПО
	|	АналитикаУчетаПоПартнерам,
	|	Валюта,
	|	ЗаказКлиента
	|;
	|///////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Расчеты.ЗаказКлиента КАК ЗаказКлиента,
	|	Расчеты.Валюта КАК Валюта,
	|	Расчеты.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	Расчеты.КОплатеОстаток КАК КОплатеПриход
	|
	|ПОМЕСТИТЬ ВтВозвратыКлиентамОплатаВрем
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентами.Остатки(
	|		&ДатаНачала,
	|		АналитикаУчетаПоПартнерам В (
	|			ВЫБРАТЬ
	|				Аналитика.КлючАналитики КАК КлючАналитики
	|			ИЗ
	|				АналитикаУчетаПоПартнерам КАК Аналитика
	|			)
	|	) КАК Расчеты
	|ГДЕ
	|	Расчеты.КОплатеОстаток > 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Расчеты.ЗаказКлиента КАК ЗаказКлиента,
	|	Расчеты.Валюта КАК Валюта,
	|	Расчеты.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	-Расчеты.КОплате КАК КОплатеПриход
	|	
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентами КАК Расчеты
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		РегистрНакопления.ДенежныеСредстваКВыплате КАК ДенежныеСредстваКВыплате
	|	ПО
	|		Расчеты.Регистратор = ДенежныеСредстваКВыплате.Регистратор
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		АналитикаУчетаПоПартнерам КАК КлючиАналитики
	|	ПО
	|		Расчеты.АналитикаУчетаПоПартнерам = КлючиАналитики.КлючАналитики
	|ГДЕ
	|	Расчеты.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И Расчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И Расчеты.КОплате < 0
	|	И ДенежныеСредстваКВыплате.Регистратор ЕСТЬ NULL
	|	
	|ОБЪЕДИНИТЬ ВСЕ
	|	
	|ВЫБРАТЬ
	|	ДенежныеСредстваКВыплате.Заказ КАК ЗаказКлиентам,
	|	ТаблицаРасшифровкаПлатежа.ВалютаВзаиморасчетов КАК Валюта,
	|	ДенежныеСредстваКВыплате.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	ТаблицаРасшифровкаПлатежа.СуммаВзаиморасчетов КАК КОплатеПриход
	|ИЗ
	|	РегистрНакопления.ДенежныеСредстваКВыплате КАК ДенежныеСредстваКВыплате
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.ЗаявкаНаРасходованиеДенежныхСредств.РасшифровкаПлатежа КАК ТаблицаРасшифровкаПлатежа
	|	ПО
	|		ТаблицаРасшифровкаПлатежа.Ссылка = ДенежныеСредстваКВыплате.Регистратор
	|		И ТаблицаРасшифровкаПлатежа.НомерСтроки = ДенежныеСредстваКВыплате.НомерСтроки
	|ГДЕ
	|	ДенежныеСредстваКВыплате.Заказ ССЫЛКА Документ.ЗаявкаНаВозвратТоваровОтКлиента
	|	ИЛИ ДенежныеСредстваКВыплате.Заказ ССЫЛКА Документ.ВозвратТоваровОтКлиента
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	Расчеты.ЗаказКлиента КАК ЗаказКлиента,
	|	Расчеты.Валюта КАК Валюта,
	|	Расчеты.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	СУММА(Расчеты.КОплатеПриход) КАК КОплатеПриход
	|
	|ПОМЕСТИТЬ ВтВозвратыКлиентамОплата
	|ИЗ
	|	ВтВозвратыКлиентамОплатаВрем КАК Расчеты
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаказКлиента,
	|	Валюта,
	|	АналитикаУчетаПоПартнерам
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	АналитикаУчетаПоПартнерам,
	|	Валюта,
	|	ЗаказКлиента
	|;
	|///////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Расчеты.Период КАК Период,
	|	Расчеты.ЗаказКлиента КАК ЗаказКлиента,
	|	Расчеты.Валюта КАК Валюта,
	|	Расчеты.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	
	|	МАКСИМУМ(Расчеты.КОплатеРасход) КАК КОплатеРасход,
	|	СУММА(ЕСТЬNULL(РасчетыИтоги.КОплатеРасход, 0)) КАК КОплатеРасходИтог,
	|	МАКСИМУМ(ЕСТЬNULL(РасчетыОплата.КОплатеПриход, 0)) КАК КОплатеПриход
	|
	|ПОМЕСТИТЬ ВтВозвратыКлиентам
	|ИЗ
	|	ВтВозвратыКлиентамКОплате КАК Расчеты
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		ВтВозвратыКлиентамКОплате КАК РасчетыИтоги
	|	ПО
	|		Расчеты.АналитикаУчетаПоПартнерам = РасчетыИтоги.АналитикаУчетаПоПартнерам
	|		И Расчеты.ЗаказКлиента = РасчетыИтоги.ЗаказКлиента
	|		И Расчеты.Валюта = РасчетыИтоги.Валюта
	|		И Расчеты.Период > РасчетыИтоги.Период
	|		
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		ВтВозвратыКлиентамОплата КАК РасчетыОплата
	|	ПО
	|		Расчеты.АналитикаУчетаПоПартнерам = РасчетыОплата.АналитикаУчетаПоПартнерам
	|		И Расчеты.ЗаказКлиента = РасчетыОплата.ЗаказКлиента
	|		И Расчеты.Валюта = РасчетыОплата.Валюта
	|
	|СГРУППИРОВАТЬ ПО
	|	Расчеты.Период,
	|	Расчеты.ЗаказКлиента,
	|	Расчеты.Валюта,
	|	Расчеты.АналитикаУчетаПоПартнерам
	|;
	|/////////////////////////////////////////////////////////////////////////////
	|";

	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаВременнаяТаблицаВозвратыОтПоставщиков()
	
	ТекстЗапроса = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Расчеты.Период КАК Период,
	|	Расчеты.ЗаказПоставщику КАК ЗаказПоставщику,
	|	Расчеты.Валюта КАК Валюта,
	|	Расчеты.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	Расчеты.КОплатеПриход КАК КОплатеПриход
	|ПОМЕСТИТЬ ВтВозвратыОтПоставщиковКОплате
	|ИЗ
	|	РегистрНакопления.РасчетыСПоставщиками.Обороты(
	|		&ДатаНачала,
	|		&ДатаОкончания,
	|		День,
	|		АналитикаУчетаПоПартнерам В (
	|			ВЫБРАТЬ
	|				Аналитика.КлючАналитики КАК КлючАналитики
	|			ИЗ
	|				АналитикаУчетаПоПартнерам КАК Аналитика
	|			)
	|			И ЗаказПоставщику ССЫЛКА Документ.ВозвратТоваровПоставщику
	|	) КАК Расчеты
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	АналитикаУчетаПоПартнерам,
	|	Валюта,
	|	ЗаказПоставщику
	|;
	|///////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Расчеты.ЗаказПоставщику КАК ЗаказПоставщику,
	|	Расчеты.Валюта КАК Валюта,
	|	Расчеты.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	
	|	- Расчеты.КОплатеНачальныйОстаток
	|	+ Расчеты.КОплатеРасход КАК КОплатеРасход
	|
	|ПОМЕСТИТЬ ВтВозвратыОтПоставщиковОплата
	|ИЗ
	|	РегистрНакопления.РасчетыСПоставщиками.ОстаткиИОбороты(
	|		&ДатаНачала,
	|		,
	|		Период,
	|		,
	|		АналитикаУчетаПоПартнерам В (
	|			ВЫБРАТЬ
	|				Аналитика.КлючАналитики КАК КлючАналитики
	|			ИЗ
	|				АналитикаУчетаПоПартнерам КАК Аналитика
	|			)
	|	) КАК Расчеты
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	АналитикаУчетаПоПартнерам,
	|	Валюта,
	|	ЗаказПоставщику
	|;
	|///////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Расчеты.Период КАК Период,
	|	Расчеты.ЗаказПоставщику КАК ЗаказПоставщику,
	|	Расчеты.Валюта КАК Валюта,
	|	Расчеты.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	
	|	МАКСИМУМ(Расчеты.КОплатеПриход) КАК КОплатеПриход,
	|	СУММА(ЕСТЬNULL(РасчетыИтоги.КОплатеПриход, 0)) КАК КОплатеПриходИтог,
	|	МАКСИМУМ(ЕСТЬNULL(РасчетыОплата.КОплатеРасход, 0)) КАК КОплатеРасход
	|
	|ПОМЕСТИТЬ ВтВозвратыОтПоставщиков
	|ИЗ
	|	ВтВозвратыОтПоставщиковКОплате КАК Расчеты
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		ВтВозвратыОтПоставщиковКОплате КАК РасчетыИтоги
	|	ПО
	|		Расчеты.АналитикаУчетаПоПартнерам = РасчетыИтоги.АналитикаУчетаПоПартнерам
	|		И Расчеты.ЗаказПоставщику = РасчетыИтоги.ЗаказПоставщику
	|		И Расчеты.Валюта = РасчетыИтоги.Валюта
	|		И Расчеты.Период > РасчетыИтоги.Период
	|		
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		ВтВозвратыОтПоставщиковОплата КАК РасчетыОплата
	|	ПО
	|		Расчеты.АналитикаУчетаПоПартнерам = РасчетыОплата.АналитикаУчетаПоПартнерам
	|		И Расчеты.ЗаказПоставщику = РасчетыОплата.ЗаказПоставщику
	|		И Расчеты.Валюта = РасчетыОплата.Валюта
	|
	|СГРУППИРОВАТЬ ПО
	|	Расчеты.Период,
	|	Расчеты.ЗаказПоставщику,
	|	Расчеты.Валюта,
	|	Расчеты.АналитикаУчетаПоПартнерам
	|		
	|;
	|/////////////////////////////////////////////////////////////////////////////
	|";

	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаВременнаяТаблицаВыплатыПоКредитамДепозитам()
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВЫБОР 
	|		КОГДА ТИПЗНАЧЕНИЯ(ОборотыДСКонтрагент.Регистратор) = ТИП(Документ.СписаниеБезналичныхДенежныхСредств)
	|			ТОГДА ВЫРАЗИТЬ(ОборотыДСКонтрагент.Регистратор КАК Документ.СписаниеБезналичныхДенежныхСредств).ЗаявкаНаРасходованиеДенежныхСредств
	|		КОГДА ТИПЗНАЧЕНИЯ(ОборотыДСКонтрагент.Регистратор) = ТИП(Документ.РасходныйКассовыйОрдер)
	|			ТОГДА ВЫРАЗИТЬ(ОборотыДСКонтрагент.Регистратор КАК Документ.РасходныйКассовыйОрдер).ЗаявкаНаРасходованиеДенежныхСредств
	|		ИНАЧЕ 
	|			НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ЗаявкаНаРасход,
	|	ОборотыДСКонтрагент.Договор КАК Договор,
	|	ОборотыДСКонтрагент.СтатьяДвиженияДенежныхСредств КАК СтатьяДДС,
	|	СУММА(ОборотыДСКонтрагент.СуммаОплатыВВалютеПлатежаОборот) КАК СуммаОплаты
	|ПОМЕСТИТЬ ВыплатыПоКредитамДепозитам
	|ИЗ
	|	РегистрНакопления.ДвиженияДенежныеСредстваКонтрагент.Обороты(
	|		&ДатаНачала, 
	|		&ГраницаДатаОкончания, 
	|		Регистратор, 
	|		ХозяйственнаяОперация В (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОплатаПоКредитам), 
	|								ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПеречислениеНаДепозиты),
	|								ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыдачаЗаймов), 
	|								ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОплатаПроцентовПоКредитам))
	|	) КАК ОборотыДСКонтрагент
	|
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР 
	|		КОГДА ТИПЗНАЧЕНИЯ(ОборотыДСКонтрагент.Регистратор) = ТИП(Документ.СписаниеБезналичныхДенежныхСредств)
	|			ТОГДА ВЫРАЗИТЬ(ОборотыДСКонтрагент.Регистратор КАК Документ.СписаниеБезналичныхДенежныхСредств).ЗаявкаНаРасходованиеДенежныхСредств
	|		КОГДА ТИПЗНАЧЕНИЯ(ОборотыДСКонтрагент.Регистратор) = ТИП(Документ.РасходныйКассовыйОрдер)
	|			ТОГДА ВЫРАЗИТЬ(ОборотыДСКонтрагент.Регистратор КАК Документ.РасходныйКассовыйОрдер).ЗаявкаНаРасходованиеДенежныхСредств
	|		ИНАЧЕ 
	|			НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ОборотыДСКонтрагент.Договор,
	|	ОборотыДСКонтрагент.СтатьяДвиженияДенежныхСредств
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВЫБОР 
	|		КОГДА ТИПЗНАЧЕНИЯ(ОборотыДС.Регистратор) = ТИП(Документ.СписаниеБезналичныхДенежныхСредств)
	|			ТОГДА ВЫРАЗИТЬ(ОборотыДС.Регистратор КАК Документ.СписаниеБезналичныхДенежныхСредств).ЗаявкаНаРасходованиеДенежныхСредств
	|		КОГДА ТИПЗНАЧЕНИЯ(ОборотыДС.Регистратор) = ТИП(Документ.РасходныйКассовыйОрдер)
	|			ТОГДА ВЫРАЗИТЬ(ОборотыДС.Регистратор КАК Документ.РасходныйКассовыйОрдер).ЗаявкаНаРасходованиеДенежныхСредств
	|		ИНАЧЕ 
	|			НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ОборотыДС.КорДенежныеСредства,
	|	ОборотыДС.СтатьяДвиженияДенежныхСредств,
	|	СУММА(ОборотыДС.СуммаОборот)
	|ИЗ
	|	РегистрНакопления.ДвиженияДенежныхСредств.Обороты(
	|		&ДатаНачала, 
	|		&ГраницаДатаОкончания, 
	|		Регистратор, 
	|		ХозяйственнаяОперация В (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПеречислениеНаДепозиты))
	|	) КАК ОборотыДС
	|
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР 
	|		КОГДА ТИПЗНАЧЕНИЯ(ОборотыДС.Регистратор) = ТИП(Документ.СписаниеБезналичныхДенежныхСредств)
	|			ТОГДА ВЫРАЗИТЬ(ОборотыДС.Регистратор КАК Документ.СписаниеБезналичныхДенежныхСредств).ЗаявкаНаРасходованиеДенежныхСредств
	|		КОГДА ТИПЗНАЧЕНИЯ(ОборотыДС.Регистратор) = ТИП(Документ.РасходныйКассовыйОрдер)
	|			ТОГДА ВЫРАЗИТЬ(ОборотыДС.Регистратор КАК Документ.РасходныйКассовыйОрдер).ЗаявкаНаРасходованиеДенежныхСредств
	|		ИНАЧЕ 
	|			НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ОборотыДС.КорДенежныеСредства,
	|	ОборотыДС.СтатьяДвиженияДенежныхСредств
	|	
	|"
	+"
	|
	|;
	|/////////////////////////////////////////////////////////////////////////////
	|";

	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаПоДенежнымСредствамКВыплате()

	ТекстЗапроса = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВЫБОР КОГДА Заявка.ДатаПлатежа = ДАТАВРЕМЯ(1, 1, 1) ТОГДА
	|		НАЧАЛОПЕРИОДА(Заявка.ЖелательнаяДатаПлатежа, ДЕНЬ)
	|	ИНАЧЕ
	|		НАЧАЛОПЕРИОДА(Заявка.ДатаПлатежа, ДЕНЬ)
	|	КОНЕЦ КАК День,
	|
	|	ВЫБОР КОГДА Заявка.ДатаПлатежа = ДАТАВРЕМЯ(1, 1, 1) ТОГДА
	|		Заявка.ЖелательнаяДатаПлатежа
	|	ИНАЧЕ
	|		Заявка.ДатаПлатежа
	|	КОНЕЦ КАК ДатаПлатежа,
	|
	|	Заявка.Ссылка КАК Документ,
	|	Заявка.Дата КАК ДатаДокумента,
	|	ВЫБОР
	|		КОГДА Заявка.ФормаОплатыЗаявки = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Наличная)
	|				И Заявка.Касса <> ЗНАЧЕНИЕ(Справочник.Кассы.ПустаяСсылка)
	|			ТОГДА Заявка.Касса.ВалютаДенежныхСредств
	|		КОГДА Заявка.ФормаОплатыЗаявки = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Безналичная)
	|				И Заявка.БанковскийСчет <> ЗНАЧЕНИЕ(Справочник.БанковскиеСчетаОрганизаций.ПустаяСсылка)
	|			ТОГДА Заявка.БанковскийСчет.ВалютаДенежныхСредств
	|		ИНАЧЕ Заявка.Валюта
	|	КОНЕЦ КАК Валюта,
	|	Заявка.Валюта КАК ВалютаПлатежа,
	|	Заявка.Организация КАК Организация,
	|	Заявка.Подразделение КАК Подразделение,
	|	
	|	ВЫБОР КОГДА Заявка.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОплатаПоставщику)
	|		ИЛИ Заявка.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратОплатыКлиенту)
	|	ТОГДА
	|		Заявка.Контрагент
	|	КОГДА Заявка.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыдачаДенежныхСредствПодотчетнику) ТОГДА
	|		Заявка.ПодотчетноеЛицо
	|	КОГДА Заявка.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОплатаДенежныхСредствВДругуюОрганизацию) ТОГДА
	|		Заявка.ОрганизацияПолучатель
	|	КОГДА Заявка.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПрочаяВыдачаДенежныхСредств) ТОГДА
	|		Заявка.Контрагент
	|	КОГДА Заявка.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПеречислениеВБюджет) ТОГДА
	|		Заявка.Контрагент
	|	КОГДА Заявка.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПрочиеРасходы) ТОГДА
	|		Заявка.Контрагент
	|	КОНЕЦ КАК Получатель,
	|
	|	ВЫБОР КОГДА Заявка.ФормаОплатыЗаявки = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Наличная) ТОГДА
	|		Заявка.Касса
	|	КОГДА Заявка.ФормаОплатыЗаявки = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Безналичная) ТОГДА
	|		Заявка.БанковскийСчет
	|	ИНАЧЕ
	|		Неопределено
	|	КОНЕЦ КАК БанковскийСчетКасса,
	|	
	|	ВЫБОР КОГДА Заявка.ФормаОплатыЗаявки = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Наличная) ТОГДА
	|		ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.Наличные)
	|	КОГДА Заявка.ФормаОплатыЗаявки = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Безналичная) ТОГДА
	|		ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.Безналичные)
	|	ИНАЧЕ
	|		Неопределено
	|	КОНЕЦ КАК ТипДенежныхСредств,
	|	
	|	3 КАК СтатусПлатежа, // ""Запланированный платеж""
	|
	|	ВЫБОР
	|		КОГДА Заявка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаРасходованиеДенежныхСредств.КОплате)
	|			ТОГДА 3
	|		КОГДА Заявка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаРасходованиеДенежныхСредств.Согласована)
	|			ТОГДА 6
	|		ИНАЧЕ 8
	|	КОНЕЦ КАК ПорядокПлатежа,
	|	
	|	ДенежныеСредства.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
	|	&СтрокаЗаявкаНомер + Заявка.Номер КАК Платеж,
	|	Заявка.Приоритет КАК Приоритет,
	|	Неопределено КАК Заказ,
	|	РегистрАналитикаУчетаПоПартнерам.Партнер КАК Партнер,
	|	ДенежныеСредства.СуммаОстаток КАК Сумма,
	|	Заявка.СуммаДокумента КАК СуммаПлатежа,
	|	ВЫБОР КОГДА ДенежныеСредства.СуммаОстаток < 0
	|		ТОГДА -ДенежныеСредства.СуммаОстаток
	|		ИНАЧЕ ДенежныеСредства.СуммаОстаток
	|	КОНЕЦ КАК ОсталосьОплатить
	|
	|ПОМЕСТИТЬ ДенежныеСредстваКВыплатеГрафикПлатежей
	|ИЗ
	|	РегистрНакопления.ДенежныеСредстваКВыплате.Остатки(&ГраницаДатаОкончания) КАК ДенежныеСредства
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.ЗаявкаНаРасходованиеДенежныхСредств КАК Заявка
	|	ПО
	|		ДенежныеСредства.ЗаявкаНаРасходованиеДенежныхСредств = Заявка.Ссылка
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		РегистрСведений.АналитикаУчетаПоПартнерам КАК РегистрАналитикаУчетаПоПартнерам
	|	ПО
	|		ДенежныеСредства.АналитикаУчетаПоПартнерам = РегистрАналитикаУчетаПоПартнерам.КлючАналитики
	|	
	|ГДЕ
	|	(Заявка.Организация = &Организация ИЛИ &Организация = Неопределено)
	|	И (ВЫБОР
	|		КОГДА Заявка.ФормаОплатыЗаявки = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Наличная)
	|				И Заявка.Касса <> ЗНАЧЕНИЕ(Справочник.Кассы.ПустаяСсылка)
	|			ТОГДА Заявка.Касса.ВалютаДенежныхСредств
	|		КОГДА Заявка.ФормаОплатыЗаявки = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Безналичная)
	|				И Заявка.БанковскийСчет <> ЗНАЧЕНИЕ(Справочник.БанковскиеСчетаОрганизаций.ПустаяСсылка)
	|			ТОГДА Заявка.БанковскийСчет.ВалютаДенежныхСредств
	|		ИНАЧЕ Заявка.Валюта
	|	КОНЕЦ = &Валюта ИЛИ &Валюта = НЕОПРЕДЕЛЕНО)
	|	И (ВЫБОР КОГДА Заявка.ДатаПлатежа = ДАТАВРЕМЯ(1, 1, 1) ТОГДА
	|			Заявка.ЖелательнаяДатаПлатежа
	|		ИНАЧЕ
	|			Заявка.ДатаПлатежа
	|		КОНЕЦ >= &ДатаНачала)
	|	И НЕ Заявка.ХозяйственнаяОперация В (
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОплатаПоКредитам),
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПеречислениеНаДепозиты),
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыдачаЗаймов))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(Распоряжение.ДатаПлатежа, ДЕНЬ) КАК День,
	|	Распоряжение.ДатаПлатежа КАК ДатаПлатежа,
	|	Распоряжение.Ссылка КАК Документ,
	|	Распоряжение.Дата КАК ДатаДокумента,
	|	ВЫБОР
	|		КОГДА Распоряжение.Касса <> ЗНАЧЕНИЕ(Справочник.Кассы.ПустаяСсылка)
	|			ТОГДА Распоряжение.Касса.ВалютаДенежныхСредств
	|		КОГДА Распоряжение.БанковскийСчет <> ЗНАЧЕНИЕ(Справочник.БанковскиеСчетаОрганизаций.ПустаяСсылка)
	|			ТОГДА Распоряжение.БанковскийСчет.ВалютаДенежныхСредств
	|		ИНАЧЕ Распоряжение.Валюта
	|	КОНЕЦ КАК Валюта,
	|	Распоряжение.Валюта КАК ВалютаПлатежа,
	|	Распоряжение.Организация КАК Организация,
	|	Неопределено КАК Подразделение,
	|	
	|	Неопределено КАК Получатель,
	|	ВЫБОР КОГДА Распоряжение.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СдачаДенежныхСредствВБанк)
	|		ИЛИ Распоряжение.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыдачаДенежныхСредствВДругуюКассу)
	|	ТОГДА
	|		Распоряжение.Касса
	|	КОГДА Распоряжение.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПеречислениеДенежныхСредствНаДругойСчет)
	|		ИЛИ Распоряжение.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПоступлениеДенежныхСредствИзБанка)
	|	ТОГДА
	|		Распоряжение.БанковскийСчет
	|	ИНАЧЕ
	|		Неопределено
	|	КОНЕЦ КАК БанковскийСчетКасса,
	|	
	|	ВЫБОР КОГДА Распоряжение.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СдачаДенежныхСредствВБанк)
	|		ИЛИ Распоряжение.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыдачаДенежныхСредствВДругуюКассу)
	|	ТОГДА
	|		ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.Наличные)
	|	КОГДА Распоряжение.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПеречислениеДенежныхСредствНаДругойСчет)
	|		ИЛИ Распоряжение.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПоступлениеДенежныхСредствИзБанка)
	|	ТОГДА
	|		ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.Безналичные)
	|	ИНАЧЕ
	|		Неопределено
	|	КОНЕЦ КАК ТипДенежныхСредств,
	|	
	|	3 КАК СтатусПлатежа,
	|
	|	ВЫБОР
	|		КОГДА Распоряжение.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыРаспоряженийНаПеремещениеДенежныхСредств.КОплате)
	|			ТОГДА 2
	|		КОГДА Распоряжение.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыРаспоряженийНаПеремещениеДенежныхСредств.Согласовано)
	|			ТОГДА 5
	|		ИНАЧЕ 7
	|	КОНЕЦ КАК ПорядокПлатежа,
	|	
	|	ДенежныеСредства.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
	|	""Распоряжение №"" + Распоряжение.Номер КАК Платеж,
	|	Неопределено КАК Приоритет,
	|	Неопределено КАК Заказ,
	|	Неопределено КАК Партнер,
	|
	|	ДенежныеСредства.СуммаОстаток КАК Сумма,
	|	Распоряжение.СуммаДокумента КАК СуммаПлатежа,
	|	ВЫБОР
	|		КОГДА ДенежныеСредства.СуммаОстаток < 0
	|			ТОГДА -ДенежныеСредства.СуммаОстаток
	|				ИНАЧЕ ДенежныеСредства.СуммаОстаток
	|	КОНЕЦ КАК ОсталосьОплатить
	|
	|ИЗ
	|	РегистрНакопления.ДенежныеСредстваКВыплате.Остатки(&ГраницаДатаОкончания) КАК ДенежныеСредства
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.РаспоряжениеНаПеремещениеДенежныхСредств КАК Распоряжение
	|	ПО
	|		ДенежныеСредства.ЗаявкаНаРасходованиеДенежныхСредств = Распоряжение.Ссылка
	|		
	|ГДЕ
	|	(Распоряжение.Организация = &Организация
	|		ИЛИ &Организация = Неопределено)
	|	И (ВЫБОР
	|		КОГДА Распоряжение.Касса <> ЗНАЧЕНИЕ(Справочник.Кассы.ПустаяСсылка)
	|			ТОГДА Распоряжение.Касса.ВалютаДенежныхСредств
	|		КОГДА Распоряжение.БанковскийСчет <> ЗНАЧЕНИЕ(Справочник.БанковскиеСчетаОрганизаций.ПустаяСсылка)
	|			ТОГДА Распоряжение.БанковскийСчет.ВалютаДенежныхСредств
	|		ИНАЧЕ Распоряжение.Валюта
	|	КОНЕЦ = &Валюта
	|			ИЛИ &Валюта = НЕОПРЕДЕЛЕНО)
	|	И Распоряжение.ДатаПлатежа >= &ДатаНачала
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВЫБОР КОГДА Распоряжение.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СдачаДенежныхСредствВБанк)
	|		И ЕСТЬNULL(Распоряжение.Касса.СрокИнкассации, 0) > 0
	|	ТОГДА
	|		НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(Распоряжение.ДатаПлатежа, ДЕНЬ, Распоряжение.Касса.СрокИнкассации), ДЕНЬ)
	|
	|	КОГДА Распоряжение.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПеречислениеДенежныхСредствНаДругойСчет)
	|		И ЕСТЬNULL(Распоряжение.БанковскийСчет.СрокИсполненияПлатежа, 0) > 0
	|	ТОГДА
	|		НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(Распоряжение.ДатаПлатежа, ДЕНЬ, Распоряжение.БанковскийСчет.СрокИсполненияПлатежа), ДЕНЬ)
	|
	|	ИНАЧЕ
	|		НАЧАЛОПЕРИОДА(Распоряжение.ДатаПлатежа, ДЕНЬ)
	|	КОНЕЦ КАК День,
	|
	|	ВЫБОР КОГДА Распоряжение.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СдачаДенежныхСредствВБанк)
	|		И ЕСТЬNULL(Распоряжение.Касса.СрокИнкассации, 0) > 0
	|	ТОГДА
	|		ДОБАВИТЬКДАТЕ(Распоряжение.ДатаПлатежа, ДЕНЬ, Распоряжение.Касса.СрокИнкассации)
	|
	|	КОГДА Распоряжение.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПеречислениеДенежныхСредствНаДругойСчет)
	|		И ЕСТЬNULL(Распоряжение.БанковскийСчет.СрокИсполненияПлатежа, 0) > 0
	|	ТОГДА
	|		ДОБАВИТЬКДАТЕ(Распоряжение.ДатаПлатежа, ДЕНЬ, Распоряжение.БанковскийСчет.СрокИсполненияПлатежа)
	|
	|	ИНАЧЕ
	|		Распоряжение.ДатаПлатежа
	|	КОНЕЦ КАК ДатаПлатежа,
	|
	|	Распоряжение.Ссылка КАК Документ,
	|	Распоряжение.Дата КАК ДатаДокумента,
	|	ВЫБОР
	|		КОГДА Распоряжение.Касса <> ЗНАЧЕНИЕ(Справочник.Кассы.ПустаяСсылка)
	|			ТОГДА Распоряжение.Касса.ВалютаДенежныхСредств
	|		КОГДА Распоряжение.БанковскийСчет <> ЗНАЧЕНИЕ(Справочник.БанковскиеСчетаОрганизаций.ПустаяСсылка)
	|			ТОГДА Распоряжение.БанковскийСчет.ВалютаДенежныхСредств
	|		ИНАЧЕ Распоряжение.Валюта
	|	КОНЕЦ КАК Валюта,
	|	Распоряжение.Валюта КАК ВалютаПлатежа,
	|
	|	Распоряжение.Организация КАК Организация,
	|	Неопределено КАК Подразделение,
	|	
	|	Неопределено КАК Получатель,
	|	ВЫБОР КОГДА Распоряжение.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыдачаДенежныхСредствВДругуюКассу)
	|		ИЛИ Распоряжение.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПоступлениеДенежныхСредствИзБанка)
	|	ТОГДА
	|		Распоряжение.КассаПолучатель
	|	КОГДА Распоряжение.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПеречислениеДенежныхСредствНаДругойСчет)
	|		ИЛИ Распоряжение.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СдачаДенежныхСредствВБанк)
	|	ТОГДА
	|		Распоряжение.БанковскийСчетПолучатель
	|	ИНАЧЕ
	|		Неопределено
	|	КОНЕЦ КАК БанковскийСчетКасса,
	|	
	|	ВЫБОР КОГДА Распоряжение.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыдачаДенежныхСредствВДругуюКассу)
	|		ИЛИ Распоряжение.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПоступлениеДенежныхСредствИзБанка)
	|	ТОГДА
	|		ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.Наличные)
	|	КОГДА Распоряжение.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПеречислениеДенежныхСредствНаДругойСчет)
	|		ИЛИ Распоряжение.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СдачаДенежныхСредствВБанк)
	|	ТОГДА
	|		ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.Безналичные)
	|	ИНАЧЕ
	|		Неопределено
	|	КОНЕЦ КАК ТипДенежныхСредств,
	|	
	|	3 КАК СтатусПлатежа,
	|
	|	ВЫБОР
	|		КОГДА Распоряжение.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыРаспоряженийНаПеремещениеДенежныхСредств.КОплате)
	|			ТОГДА 2
	|		КОГДА Распоряжение.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыРаспоряженийНаПеремещениеДенежныхСредств.Согласовано)
	|			ТОГДА 5
	|		ИНАЧЕ 7
	|	КОНЕЦ КАК ПорядокПлатежа,
	|	
	|	ДенежныеСредства.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
	|	""Распоряжение №"" + Распоряжение.Номер КАК Платеж,
	|	Неопределено КАК Приоритет,
	|	Неопределено КАК Заказ,
	|	Неопределено КАК Партнер,
	|
	|	(-ДенежныеСредства.СуммаОстаток) КАК Сумма,
	|	Распоряжение.СуммаДокумента КАК СуммаПлатежа,
	|	ВЫБОР
	|		КОГДА ДенежныеСредства.СуммаОстаток < 0
	|			ТОГДА -ДенежныеСредства.СуммаОстаток
	|				ИНАЧЕ ДенежныеСредства.СуммаОстаток
	|	КОНЕЦ КАК ОсталосьОплатить
	|
	|ИЗ
	|	РегистрНакопления.ДенежныеСредстваКВыплате.Остатки(&ГраницаДатаОкончания) КАК ДенежныеСредства
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.РаспоряжениеНаПеремещениеДенежныхСредств КАК Распоряжение
	|	ПО
	|		ДенежныеСредства.ЗаявкаНаРасходованиеДенежныхСредств = Распоряжение.Ссылка
	|		
	|ГДЕ
	|	(ВЫБОР
	|		КОГДА Распоряжение.Касса <> ЗНАЧЕНИЕ(Справочник.Кассы.ПустаяСсылка)
	|			ТОГДА Распоряжение.Касса.ВалютаДенежныхСредств
	|		КОГДА Распоряжение.БанковскийСчет <> ЗНАЧЕНИЕ(Справочник.БанковскиеСчетаОрганизаций.ПустаяСсылка)
	|			ТОГДА Распоряжение.БанковскийСчет.ВалютаДенежныхСредств
	|		ИНАЧЕ Распоряжение.Валюта
	|	КОНЕЦ = &Валюта
	|			ИЛИ &Валюта = НЕОПРЕДЕЛЕНО)
	|	И Распоряжение.ДатаПлатежа >= &ДатаНачала
	|	И Распоряжение.Статус В (
	|		ЗНАЧЕНИЕ(Перечисление.СтатусыРаспоряженийНаПеремещениеДенежныхСредств.КОплате),
	|		ЗНАЧЕНИЕ(Перечисление.СтатусыРаспоряженийНаПеремещениеДенежныхСредств.Согласовано)
	|		)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВЫБОР КОГДА ЕСТЬNULL(Заявка.БанковскийСчет.СрокИсполненияПлатежа, 0) > 0 ТОГДА
	|		НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ВЫБОР КОГДА Заявка.ДатаПлатежа = ДАТАВРЕМЯ(1, 1, 1) ТОГДА
	|										Заявка.ЖелательнаяДатаПлатежа
	|									ИНАЧЕ
	|										Заявка.ДатаПлатежа
	|									КОНЕЦ, ДЕНЬ, Заявка.БанковскийСчет.СрокИсполненияПлатежа), ДЕНЬ)
	|	ИНАЧЕ
	|		НАЧАЛОПЕРИОДА(ВЫБОР КОГДА Заявка.ДатаПлатежа = ДАТАВРЕМЯ(1, 1, 1) ТОГДА
	|						Заявка.ЖелательнаяДатаПлатежа
	|					  ИНАЧЕ
	|						Заявка.ДатаПлатежа
	|					  КОНЕЦ, ДЕНЬ)
	|	КОНЕЦ КАК День,
	|
	|	ВЫБОР КОГДА ЕСТЬNULL(Заявка.БанковскийСчет.СрокИсполненияПлатежа, 0) > 0 ТОГДА
	|		ДОБАВИТЬКДАТЕ(ВЫБОР КОГДА Заявка.ДатаПлатежа = ДАТАВРЕМЯ(1, 1, 1) ТОГДА
	|						Заявка.ЖелательнаяДатаПлатежа
	|					  ИНАЧЕ
	|						Заявка.ДатаПлатежа
	|					  КОНЕЦ, ДЕНЬ, Заявка.БанковскийСчет.СрокИсполненияПлатежа)
	|	ИНАЧЕ
	|		ВЫБОР КОГДА Заявка.ДатаПлатежа = ДАТАВРЕМЯ(1, 1, 1) ТОГДА
	|			Заявка.ЖелательнаяДатаПлатежа
	|		ИНАЧЕ
	|			Заявка.ДатаПлатежа
	|		КОНЕЦ
	|	КОНЕЦ КАК ДатаПлатежа,
	|
	|	Заявка.Ссылка КАК Документ,
	|	Заявка.Дата КАК ДатаДокумента,
	|	ВЫБОР
	|		КОГДА Заявка.ФормаОплатыЗаявки = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Наличная)
	|				И Заявка.Касса <> ЗНАЧЕНИЕ(Справочник.Кассы.ПустаяСсылка)
	|			ТОГДА Заявка.Касса.ВалютаДенежныхСредств
	|		КОГДА Заявка.ФормаОплатыЗаявки = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Безналичная)
	|				И Заявка.БанковскийСчет <> ЗНАЧЕНИЕ(Справочник.БанковскиеСчетаОрганизаций.ПустаяСсылка)
	|			ТОГДА Заявка.БанковскийСчет.ВалютаДенежныхСредств
	|		ИНАЧЕ Заявка.Валюта
	|	КОНЕЦ КАК Валюта,
	|	Заявка.Валюта КАК ВалютаПлатежа,
	|
	|	ВЫБОР КОГДА Заявка.ФормаОплатыЗаявки = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Наличная) ТОГДА
	|		Заявка.КассаПолучатель.Владелец
	|	ИНАЧЕ
	|		Заявка.БанковскийСчетПолучатель.Владелец
	|	КОНЕЦ КАК Организация,
	|	Заявка.Подразделение КАК Подразделение,
	|	
	|	Неопределено КАК Получатель,
	|	ВЫБОР КОГДА Заявка.ФормаОплатыЗаявки = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Наличная) ТОГДА
	|		Заявка.КассаПолучатель
	|	ИНАЧЕ
	|		Заявка.БанковскийСчетПолучатель
	|	КОНЕЦ КАК БанковскийСчетКасса,
	|	
	|	ВЫБОР КОГДА Заявка.ФормаОплатыЗаявки = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Наличная) ТОГДА
	|		ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.Наличные)
	|	ИНАЧЕ
	|		ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.Безналичные)
	|	КОНЕЦ КАК ТипДенежныхСредств,
	|	
	|	3 КАК СтатусПлатежа,
	|
	|	ВЫБОР
	|		КОГДА Заявка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаРасходованиеДенежныхСредств.КОплате)
	|			ТОГДА 3
	|		КОГДА Заявка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаРасходованиеДенежныхСредств.Согласована)
	|			ТОГДА 6
	|		ИНАЧЕ 8
	|	КОНЕЦ КАК ПорядокПлатежа,
	|	
	|	ДенежныеСредства.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
	|	&СтрокаЗаявкаНомер + Заявка.Номер КАК Платеж,
	|	Неопределено КАК Приоритет,
	|	Неопределено КАК Заказ,
	|	РегистрАналитикаУчетаПоПартнерам.Партнер КАК Партнер,
	|
	|	(-ДенежныеСредства.СуммаОстаток) КАК Сумма,
	|	Заявка.СуммаДокумента КАК СуммаПлатежа,
	|	ВЫБОР
	|		КОГДА ДенежныеСредства.СуммаОстаток < 0
	|			ТОГДА -ДенежныеСредства.СуммаОстаток
	|				ИНАЧЕ ДенежныеСредства.СуммаОстаток
	|	КОНЕЦ КАК ОсталосьОплатить
	|
	|ИЗ
	|	РегистрНакопления.ДенежныеСредстваКВыплате.Остатки(&ГраницаДатаОкончания) КАК ДенежныеСредства
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.ЗаявкаНаРасходованиеДенежныхСредств КАК Заявка
	|	ПО
	|		ДенежныеСредства.ЗаявкаНаРасходованиеДенежныхСредств = Заявка.Ссылка
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		РегистрСведений.АналитикаУчетаПоПартнерам КАК РегистрАналитикаУчетаПоПартнерам
	|	ПО
	|		ДенежныеСредства.АналитикаУчетаПоПартнерам = РегистрАналитикаУчетаПоПартнерам.КлючАналитики
	|	
	|ГДЕ
	|	(ВЫБОР
	|		КОГДА Заявка.ФормаОплатыЗаявки = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Наличная)
	|				И Заявка.Касса <> ЗНАЧЕНИЕ(Справочник.Кассы.ПустаяСсылка)
	|			ТОГДА Заявка.Касса.ВалютаДенежныхСредств
	|		КОГДА Заявка.ФормаОплатыЗаявки = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Безналичная)
	|				И Заявка.БанковскийСчет <> ЗНАЧЕНИЕ(Справочник.БанковскиеСчетаОрганизаций.ПустаяСсылка)
	|			ТОГДА Заявка.БанковскийСчет.ВалютаДенежныхСредств
	|		ИНАЧЕ Заявка.Валюта
	|	КОНЕЦ = &Валюта
	|		ИЛИ &Валюта = НЕОПРЕДЕЛЕНО)
	|	И ВЫБОР КОГДА Заявка.ДатаПлатежа = ДАТАВРЕМЯ(1, 1, 1) ТОГДА
	|			Заявка.ЖелательнаяДатаПлатежа
	|		ИНАЧЕ
	|			Заявка.ДатаПлатежа
	|		КОНЕЦ >= &ДатаНачала
	|	И Заявка.Статус В (
	|		ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаРасходованиеДенежныхСредств.КОплате),
	|		ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаРасходованиеДенежныхСредств.Согласована)
	|		)
	|	И Заявка.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОплатаДенежныхСредствВДругуюОрганизацию)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВЫБОР КОГДА Заявка.ДатаПлатежа = ДАТАВРЕМЯ(1, 1, 1) ТОГДА
	|		НАЧАЛОПЕРИОДА(Заявка.ЖелательнаяДатаПлатежа, ДЕНЬ)
	|	ИНАЧЕ
	|		НАЧАЛОПЕРИОДА(Заявка.ДатаПлатежа, ДЕНЬ)
	|	КОНЕЦ КАК День,
	|
	|	ВЫБОР КОГДА Заявка.ДатаПлатежа = ДАТАВРЕМЯ(1, 1, 1) ТОГДА
	|		Заявка.ЖелательнаяДатаПлатежа
	|	ИНАЧЕ
	|		Заявка.ДатаПлатежа
	|	КОНЕЦ КАК ДатаПлатежа,
	|
	|	Заявка.Ссылка КАК Документ,
	|	Заявка.Дата КАК ДатаДокумента,
	|	Заявка.ВалютаКонвертации КАК Валюта,
	|	Заявка.ВалютаКонвертации КАК ВалютаПлатежа,
	|	Заявка.Организация КАК Организация,
	|	Заявка.Подразделение КАК Подразделение,
	|	Заявка.Контрагент КАК Получатель,
	|
	|	Неопределено КАК БанковскийСчетКасса,
	|	
	|	ВЫБОР КОГДА Заявка.ФормаОплатыЗаявки = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Наличная) ТОГДА
	|		ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.Наличные)
	|	КОГДА Заявка.ФормаОплатыЗаявки = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Безналичная) ТОГДА
	|		ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.Безналичные)
	|	ИНАЧЕ
	|		Неопределено
	|	КОНЕЦ КАК ТипДенежныхСредств,
	|	
	|	3 КАК СтатусПлатежа,
	|
	|	ВЫБОР
	|		КОГДА Заявка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаРасходованиеДенежныхСредств.КОплате)
	|			ТОГДА 3
	|		КОГДА Заявка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаРасходованиеДенежныхСредств.Согласована)
	|			ТОГДА 6
	|		ИНАЧЕ 8
	|	КОНЕЦ КАК ПорядокПлатежа,
	|	
	|	ДенежныеСредства.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
	|	&СтрокаЗаявкаНомер + Заявка.Номер КАК Платеж,
	|	Заявка.Приоритет КАК Приоритет,
	|	Неопределено КАК Заказ,
	|	Неопределено КАК Партнер,
	|	Заявка.СуммаПослеКонвертации КАК Сумма,
	|	Заявка.СуммаПослеКонвертации КАК СуммаПлатежа,
	|	Заявка.СуммаПослеКонвертации КАК ОсталосьОплатить
	|
	|ИЗ
	|	РегистрНакопления.ДенежныеСредстваКВыплате.Остатки(&ГраницаДатаОкончания) КАК ДенежныеСредства
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.ЗаявкаНаРасходованиеДенежныхСредств КАК Заявка
	|	ПО
	|		ДенежныеСредства.ЗаявкаНаРасходованиеДенежныхСредств = Заявка.Ссылка
	|		
	|ГДЕ
	|	Заявка.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КонвертацияВалюты)
	|	И (Заявка.Организация = &Организация
	|		ИЛИ &Организация = Неопределено)
	|	И (Заявка.Валюта = &Валюта
	|		ИЛИ &Валюта = Неопределено)
	|	И (	
	|		ВЫБОР КОГДА Заявка.ДатаПлатежа = ДАТАВРЕМЯ(1, 1, 1) ТОГДА
	|			Заявка.ЖелательнаяДатаПлатежа
	|		ИНАЧЕ
	|			Заявка.ДатаПлатежа
	|		КОНЕЦ >= &ДатаНачала)
	|
	//++ НЕ УТ
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВЫБОР КОГДА Заявка.ДатаПлатежа = ДАТАВРЕМЯ(1, 1, 1) ТОГДА
	|		НАЧАЛОПЕРИОДА(Заявка.ЖелательнаяДатаПлатежа, ДЕНЬ)
	|	ИНАЧЕ
	|		НАЧАЛОПЕРИОДА(Заявка.ДатаПлатежа, ДЕНЬ)
	|	КОНЕЦ КАК День,
	|
	|	ВЫБОР КОГДА Заявка.ДатаПлатежа = ДАТАВРЕМЯ(1, 1, 1) ТОГДА
	|		Заявка.ЖелательнаяДатаПлатежа
	|	ИНАЧЕ
	|		Заявка.ДатаПлатежа
	|	КОНЕЦ КАК ДатаПлатежа,
	|
	|	Заявка.Ссылка КАК Документ,
	|	Заявка.Дата КАК ДатаДокумента,
	|	ВЫБОР
	|		КОГДА Заявка.ФормаОплатыЗаявки = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Наличная)
	|				И Заявка.Касса <> ЗНАЧЕНИЕ(Справочник.Кассы.ПустаяСсылка)
	|			ТОГДА Заявка.Касса.ВалютаДенежныхСредств
	|		КОГДА Заявка.ФормаОплатыЗаявки = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Безналичная)
	|				И Заявка.БанковскийСчет <> ЗНАЧЕНИЕ(Справочник.БанковскиеСчетаОрганизаций.ПустаяСсылка)
	|			ТОГДА Заявка.БанковскийСчет.ВалютаДенежныхСредств
	|		ИНАЧЕ Заявка.Валюта
	|	КОНЕЦ КАК Валюта,
	|	Заявка.Валюта КАК ВалютаПлатежа,
	|	Заявка.Организация КАК Организация,
	|	Заявка.Подразделение КАК Подразделение,
	|	
	|	ВЫБОР КОГДА Заявка.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОплатаПоставщику)
	|		ИЛИ Заявка.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратОплатыКлиенту)
	|	ТОГДА
	|		Заявка.Контрагент
	|	КОГДА Заявка.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыдачаДенежныхСредствПодотчетнику) ТОГДА
	|		Заявка.ПодотчетноеЛицо
	|	КОГДА Заявка.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОплатаДенежныхСредствВДругуюОрганизацию) ТОГДА
	|		Заявка.ОрганизацияПолучатель
	|	КОГДА Заявка.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПрочаяВыдачаДенежныхСредств) ТОГДА
	|		Заявка.Контрагент
	|	КОГДА Заявка.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПеречислениеВБюджет) ТОГДА
	|		Заявка.Контрагент
	|	КОГДА Заявка.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПрочиеРасходы) ТОГДА
	|		Заявка.Контрагент
	|	КОНЕЦ КАК Получатель,
	|
	|	ВЫБОР КОГДА Заявка.ФормаОплатыЗаявки = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Наличная) ТОГДА
	|		Заявка.Касса
	|	КОГДА Заявка.ФормаОплатыЗаявки = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Безналичная) ТОГДА
	|		Заявка.БанковскийСчет
	|	ИНАЧЕ
	|		Неопределено
	|	КОНЕЦ КАК БанковскийСчетКасса,
	|	
	|	ВЫБОР КОГДА Заявка.ФормаОплатыЗаявки = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Наличная) ТОГДА
	|		ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.Наличные)
	|	КОГДА Заявка.ФормаОплатыЗаявки = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Безналичная) ТОГДА
	|		ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.Безналичные)
	|	ИНАЧЕ
	|		Неопределено
	|	КОНЕЦ КАК ТипДенежныхСредств,
	|	
	|	3 КАК СтатусПлатежа,
	|
	|	ВЫБОР
	|		КОГДА Заявка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаРасходованиеДенежныхСредств.КОплате)
	|			ТОГДА 3
	|		КОГДА Заявка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаРасходованиеДенежныхСредств.Согласована)
	|			ТОГДА 6
	|		ИНАЧЕ 8
	|	КОНЕЦ КАК ПорядокПлатежа,
	|	
	|	ДенежныеСредства.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
	|	&СтрокаЗаявкаНомер + Заявка.Номер КАК Платеж,
	|	Заявка.Приоритет КАК Приоритет,
	|	Неопределено КАК Заказ,
	|	Неопределено КАК Партнер,
	|	СУММА(ДенежныеСредства.СуммаОстаток) КАК Сумма,
	|	Заявка.СуммаДокумента КАК СуммаПлатежа,
	|	ВЫБОР
	|		КОГДА СУММА(ДенежныеСредства.СуммаОстаток) < 0
	|			ТОГДА -СУММА(ДенежныеСредства.СуммаОстаток)
	|				ИНАЧЕ СУММА(ДенежныеСредства.СуммаОстаток)
	|	КОНЕЦ КАК ОсталосьОплатить
	|
	|ИЗ
	|	РегистрНакопления.ДенежныеСредстваКВыплате.Остатки(
	|		&ГраницаДатаОкончания,
	|		ТИПЗНАЧЕНИЯ(ЗаявкаНаРасходованиеДенежныхСредств) В 
	|		(ТИП(Документ.ВедомостьНаВыплатуЗарплатыВБанк), ТИП(Документ.ВедомостьНаВыплатуЗарплатыВКассу),
	|		ТИП(Документ.ВедомостьНаВыплатуЗарплатыПеречислением), ТИП(Документ.ВедомостьНаВыплатуЗарплатыРаздатчиком))
	|	) КАК ДенежныеСредства
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.ЗаявкаНаРасходованиеДенежныхСредств.ВедомостиНаВыплатуЗарплаты КАК ТаблицаВедомости
	|	ПО
	|		ДенежныеСредства.ЗаявкаНаРасходованиеДенежныхСредств = ТаблицаВедомости.Ведомость
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.ЗаявкаНаРасходованиеДенежныхСредств КАК Заявка
	|	ПО
	|		ТаблицаВедомости.Ссылка = Заявка.Ссылка
	|		И Заявка.Ссылка.Проведен
	|	
	|ГДЕ
	|	(Заявка.Организация = &Организация
	|		ИЛИ &Организация = Неопределено)
	|	И (&Валюта = &ВалютаРегламентированногоУчета
	|		ИЛИ &Валюта = Неопределено)
	|
	|СГРУППИРОВАТЬ ПО
	|	Заявка.Ссылка,
	|	ДенежныеСредства.СтатьяДвиженияДенежныхСредств
	|	
	|
	//-- НЕ УТ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА Заявка.ДатаПлатежа = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА НАЧАЛОПЕРИОДА(Заявка.ЖелательнаяДатаПлатежа, ДЕНЬ)
	|		ИНАЧЕ НАЧАЛОПЕРИОДА(Заявка.ДатаПлатежа, ДЕНЬ)
	|	КОНЕЦ КАК День,
	|	ВЫБОР КОГДА Заявка.ДатаПлатежа = ДАТАВРЕМЯ(1, 1, 1)
	|		ТОГДА Заявка.ЖелательнаяДатаПлатежа
	|		ИНАЧЕ Заявка.ДатаПлатежа
	|	КОНЕЦ КАК ДатаПлатежа,
	|	Заявка.Ссылка КАК Документ,
	|	Заявка.Дата КАК ДатаДокумента,
	|	Заявка.Валюта КАК Валюта,
	|	Заявка.Валюта КАК ВалютаПлатежа,
	|	Заявка.Организация КАК Организация,
	|	Заявка.Подразделение КАК Подразделение,
	|	ЗаявкаРасшифровкаПлатежа.ДоговорКредитаДепозита КАК Получатель,
	|	ВЫБОР
	|		КОГДА Заявка.ФормаОплатыЗаявки = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Наличная)
	|			ТОГДА Заявка.Касса
	|		КОГДА Заявка.ФормаОплатыЗаявки = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Безналичная)
	|			ТОГДА Заявка.БанковскийСчет
	|		ИНАЧЕ
	|			НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК БанковскийСчетКасса,
	|	ВЫБОР
	|		КОГДА Заявка.ФормаОплатыЗаявки = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Наличная)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.Наличные)
	|		КОГДА Заявка.ФормаОплатыЗаявки = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Безналичная)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.Безналичные)
	|		ИНАЧЕ 
	|			НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ТипДенежныхСредств,
	|	3 КАК СтатусПлатежа,
	|	ВЫБОР
	|		КОГДА Заявка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаРасходованиеДенежныхСредств.КОплате)
	|			ТОГДА 3
	|		КОГДА Заявка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаРасходованиеДенежныхСредств.Согласована)
	|			ТОГДА 6
	|		ИНАЧЕ 8
	|	КОНЕЦ КАК ПорядокПлатежа,
	|	ЗаявкаРасшифровкаПлатежа.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
	|	&СтрокаЗаявкаНомер + Заявка.Номер КАК Платеж,
	|	Заявка.Приоритет КАК Приоритет,
	|	НЕОПРЕДЕЛЕНО КАК Заказ,
	|	НЕОПРЕДЕЛЕНО КАК Партнер,
	|	СУММА(-ВЫБОР КОГДА ЗаявкаРасшифровкаПлатежа.Сумма - ЕСТЬNULL(ВыплатыПоКредитамДепозитам.СуммаОплаты, 0) < 0
	|			ТОГДА 0
	|			ИНАЧЕ ЗаявкаРасшифровкаПлатежа.Сумма - ЕСТЬNULL(ВыплатыПоКредитамДепозитам.СуммаОплаты, 0)
	|		КОНЕЦ) КАК Сумма,
	|	Заявка.СуммаДокумента КАК СуммаПлатежа,
	|	СУММА(ВЫБОР КОГДА ЗаявкаРасшифровкаПлатежа.Сумма - ЕСТЬNULL(ВыплатыПоКредитамДепозитам.СуммаОплаты, 0) < 0
	|			ТОГДА 0
	|			ИНАЧЕ ЗаявкаРасшифровкаПлатежа.Сумма - ЕСТЬNULL(ВыплатыПоКредитамДепозитам.СуммаОплаты, 0)
	|		КОНЕЦ) КАК ОсталосьОплатить
	|ИЗ
	|	Документ.ЗаявкаНаРасходованиеДенежныхСредств.РасшифровкаПлатежа КАК ЗаявкаРасшифровкаПлатежа
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ДенежныеСредстваКВыплате.Остатки(&ГраницаДатаОкончания, ) КАК ДенежныеСредстваКВыплатеОстатки
	|			ПО ЗаявкаРасшифровкаПлатежа.Ссылка = ДенежныеСредстваКВыплатеОстатки.ЗаявкаНаРасходованиеДенежныхСредств
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаявкаНаРасходованиеДенежныхСредств КАК Заявка
	|			ПО ЗаявкаРасшифровкаПлатежа.Ссылка = Заявка.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВыплатыПоКредитамДепозитам КАК ВыплатыПоКредитамДепозитам
	|			ПО ЗаявкаРасшифровкаПлатежа.ДоговорКредитаДепозита = ВыплатыПоКредитамДепозитам.Договор
	|			И ЗаявкаРасшифровкаПлатежа.СтатьяДвиженияДенежныхСредств = ВыплатыПоКредитамДепозитам.СтатьяДДС
	|			И ЗаявкаРасшифровкаПлатежа.Ссылка = ВыплатыПоКредитамДепозитам.ЗаявкаНаРасход
	|ГДЕ
	|	Заявка.Проведен
	|	И Заявка.ХозяйственнаяОперация В (
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОплатаПоКредитам),
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПеречислениеНаДепозиты),
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыдачаЗаймов))
	|	И (Заявка.Организация = &Организация ИЛИ &Организация = НЕОПРЕДЕЛЕНО)
	|	И (Заявка.Валюта = &Валюта ИЛИ &Валюта = НЕОПРЕДЕЛЕНО)
	|	И ВЫБОР КОГДА Заявка.ДатаПлатежа = ДАТАВРЕМЯ(1, 1, 1)
	|		ТОГДА Заявка.ЖелательнаяДатаПлатежа
	|		ИНАЧЕ Заявка.ДатаПлатежа
	|	КОНЕЦ >= &ДатаНачала
	|	И &ИспользоватьДоговорыКредитовИДепозитов
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаявкаРасшифровкаПлатежа.СтатьяДвиженияДенежныхСредств,
	|	Заявка.Ссылка,
	|	ЗаявкаРасшифровкаПлатежа.ДоговорКредитаДепозита,
	|	Заявка.СуммаДокумента,
	|	Заявка.Дата,
	|	Заявка.Валюта,
	|	Заявка.Организация,
	|	Заявка.Подразделение,
	|	ВЫБОР КОГДА Заявка.ДатаПлатежа = ДАТАВРЕМЯ(1, 1, 1)
	|		ТОГДА НАЧАЛОПЕРИОДА(Заявка.ЖелательнаяДатаПлатежа, ДЕНЬ)
	|		ИНАЧЕ НАЧАЛОПЕРИОДА(Заявка.ДатаПлатежа, ДЕНЬ)
	|	КОНЕЦ,
	|	ВЫБОР КОГДА Заявка.ДатаПлатежа = ДАТАВРЕМЯ(1, 1, 1)
	|		ТОГДА Заявка.ЖелательнаяДатаПлатежа
	|		ИНАЧЕ Заявка.ДатаПлатежа
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА Заявка.ФормаОплатыЗаявки = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Наличная)
	|			ТОГДА Заявка.Касса
	|		КОГДА Заявка.ФормаОплатыЗаявки = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Безналичная)
	|			ТОГДА Заявка.БанковскийСчет
	|		ИНАЧЕ
	|			НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА Заявка.ФормаОплатыЗаявки = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Наличная)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.Наличные)
	|		КОГДА Заявка.ФормаОплатыЗаявки = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Безналичная)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.Безналичные)
	|		ИНАЧЕ
	|			НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА Заявка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаРасходованиеДенежныхСредств.КОплате)
	|			ТОГДА 3
	|		КОГДА Заявка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаРасходованиеДенежныхСредств.Согласована)
	|			ТОГДА 6
	|		ИНАЧЕ 8
	|	КОНЕЦ,
	|	&СтрокаЗаявкаНомер + Заявка.Номер,
	|	Заявка.Валюта
	|
	|ИМЕЮЩИЕ
	|	СУММА(ЗаявкаРасшифровкаПлатежа.Сумма - ЕСТЬNULL(ВыплатыПоКредитамДепозитам.СуммаОплаты, 0)) > 0";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаПоРасчетамСКлиентами()

	ТекстЗапроса =
	";" +
	"
	|/////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Расчеты.Период КАК День,
	|	Расчеты.Период КАК ДатаПлатежа,
	|	ВЫБОР
	|		КОГДА &ВыводитьЗаказы
	|			ТОГДА Расчеты.ЗаказКлиента
	|		КОГДА &ВыводитьПартнеров
	|			ТОГДА РегистрАналитикаУчетаПоПартнерам.Партнер
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ПоступлениеОплатыОтКлиента)
	|	КОНЕЦ КАК Документ,
	|	Расчеты.Период КАК ДатаДокумента,
	|	
	|	ВЫБОР КОГДА Расчеты.ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Наличная)
	|		И Расчеты.Касса <> ЗНАЧЕНИЕ(Справочник.Кассы.ПустаяСсылка)
	|	ТОГДА
	|		Расчеты.Касса.ВалютаДенежныхСредств
	|	КОГДА Расчеты.ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Безналичная) ТОГДА
	|		ВЫБОР КОГДА Не Расчеты.БанковскийСчет ЕСТЬ NULL 
	|			И Расчеты.БанковскийСчет <> ЗНАЧЕНИЕ(Справочник.БанковскиеСчетаОрганизаций.ПустаяСсылка)
	|		ТОГДА
	|			Расчеты.БанковскийСчет.ВалютаДенежныхСредств
	|
	|		КОГДА Не Расчеты.БанковскийСчетОрганизации ЕСТЬ NULL 
	|			И Расчеты.БанковскийСчетОрганизации <> ЗНАЧЕНИЕ(Справочник.БанковскиеСчетаОрганизаций.ПустаяСсылка)
	|		ТОГДА
	|			Расчеты.БанковскийСчетОрганизации.ВалютаДенежныхСредств
	|
	|		ИНАЧЕ
	|			Расчеты.Валюта
	|		КОНЕЦ
	|	ИНАЧЕ
	|		Расчеты.Валюта
	|	КОНЕЦ КАК Валюта,
	|	
	|	Расчеты.Валюта КАК ВалютаПлатежа,
	|	РегистрАналитикаУчетаПоПартнерам.Организация КАК Организация,
	|	Неопределено КАК Подразделение,
	|	
	|	ВЫБОР КОГДА &ВыводитьЗаказы ИЛИ &ВыводитьПартнеров ТОГДА
	|		РегистрАналитикаУчетаПоПартнерам.Партнер
	|	ИНАЧЕ
	|		Неопределено
	|	КОНЕЦ КАК Получатель,
	|
	|	ВЫБОР КОГДА Расчеты.ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Наличная) ТОГДА
	|		Расчеты.Касса
	|	КОГДА Расчеты.ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Безналичная) ТОГДА
	|		ВЫБОР КОГДА Не Расчеты.БанковскийСчет ЕСТЬ NULL 
	|			И Расчеты.БанковскийСчет <> ЗНАЧЕНИЕ(Справочник.БанковскиеСчетаОрганизаций.ПустаяСсылка)
	|		ТОГДА
	|			Расчеты.БанковскийСчет
	|
	|		КОГДА Не Расчеты.БанковскийСчетОрганизации ЕСТЬ NULL 
	|			И Расчеты.БанковскийСчетОрганизации <> ЗНАЧЕНИЕ(Справочник.БанковскиеСчетаОрганизаций.ПустаяСсылка)
	|		ТОГДА
	|			Расчеты.БанковскийСчетОрганизации
	|
	|		ИНАЧЕ
	|			Неопределено
	|		КОНЕЦ
	|	ИНАЧЕ
	|		Неопределено
	|	КОНЕЦ КАК БанковскийСчетКасса,
	|	
	|	ВЫБОР КОГДА Расчеты.ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Наличная) ТОГДА
	|		ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.Наличные)
	|	КОГДА Расчеты.ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Безналичная) ТОГДА
	|		ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.Безналичные)
	|	ИНАЧЕ
	|		Неопределено
	|	КОНЕЦ КАК ТипДенежныхСредств,
	|	
	|	3 КАК СтатусПлатежа, // Запланированный платеж
	|	9 КАК ПорядокПлатежа,
	|	ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ПоступлениеОплатыОтКлиента) КАК СтатьяДвиженияДенежныхСредств,
	|	Представление(Расчеты.ЗаказКлиента) КАК Платеж,
	|	Неопределено КАК Приоритет,
	|	Расчеты.ЗаказКлиента КАК Заказ,
	|	РегистрАналитикаУчетаПоПартнерам.Партнер КАК Партнер,
	|
	|	ВЫБОР КОГДА Расчеты.КОплатеПриход + Расчеты.КОплатеПриходИтог - Расчеты.КОплатеРасход > 0
	|	ТОГДА
	|		ВЫБОР КОГДА Расчеты.КОплатеПриход + Расчеты.КОплатеПриходИтог - Расчеты.КОплатеРасход < Расчеты.КОплатеПриход
	|		ТОГДА
	|			Расчеты.КОплатеПриход + Расчеты.КОплатеПриходИтог - Расчеты.КОплатеРасход
	|		ИНАЧЕ
	|			Расчеты.КОплатеПриход
	|		КОНЕЦ
	|	ИНАЧЕ
	|		0
	|	КОНЕЦ КАК Сумма,
	|	
	|	Расчеты.ЗаказКлиента.СуммаДокумента КАК СуммаПлатежа,
	|	ОстаткиРасчетов.КОплатеОстаток КАК ОсталосьОплатить
	|
	|	ПОМЕСТИТЬ РасчетыГрафикПлатежей
	|
	|ИЗ
	|	РасчетыСКлиентами КАК Расчеты
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		РегистрСведений.АналитикаУчетаПоПартнерам КАК РегистрАналитикаУчетаПоПартнерам
	|	ПО
	|		Расчеты.АналитикаУчетаПоПартнерам = РегистрАналитикаУчетаПоПартнерам.КлючАналитики
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		РегистрНакопления.РасчетыСКлиентами.Остатки() КАК ОстаткиРасчетов
	|	ПО
	|		Расчеты.ЗаказКлиента = ОстаткиРасчетов.ЗаказКлиента
	|		И Расчеты.АналитикаУчетаПоПартнерам = ОстаткиРасчетов.АналитикаУчетаПоПартнерам	
	|	
	|ГДЕ
	|	Расчеты.КОплатеПриход + Расчеты.КОплатеПриходИтог - Расчеты.КОплатеРасход > 0
	|
	|";
	
	ТекстЗапроса = ТекстЗапроса + "ОБЪЕДИНИТЬ ВСЕ" + "
	|ВЫБРАТЬ
	|	Расчеты.Период КАК День,
	|	Расчеты.Период КАК ДатаПлатежа,
	|	ВЫБОР
	|		КОГДА &ВыводитьЗаказы
	|			ТОГДА Расчеты.ЗаказКлиента
	|		КОГДА &ВыводитьПартнеров
	|			ТОГДА РегистрАналитикаУчетаПоПартнерам.Партнер
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ВозвратОплатыКлиенту)
	|	КОНЕЦ КАК Документ,
	|	Расчеты.Период КАК ДатаДокумента,
	|	Расчеты.Валюта КАК Валюта,
	|	Расчеты.Валюта КАК ВалютаПлатежа,
	|	РегистрАналитикаУчетаПоПартнерам.Организация КАК Организация,
	|	Неопределено КАК Подразделение,
	|	
	|	ВЫБОР КОГДА &ВыводитьЗаказы ИЛИ &ВыводитьПартнеров ТОГДА
	|		РегистрАналитикаУчетаПоПартнерам.Партнер
	|	ИНАЧЕ
	|		Неопределено
	|	КОНЕЦ КАК Получатель,
	|
	|	Неопределено КАК БанковскийСчетКасса,
	|	Неопределено КАК ТипДенежныхСредств,
	|	
	|	3 КАК СтатусПлатежа,
	|	9 КАК ПорядокПлатежа,
	|	ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ВозвратОплатыКлиенту) КАК СтатьяДвиженияДенежныхСредств,
	|	Представление(Расчеты.ЗаказКлиента) КАК Платеж,
	|	Неопределено КАК Приоритет,
	|	Расчеты.ЗаказКлиента КАК Заказ,
	|	РегистрАналитикаУчетаПоПартнерам.Партнер КАК Партнер,
	|
	|	ВЫБОР КОГДА Расчеты.КОплатеРасход + Расчеты.КОплатеРасходИтог - Расчеты.КОплатеПриход > 0
	|	ТОГДА
	|		ВЫБОР КОГДА Расчеты.КОплатеРасход + Расчеты.КОплатеРасходИтог - Расчеты.КОплатеПриход < Расчеты.КОплатеРасход
	|		ТОГДА
	|			-(Расчеты.КОплатеРасход + Расчеты.КОплатеРасходИтог - Расчеты.КОплатеПриход)
	|		ИНАЧЕ
	|			-Расчеты.КОплатеРасход
	|		КОНЕЦ
	|	ИНАЧЕ
	|		0
	|	КОНЕЦ КАК Сумма,
	|	
	|	Расчеты.ЗаказКлиента.СуммаДокумента КАК СуммаПлатежа,
	|	ОстаткиРасчетов.КОплатеОстаток КАК ОсталосьОплатить
	|ИЗ
	|	ВтВозвратыКлиентам КАК Расчеты
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		РегистрСведений.АналитикаУчетаПоПартнерам КАК РегистрАналитикаУчетаПоПартнерам
	|	ПО
	|		Расчеты.АналитикаУчетаПоПартнерам = РегистрАналитикаУчетаПоПартнерам.КлючАналитики
	|	
	|	// Если нет остатков по расчетам с клиентами, значит и нет необходимости в оплате
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		РегистрНакопления.РасчетыСКлиентами.Остатки() КАК ОстаткиРасчетов
	|	ПО
	|		Расчеты.ЗаказКлиента = ОстаткиРасчетов.ЗаказКлиента
	|		И Расчеты.АналитикаУчетаПоПартнерам = ОстаткиРасчетов.АналитикаУчетаПоПартнерам
	|ГДЕ
	|	Расчеты.КОплатеРасход + Расчеты.КОплатеРасходИтог - Расчеты.КОплатеПриход > 0
	|	И ОстаткиРасчетов.КОплатеОстаток < 0
	|
	|";
	
	Возврат ТекстЗапроса
	
КонецФункции

Функция ТекстЗапросаПоСчетамНаОплату()

	ТекстЗапроса = "ОБЪЕДИНИТЬ ВСЕ" +
	"
	|ВЫБРАТЬ
	|	ГрафикОплаты.ДатаПлатежа КАК День,
	|	ГрафикОплаты.ДатаПлатежа КАК ДатаПлатежа,
	|	ВЫБОР
	|		КОГДА &ВыводитьЗаказы
	|			ТОГДА ДанныеДокумента.Ссылка
	|		КОГДА &ВыводитьПартнеров
	|			ТОГДА ДанныеДокумента.Партнер
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ПоступлениеОплатыОтКлиента)
	|	КОНЕЦ КАК Документ,
	|	ДанныеДокумента.Дата КАК ДатаДокумента,
	|	
	|	ВЫБОР КОГДА ДанныеДокумента.ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Наличная)
	|		И ДанныеДокумента.Касса <> ЗНАЧЕНИЕ(Справочник.Кассы.ПустаяСсылка)
	|	ТОГДА
	|		ДанныеДокумента.Касса.ВалютаДенежныхСредств
	|	КОГДА ДанныеДокумента.ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Безналичная)
	|		И ДанныеДокумента.БанковскийСчет <> ЗНАЧЕНИЕ(Справочник.БанковскиеСчетаОрганизаций.ПустаяСсылка)
	|	ТОГДА
	|		ДанныеДокумента.БанковскийСчет.ВалютаДенежныхСредств
	|	ИНАЧЕ
	|		ДанныеДокумента.Валюта
	|	КОНЕЦ КАК Валюта,
	|	
	|	ДанныеДокумента.Валюта КАК ВалютаПлатежа,
	|	ДанныеДокумента.Организация КАК Организация,
	|	Неопределено КАК Подразделение,
	|	
	|	ВЫБОР КОГДА &ВыводитьЗаказы ИЛИ &ВыводитьПартнеров ТОГДА
	|		ДанныеДокумента.Партнер
	|	ИНАЧЕ
	|		Неопределено
	|	КОНЕЦ КАК Получатель,
	|
	|	ВЫБОР КОГДА ДанныеДокумента.ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Наличная) ТОГДА
	|		ДанныеДокумента.Касса
	|	КОГДА ДанныеДокумента.ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Безналичная) ТОГДА
	|		ДанныеДокумента.БанковскийСчет
	|	ИНАЧЕ
	|		Неопределено
	|	КОНЕЦ КАК БанковскийСчетКасса,
	|	
	|	ВЫБОР КОГДА ДанныеДокумента.ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Наличная) ТОГДА
	|		ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.Наличные)
	|	КОГДА ДанныеДокумента.ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Безналичная) ТОГДА
	|		ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.Безналичные)
	|	ИНАЧЕ
	|		Неопределено
	|	КОНЕЦ КАК ТипДенежныхСредств,
	|	
	|	3 КАК СтатусПлатежа, // Запланированный платеж
	|	9 КАК ПорядокПлатежа,
	|	ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ПоступлениеОплатыОтКлиента) КАК СтатьяДвиженияДенежныхСредств,
	|	&СтрокаЗаказКлиента КАК Платеж,
	|	Неопределено КАК Приоритет,
	|	ДанныеДокумента.Ссылка КАК Заказ,
	|	ДанныеДокумента.Партнер КАК Партнер,
	|
	|	ДанныеДокумента.СуммаДокумента - ЕСТЬNULL(РасчетыСКлиентами.СуммаОплаты, 0) КАК Сумма,
	|	ДанныеДокумента.СуммаДокумента КАК СуммаПлатежа,
	|	0 КАК ОсталосьОплатить
	|ИЗ
	|	Документ.СчетНаОплатуКлиенту КАК ДанныеДокумента
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.СчетНаОплатуКлиенту.ЭтапыГрафикаОплаты КАК ГрафикОплаты
	|	ПО
	|		ДанныеДокумента.Ссылка = ГрафикОплаты.Ссылка
	|	ЛЕВОЕ СОЕДИНЕНИЕ (
	|		ВЫБРАТЬ
	|			РасчетыСКлиентами.СчетНаОплату КАК СчетНаОплату,
	|			СУММА(
	|				ВЫБОР КОГДА РасчетыСКлиентами.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) ТОГДА 
	|					РасчетыСКлиентами.Сумма
	|				ИНАЧЕ 
	|					0
	|				КОНЕЦ
	|			) КАК СуммаОплаты
	|		ИЗ
	|			РегистрНакопления.РасчетыСКлиентами КАК РасчетыСКлиентами
	|		ГДЕ
	|			РасчетыСКлиентами.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
	|			И РасчетыСКлиентами.СчетНаОплату <> ЗНАЧЕНИЕ(Документ.СчетНаОплатуКлиенту.ПустаяСсылка)
	|			И РасчетыСКлиентами.СчетНаОплату.ДокументОснование ССЫЛКА Справочник.ДоговорыКонтрагентов
	|	
	|		СГРУППИРОВАТЬ ПО
	|			РасчетыСКлиентами.СчетНаОплату
	|		) КАК РасчетыСКлиентами
	|	ПО 
	|		ДанныеДокумента.Ссылка = РасчетыСКлиентами.СчетНаОплату
    |
	|ГДЕ
	|	ДанныеДокумента.ДокументОснование ССЫЛКА Справочник.ДоговорыКонтрагентов
	|	И ГрафикОплаты.ДатаПлатежа МЕЖДУ &РабочаяДата И &ДатаОкончания
	|	И (ДанныеДокумента.Организация = &Организация
	|		ИЛИ &Организация = Неопределено)
	|	И ДанныеДокумента.Проведен
	|	И Не ДанныеДокумента.Аннулирован
	|	И (ДанныеДокумента.СуммаДокумента - ЕСТЬNULL(РасчетыСКлиентами.СуммаОплаты, 0)) > 0
	|";
	
	Возврат ТекстЗапроса
	
КонецФункции

Функция ТекстЗапросаПоРасчетамСПоставщиками()

	ТекстЗапроса = "ОБЪЕДИНИТЬ ВСЕ" + "
	|ВЫБРАТЬ
	|	Расчеты.Период КАК День,
	|	Расчеты.Период КАК ДатаПлатежа,
	|	ВЫБОР
	|		КОГДА &ВыводитьЗаказы
	|			ТОГДА Расчеты.ЗаказПоставщику
	|		КОГДА &ВыводитьПартнеров
	|			ТОГДА РегистрАналитикаУчетаПоПартнерам.Партнер
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ОплатаПоставщику)
	|	КОНЕЦ КАК Документ,
	|	Расчеты.Период КАК ДатаДокумента,
	|	
	|	ВЫБОР КОГДА Расчеты.ЗаказПоставщику.ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Наличная)
	|		И Расчеты.ЗаказПоставщику.Касса <> ЗНАЧЕНИЕ(Справочник.Кассы.ПустаяСсылка)
	|	ТОГДА
	|		Расчеты.ЗаказПоставщику.Касса.ВалютаДенежныхСредств
	|	КОГДА Расчеты.ЗаказПоставщику.ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Безналичная) ТОГДА
	|		ВЫБОР КОГДА Не Расчеты.ЗаказПоставщику.БанковскийСчет ЕСТЬ NULL
	|			И Расчеты.ЗаказПоставщику.БанковскийСчет <> ЗНАЧЕНИЕ(Справочник.БанковскиеСчетаОрганизаций.ПустаяСсылка)
	|		ТОГДА
	|			Расчеты.ЗаказПоставщику.БанковскийСчет.ВалютаДенежныхСредств
	|
	|		КОГДА Не Расчеты.ЗаказПоставщику.БанковскийСчетОрганизации ЕСТЬ NULL 
	|			И Расчеты.ЗаказПоставщику.БанковскийСчетОрганизации <> ЗНАЧЕНИЕ(Справочник.БанковскиеСчетаОрганизаций.ПустаяСсылка)
	|		ТОГДА
	|			Расчеты.ЗаказПоставщику.БанковскийСчетОрганизации.ВалютаДенежныхСредств
	|
	|		ИНАЧЕ
	|			Расчеты.Валюта
	|		КОНЕЦ
	|	ИНАЧЕ
	|		Расчеты.Валюта
	|	КОНЕЦ КАК Валюта,
	|	
	|	Расчеты.Валюта КАК ВалютаПлатежа,
	|	РегистрАналитикаУчетаПоПартнерам.Организация КАК Организация,
	|	Расчеты.ЗаказПоставщику.Подразделение КАК Подразделение,
	|	
	|	ВЫБОР КОГДА &ВыводитьЗаказы ИЛИ &ВыводитьПартнеров ТОГДА
	|		РегистрАналитикаУчетаПоПартнерам.Партнер
	|	ИНАЧЕ
	|		Неопределено
	|	КОНЕЦ КАК Получатель,
	|
	|	ВЫБОР КОГДА Расчеты.ЗаказПоставщику.ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Наличная) ТОГДА
	|		Расчеты.ЗаказПоставщику.Касса
	|	КОГДА Расчеты.ЗаказПоставщику.ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Безналичная) ТОГДА
	|		ВЫБОР КОГДА Не Расчеты.ЗаказПоставщику.БанковскийСчет ЕСТЬ NULL
	|			И Расчеты.ЗаказПоставщику.БанковскийСчет <> ЗНАЧЕНИЕ(Справочник.БанковскиеСчетаОрганизаций.ПустаяСсылка)
	|		ТОГДА
	|			Расчеты.ЗаказПоставщику.БанковскийСчет
	|
	|		КОГДА Не Расчеты.ЗаказПоставщику.БанковскийСчетОрганизации ЕСТЬ NULL 
	|			И Расчеты.ЗаказПоставщику.БанковскийСчетОрганизации <> ЗНАЧЕНИЕ(Справочник.БанковскиеСчетаОрганизаций.ПустаяСсылка)
	|		ТОГДА
	|			Расчеты.ЗаказПоставщику.БанковскийСчетОрганизации
	|
	|		ИНАЧЕ
	|			Неопределено
	|		КОНЕЦ
	|	ИНАЧЕ
	|		Неопределено
	|	КОНЕЦ КАК БанковскийСчетКасса,
	|	
	|	ВЫБОР КОГДА Расчеты.ЗаказПоставщику.ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Наличная) ТОГДА
	|		ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.Наличные)
	|	КОГДА Расчеты.ЗаказПоставщику.ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Безналичная) ТОГДА
	|		ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.Безналичные)
	|	ИНАЧЕ
	|		Неопределено
	|	КОНЕЦ КАК ТипДенежныхСредств,
	|	
	|	3 КАК СтатусПлатежа,
	|	9 КАК ПорядокПлатежа,
	|
	|	ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ОплатаПоставщику) КАК СтатьяДвиженияДенежныхСредств,
	|	Представление(Расчеты.ЗаказПоставщику) КАК Платеж,
	|	Неопределено КАК Приоритет,
	|	Расчеты.ЗаказПоставщику КАК Заказ,
	|	РегистрАналитикаУчетаПоПартнерам.Партнер КАК Партнер,
	|	
	|	ВЫБОР КОГДА Расчеты.КОплатеРасход + Расчеты.КОплатеРасходИтог - Расчеты.КОплатеПриход > 0
	|	ТОГДА
	|		ВЫБОР КОГДА Расчеты.КОплатеРасход + Расчеты.КОплатеРасходИтог - Расчеты.КОплатеПриход < Расчеты.КОплатеРасход
	|		ТОГДА
	|			-(Расчеты.КОплатеРасход + Расчеты.КОплатеРасходИтог - Расчеты.КОплатеПриход)
	|		ИНАЧЕ
	|			-Расчеты.КОплатеРасход
	|		КОНЕЦ
	|	ИНАЧЕ
	|		0
	|	КОНЕЦ КАК Сумма,
	|	
	|	Расчеты.ЗаказПоставщику.СуммаДокумента КАК СуммаПлатежа,
	|	-ОстаткиРасчетовСПоставщиками.КОплатеОстаток КАК ОсталосьОплатить
	|
	|ИЗ
	|	РасчетыСПоставщиками КАК Расчеты
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		РегистрСведений.АналитикаУчетаПоПартнерам КАК РегистрАналитикаУчетаПоПартнерам
	|	ПО
	|		Расчеты.АналитикаУчетаПоПартнерам = РегистрАналитикаУчетаПоПартнерам.КлючАналитики
	|
	|	// Если нет остатков по расчетам с поставщиками, значит и нет необходимости в оплате
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		РегистрНакопления.РасчетыСПоставщиками.Остатки() КАК ОстаткиРасчетовСПоставщиками
	|	ПО
	|		Расчеты.ЗаказПоставщику = ОстаткиРасчетовСПоставщиками.ЗаказПоставщику
	|		И Расчеты.АналитикаУчетаПоПартнерам = ОстаткиРасчетовСПоставщиками.АналитикаУчетаПоПартнерам
	|	
	|ГДЕ
	|	Расчеты.КОплатеРасход + Расчеты.КОплатеРасходИтог - Расчеты.КОплатеПриход > 0
	|	И ОстаткиРасчетовСПоставщиками.КОплатеОстаток < 0
	|";
	
	ТекстЗапроса = ТекстЗапроса + "ОБЪЕДИНИТЬ ВСЕ" + "
	|ВЫБРАТЬ
	|	Расчеты.Период КАК День,
	|	Расчеты.Период КАК ДатаПлатежа,
	|	ВЫБОР
	|		КОГДА &ВыводитьЗаказы
	|			ТОГДА Расчеты.ЗаказПоставщику
	|		КОГДА &ВыводитьПартнеров
	|			ТОГДА РегистрАналитикаУчетаПоПартнерам.Партнер
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ВозвратДенежныхСредствОтПоставщика)
	|	КОНЕЦ КАК Документ,
	|	Расчеты.Период КАК ДатаДокумента,
	|	
	|	ВЫБОР КОГДА Не Расчеты.ЗаказПоставщику.БанковскийСчетОрганизации ЕСТЬ NULL 
	|		И Расчеты.ЗаказПоставщику.БанковскийСчетОрганизации <> ЗНАЧЕНИЕ(Справочник.БанковскиеСчетаОрганизаций.ПустаяСсылка)
	|	ТОГДА
	|		Расчеты.ЗаказПоставщику.БанковскийСчетОрганизации.ВалютаДенежныхСредств
	|	ИНАЧЕ
	|		Расчеты.Валюта
	|	КОНЕЦ КАК Валюта,
	|	
	|	Расчеты.Валюта КАК ВалютаПлатежа,
	|	РегистрАналитикаУчетаПоПартнерам.Организация КАК Организация,
	|	Расчеты.ЗаказПоставщику.Подразделение КАК Подразделение,
	|	
	|	ВЫБОР КОГДА &ВыводитьЗаказы ИЛИ &ВыводитьПартнеров ТОГДА
	|		РегистрАналитикаУчетаПоПартнерам.Партнер
	|	ИНАЧЕ
	|		Неопределено
	|	КОНЕЦ КАК Получатель,
	|
	|	ВЫБОР КОГДА Не Расчеты.ЗаказПоставщику.БанковскийСчетОрганизации ЕСТЬ NULL 
	|		И Расчеты.ЗаказПоставщику.БанковскийСчетОрганизации <> ЗНАЧЕНИЕ(Справочник.БанковскиеСчетаОрганизаций.ПустаяСсылка)
	|	ТОГДА
	|		Расчеты.ЗаказПоставщику.БанковскийСчетОрганизации
	|	ИНАЧЕ
	|		Неопределено
	|	КОНЕЦ КАК БанковскийСчетКасса,
	|	
	|	Неопределено КАК ТипДенежныхСредств,
	|	
	|	3 КАК СтатусПлатежа, // Запланированный платеж
	|	9 КАК ПорядокПлатежа,
	|
	|	ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ВозвратДенежныхСредствОтПоставщика) КАК СтатьяДвиженияДенежныхСредств,
	|	Представление(Расчеты.ЗаказПоставщику) КАК Платеж,
	|	Неопределено КАК Приоритет,
	|	Расчеты.ЗаказПоставщику КАК Заказ,
	|	РегистрАналитикаУчетаПоПартнерам.Партнер КАК Партнер,
	|	
	|	ВЫБОР КОГДА Расчеты.КОплатеПриход + Расчеты.КОплатеПриходИтог - Расчеты.КОплатеРасход > 0
	|	ТОГДА
	|		ВЫБОР КОГДА Расчеты.КОплатеПриход + Расчеты.КОплатеПриходИтог - Расчеты.КОплатеРасход < Расчеты.КОплатеПриход
	|		ТОГДА
	|			Расчеты.КОплатеПриход + Расчеты.КОплатеПриходИтог - Расчеты.КОплатеРасход
	|		ИНАЧЕ
	|			Расчеты.КОплатеПриход
	|		КОНЕЦ
	|	ИНАЧЕ
	|		0
	|	КОНЕЦ КАК Сумма,
	|	
	|	Расчеты.ЗаказПоставщику.СуммаДокумента КАК СуммаПлатежа,
	|	-Расчеты.КОплатеПриход КАК ОсталосьОплатить
	|ИЗ
	|	ВтВозвратыОтПоставщиков КАК Расчеты
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		РегистрСведений.АналитикаУчетаПоПартнерам КАК РегистрАналитикаУчетаПоПартнерам
	|	ПО
	|		Расчеты.АналитикаУчетаПоПартнерам = РегистрАналитикаУчетаПоПартнерам.КлючАналитики
	|ГДЕ
	|	Расчеты.КОплатеПриход + Расчеты.КОплатеПриходИтог - Расчеты.КОплатеРасход > 0
	|";
	
	Возврат ТекстЗапроса
	
КонецФункции

Функция ТекстЗапросаПоДенежнымСредствамВПути()

	ТекстЗапроса =
	";" +
	"
	|/////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	&РабочаяДата КАК День,
	|	&РабочаяДата КАК ДатаПлатежа,
	|
	|	&СтрокаКПоступлению КАК Документ,
	|	&РабочаяДата КАК ДатаДокумента,
	|	ДенежныеСредства.Валюта КАК Валюта,
	|	Неопределено КАК ВалютаПлатежа,
	|	ДенежныеСредства.Организация КАК Организация,
	|	Неопределено КАК Подразделение,
	|
	|	Неопределено КАК Получатель,
	|	ДенежныеСредства.Получатель КАК БанковскийСчетКасса,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.Безналичные) КАК ТипДенежныхСредств,
	|	1 КАК СтатусПлатежа,
	|	1 КАК ПорядокПлатежа,
 	|
	|	Неопределено КАК СтатьяДвиженияДенежныхСредств,
	|	&СтрокаКПоступлению КАК Платеж,
	|	Неопределено КАК Приоритет,
	|	Неопределено КАК Заказ,
	|	Неопределено КАК Партнер,
	|
	|	ДенежныеСредства.СуммаОстаток КАК Сумма,
	|	0 КАК СуммаПлатежа,
	|	0 КАК ОсталосьОплатить
	|	
	|	ПОМЕСТИТЬ ДенСредстваВПутиЭквайрингПрочиеПоступленияГрафикПлатежей
	|	
	|ИЗ
	|	РегистрНакопления.ДенежныеСредстваВПути.Остатки(&ГраницаДатаОстатков,
	|		(Организация = &Организация
	|			ИЛИ &Организация = Неопределено)
	|		И (Валюта = &Валюта
	|			ИЛИ &Валюта = Неопределено)
	|		И (ВидПереводаДенежныхСредств В (
	|			ЗНАЧЕНИЕ(Перечисление.ВидыПереводовДенежныхСредств.ИнкассацияВБанк),
	|			ЗНАЧЕНИЕ(Перечисление.ВидыПереводовДенежныхСредств.ПеречислениеНаДругойСчет)))
	|	) КАК ДенежныеСредства
	|
	|ГДЕ
	|	ДенежныеСредства.СуммаОстаток > 0
	|	
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&РабочаяДата КАК День,
	|	&РабочаяДата КАК ДатаПлатежа,
	|
	|	&СтрокаКПоступлению КАК Документ,
	|	&РабочаяДата КАК ДатаДокумента,
	|	ДенежныеСредства.Валюта КАК Валюта,
	|	Неопределено КАК ВалютаПлатежа,
	|	ДенежныеСредства.Организация КАК Организация,
	|	Неопределено КАК Подразделение,
	|
	|	Неопределено КАК Получатель,
	|	ДенежныеСредства.Получатель КАК БанковскийСчетКасса,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.Наличные) КАК ТипДенежныхСредств,
	|	1 КАК СтатусПлатежа,
	|	1 КАК ПорядокПлатежа,
	|
	|	Неопределено КАК СтатьяДвиженияДенежныхСредств,
	|	&СтрокаКПоступлению КАК Платеж,
	|	Неопределено КАК Приоритет,
	|	Неопределено КАК Заказ,
	|	Неопределено КАК Партнер,
	|
	|	ДенежныеСредства.СуммаОстаток КАК Сумма,
	|	0 КАК СуммаПлатежа,
	|	0 КАК ОсталосьОплатить
	|ИЗ
	|	РегистрНакопления.ДенежныеСредстваВПути.Остатки(&ГраницаДатаОстатков,
	|		(Организация = &Организация
	|			ИЛИ &Организация = Неопределено)
	|		И (Валюта = &Валюта
	|			ИЛИ &Валюта = Неопределено)
	|		И (ВидПереводаДенежныхСредств В (
	|			ЗНАЧЕНИЕ(Перечисление.ВидыПереводовДенежныхСредств.ИнкассацияИзБанка),
	|			ЗНАЧЕНИЕ(Перечисление.ВидыПереводовДенежныхСредств.ПеремещениеВДругуюКассу)))
	|	) КАК ДенежныеСредства
	|
	|ГДЕ
	|	ДенежныеСредства.СуммаОстаток > 0
	|	
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&РабочаяДата КАК День,
	|	&РабочаяДата КАК ДатаПлатежа,
	|
	|	&СтрокаКПоступлению КАК Документ,
	|	&РабочаяДата КАК ДатаДокумента,
	|	ДенежныеСредства.Валюта КАК Валюта,
	|	Неопределено КАК ВалютаПлатежа,
	|	ДенежныеСредства.Организация КАК Организация,
	|	Неопределено КАК Подразделение,
	|
	|	Неопределено КАК Получатель,
	|	ДенежныеСредства.Получатель КАК БанковскийСчетКасса,
	|	ВЫБОР КОГДА ТИПЗНАЧЕНИЯ(ДенежныеСредства.Получатель) = ТИП(Справочник.Кассы) ТОГДА
	|		ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.Наличные)
	|	ИНАЧЕ
	|		ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.Безналичные)
	|	КОНЕЦ КАК ТипДенежныхСредств,
	|	1 КАК СтатусПлатежа,
	|	1 КАК ПорядокПлатежа,
	|
	|	Неопределено КАК СтатьяДвиженияДенежныхСредств,
	|	&СтрокаКПоступлению КАК Платеж,
	|	Неопределено КАК Приоритет,
	|	Неопределено КАК Заказ,
	|	Неопределено КАК Партнер,
	|
	|	ДенежныеСредства.СуммаОстаток КАК Сумма,
	|	0 КАК СуммаПлатежа,
	|	0 КАК ОсталосьОплатить
	|ИЗ
	|	РегистрНакопления.ДенежныеСредстваВПути.Остатки(&ГраницаДатаОстатков,
	|		(Организация = &Организация
	|			ИЛИ &Организация = Неопределено)
	|		И (Валюта = &Валюта
	|			ИЛИ &Валюта = Неопределено)
	|		И (ВидПереводаДенежныхСредств В (
	|							ЗНАЧЕНИЕ(Перечисление.ВидыПереводовДенежныхСредств.ПриобретениеВалюты),
	|							ЗНАЧЕНИЕ(Перечисление.ВидыПереводовДенежныхСредств.РеализацияВалюты))
	|		)
	|	) КАК ДенежныеСредства
	|
	|ГДЕ
	|	ДенежныеСредства.СуммаОстаток > 0
	|	
	|ОБЪЕДИНИТЬ ВСЕ
	|	
	|ВЫБРАТЬ
	|	&РабочаяДата КАК День,
	|	&РабочаяДата КАК ДатаПлатежа,
	|
	|	&СтрокаКПоступлению КАК Документ,
	|	&РабочаяДата КАК ДатаДокумента,
	|	ДенежныеСредства.БанковскийСчет.ВалютаДенежныхСредств КАК Валюта,
	|	Неопределено КАК ВалютаПлатежа,
	|	ДенежныеСредства.Организация КАК Организация,
	|	Неопределено КАК Подразделение,
	|
	|	Неопределено КАК Получатель,
	|	ДенежныеСредства.БанковскийСчет КАК БанковскийСчетКасса,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.Безналичные) КАК ТипДенежныхСредств,
	|	1 КАК СтатусПлатежа,
	|	1 КАК ПорядокПлатежа,
	|
	|	Неопределено КАК СтатьяДвиженияДенежныхСредств,
	|	&СтрокаКПоступлению КАК Платеж,
	|	Неопределено КАК Приоритет,
	|	Неопределено КАК Заказ,
	|	Неопределено КАК Партнер,
	|
	|	ДенежныеСредства.КЗачислениюОстаток КАК Сумма,
	|	0 КАК СуммаПлатежа,
	|	0 КАК ОсталосьОплатить
	|ИЗ
	|	РегистрНакопления.ДенежныеСредстваБезналичные.Остатки(, 
	|		(Организация = &Организация
	|			ИЛИ &Организация = Неопределено)
	|		И (БанковскийСчет.ВалютаДенежныхСредств = &Валюта
	|			ИЛИ &Валюта = Неопределено)
	|	) КАК ДенежныеСредства
	|	
	|ОБЪЕДИНИТЬ ВСЕ
	|	
	|ВЫБРАТЬ
	|	&РабочаяДата КАК День,
	|	&РабочаяДата КАК ДатаПлатежа,
	|
	|	&СтрокаКСписанию КАК Документ,
	|	&РабочаяДата КАК ДатаДокумента,
	|	ДенежныеСредства.БанковскийСчет.ВалютаДенежныхСредств КАК Валюта,
	|	Неопределено КАК ВалютаПлатежа,
	|	ДенежныеСредства.Организация КАК Организация,
	|	Неопределено КАК Подразделение,
	|
	|	Неопределено КАК Получатель,
	|	ДенежныеСредства.БанковскийСчет КАК БанковскийСчетКасса,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.Безналичные) КАК ТипДенежныхСредств,
	|	1 КАК СтатусПлатежа,
	|	1 КАК ПорядокПлатежа,
	|
	|	Неопределено КАК СтатьяДвиженияДенежныхСредств,
	|	&СтрокаКСписанию КАК Платеж,
	|	Неопределено КАК Приоритет,
	|	Неопределено КАК Заказ,
	|	Неопределено КАК Партнер,
	|
	|	-ДенежныеСредства.КСписаниюОстаток КАК Сумма,
	|	0 КАК СуммаПлатежа,
	|	0 КАК ОсталосьОплатить
	|ИЗ
	|	РегистрНакопления.ДенежныеСредстваБезналичные.Остатки(, 
	|		(Организация = &Организация
	|			ИЛИ &Организация = Неопределено)
	|		И (БанковскийСчет.ВалютаДенежныхСредств = &Валюта
	|			ИЛИ &Валюта = Неопределено)
	|	) КАК ДенежныеСредства
	|";
	
	Возврат ТекстЗапроса
	
КонецФункции

Функция ТекстЗапросаРасчетыПоЭквайрингу()

	ТекстЗапроса = "ОБЪЕДИНИТЬ ВСЕ" +
	"
	|ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(РасчетыПоЭквайрингу.ДатаПлатежа, ДЕНЬ) КАК День,
	|	РасчетыПоЭквайрингу.ДатаПлатежа КАК ДатаПлатежа,
	|
	|	ВЫБОР
	|		КОГДА &ВыводитьЗаказы
	|			ТОГДА РасчетыПоЭквайрингу.ЭквайринговыйТерминал.Эквайер
	|		ИНАЧЕ &СтрокаКПоступлению
	|	КОНЕЦ КАК Документ,
	|	&РабочаяДата КАК ДатаДокумента,
	|	РасчетыПоЭквайрингу.Валюта КАК Валюта,
	|	Неопределено КАК ВалютаПлатежа,
	|	РасчетыПоЭквайрингу.Организация КАК Организация,
	|	Неопределено КАК Подразделение,
	|
	|	Неопределено КАК Получатель,
	|	РасчетыПоЭквайрингу.ЭквайринговыйТерминал.БанковскийСчет КАК БанковскийСчетКасса,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.Безналичные) КАК ТипДенежныхСредств,
	|	3 КАК СтатусПлатежа, // Запланированный платеж
	|	1 КАК ПорядокПлатежа,
 	|
	|	Неопределено КАК СтатьяДвиженияДенежныхСредств,
	|	&СтрокаКПоступлению КАК Платеж,
	|	Неопределено КАК Приоритет,
	|	Неопределено КАК Заказ,
	|	Неопределено КАК Партнер,
	|
	|	РасчетыПоЭквайрингу.СуммаОстаток КАК Сумма,
	|	0 КАК СуммаПлатежа,
	|	0 КАК ОсталосьОплатить
	|ИЗ
	|	РегистрНакопления.РасчетыПоЭквайрингу.Остатки(&ГраницаДатаОстатков,
	|		(Организация = &Организация
	|			ИЛИ &Организация = Неопределено)
	|		И (Валюта = &Валюта
	|			ИЛИ &Валюта = Неопределено)
	|		И ТипДенежныхСредств = ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредствПоЭквайрингу.ПоступлениеПоПлатежнойКарте)
	|	) КАК РасчетыПоЭквайрингу
	|
	|ГДЕ
	|	РасчетыПоЭквайрингу.СуммаОстаток > 0
	|	И РасчетыПоЭквайрингу.ДатаПлатежа > &ДатаНачала
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&РабочаяДата КАК День,
	|	&РабочаяДата КАК ДатаПлатежа,
	|
	|	ВЫБОР
	|		КОГДА &ВыводитьЗаказы
	|			ТОГДА РасчетыПоЭквайрингу.ЭквайринговыйТерминал.Эквайер
	|		ИНАЧЕ &СтрокаКСписанию
	|	КОНЕЦ КАК Документ,
	|	&РабочаяДата КАК ДатаДокумента,
	|	РасчетыПоЭквайрингу.Валюта КАК Валюта,
	|	Неопределено КАК ВалютаПлатежа,
	|	РасчетыПоЭквайрингу.Организация КАК Организация,
	|	Неопределено КАК Подразделение,
	|
	|	Неопределено КАК Получатель,
	|	РасчетыПоЭквайрингу.ЭквайринговыйТерминал.БанковскийСчет КАК БанковскийСчетКасса,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.Безналичные) КАК ТипДенежныхСредств,
	|	1 КАК СтатусПлатежа, // Доступный остаток
	|	1 КАК ПорядокПлатежа,
	|
	|	Неопределено КАК СтатьяДвиженияДенежныхСредств,
	|	&СтрокаКСписанию КАК Платеж,
	|	Неопределено КАК Приоритет,
	|	Неопределено КАК Заказ,
	|	Неопределено КАК Партнер,
	|
	|	РасчетыПоЭквайрингу.СуммаОстаток КАК Сумма,
	|	0 КАК СуммаПлатежа,
	|	0 КАК ОсталосьОплатить
	|ИЗ
	|	РегистрНакопления.РасчетыПоЭквайрингу.Остатки(&ГраницаДатаОстатков,
	|		(Организация = &Организация
	|			ИЛИ &Организация = Неопределено)
	|		И (Валюта = &Валюта
	|			ИЛИ &Валюта = Неопределено)
	|		И ТипДенежныхСредств = ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредствПоЭквайрингу.СписаниеПоПлатежнойКарте)
	|	) КАК РасчетыПоЭквайрингу
	|
	|ГДЕ
	|	РасчетыПоЭквайрингу.СуммаОстаток < 0
	|";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаПоПрочимПоступлениямДенежныхСредств()

	ТекстЗапроса = "
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПланируемыеПоступления.День КАК День,
	|	ПланируемыеПоступления.Дата КАК ДатаПлатежа,
	|	ПланируемыеПоступления.Документ КАК Документ,
	|	ПланируемыеПоступления.Дата КАК ДатаДокумента,
	|	ПланируемыеПоступления.Валюта КАК Валюта,
	|	ПланируемыеПоступления.Валюта КАК ВалютаПлатежа,
	|	ПланируемыеПоступления.Организация КАК Организация,
	|	Неопределено КАК Подразделение,
	|	Неопределено КАК Получатель,
	|	ПланируемыеПоступления.БанковскийСчетКасса КАК БанковскийСчетКасса,
	|	
	|	ВЫБОР КОГДА ПланируемыеПоступления.ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Наличная) ТОГДА
	|		ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.Наличные)
	|	КОГДА ПланируемыеПоступления.ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Безналичная) ТОГДА
	|		ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.Безналичные)
	|	ИНАЧЕ
	|		Неопределено
	|	КОНЕЦ КАК ТипДенежныхСредств,
	|
	|	3 КАК СтатусПлатежа, // Запланированный платеж
	|	4 КАК ПорядокПлатежа,
	|	
	|	ПланируемыеПоступления.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
	|	&СтрокаПланируемоеПоступление КАК Платеж,
	|	Неопределено КАК Приоритет,
	|	Неопределено КАК Заказ,
	|	Неопределено КАК Партнер,
	|
	|	СУММА(ПланируемыеПоступления.СуммаИтог)
	|		- МАКСИМУМ(ЕСТЬNULL(ФактическиеПоступления.Сумма, 0)) КАК Сумма,
	|	МАКСИМУМ(ПланируемыеПоступления.СуммаДокумента) КАК СуммаПлатежа,
	|	СУММА(ПланируемыеПоступления.СуммаИтог)
	|		- МАКСИМУМ(ЕСТЬNULL(ФактическиеПоступления.Сумма, 0)) КАК ОсталосьОплатить
	|ИЗ
	|	ПланируемыеПоступления КАК ПланируемыеПоступления
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		ФактическиеПоступления КАК ФактическиеПоступления
	|	ПО
	|		ПланируемыеПоступления.Организация = ФактическиеПоступления.Организация
	|		И ПланируемыеПоступления.Валюта = ФактическиеПоступления.Валюта
	|		И ПланируемыеПоступления.СтатьяДвиженияДенежныхСредств = ФактическиеПоступления.СтатьяДвиженияДенежныхСредств
	|		И ПланируемыеПоступления.ФормаОплаты = ФактическиеПоступления.ФормаОплаты
	|		И (ПланируемыеПоступления.БанковскийСчетКасса = ФактическиеПоступления.БанковскийСчетКасса
	|			ИЛИ ПланируемыеПоступления.БанковскийСчетКасса = Неопределено)
	|		И ПланируемыеПоступления.День = ФактическиеПоступления.День
	|
	|СГРУППИРОВАТЬ ПО
	|	ПланируемыеПоступления.День,
	|	ПланируемыеПоступления.Дата,
	|	ПланируемыеПоступления.Документ,
	|	ПланируемыеПоступления.Валюта,
	|	ПланируемыеПоступления.Организация,
	|	ПланируемыеПоступления.СтатьяДвиженияДенежныхСредств,
	|	ПланируемыеПоступления.БанковскийСчетКасса,
	|	ВЫБОР КОГДА ПланируемыеПоступления.ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Наличная) ТОГДА
	|		ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.Наличные)
	|	КОГДА ПланируемыеПоступления.ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Безналичная) ТОГДА
	|		ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.Безналичные)
	|	ИНАЧЕ
	|		Неопределено
	|	КОНЕЦ
	|
	|ИМЕЮЩИЕ
	|	СУММА(ПланируемыеПоступления.СуммаИтог)
	|		- МАКСИМУМ(ЕСТЬNULL(ФактическиеПоступления.Сумма, 0)) > 0
	|";
	
	Возврат ТекстЗапроса
	
КонецФункции

Функция ТекстЗапросаПоКредитамДепозитам()
	
	ТекстЗапроса =
	";" +
	"
	|/////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ГрафикТраншейКредитовИДепозитов.Период КАК День,
	|	ГрафикТраншейКредитовИДепозитов.Период КАК ДатаПлатежа,
	|	ДоговорыКредитовИДепозитов.Ссылка КАК Документ,
	|	ДоговорыКредитовИДепозитов.Дата КАК ДатаДокумента,
	|	ВЫБОР
	|		КОГДА ДоговорыКредитовИДепозитов.ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Наличная)
	|				И ДоговорыКредитовИДепозитов.Касса <> ЗНАЧЕНИЕ(Справочник.Кассы.ПустаяСсылка)
	|			ТОГДА ДоговорыКредитовИДепозитов.Касса.ВалютаДенежныхСредств
	|		КОГДА ДоговорыКредитовИДепозитов.ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Безналичная)
	|				И ДоговорыКредитовИДепозитов.БанковскийСчет <> ЗНАЧЕНИЕ(Справочник.БанковскиеСчетаОрганизаций.ПустаяСсылка)
	|			ТОГДА ДоговорыКредитовИДепозитов.БанковскийСчет.ВалютаДенежныхСредств
	|		ИНАЧЕ ДоговорыКредитовИДепозитов.ВалютаВзаиморасчетов
	|	КОНЕЦ КАК Валюта,
	|	ДоговорыКредитовИДепозитов.ВалютаВзаиморасчетов КАК ВалютаПлатежа,
	|	ДоговорыКредитовИДепозитов.Организация КАК Организация,
	|	ДоговорыКредитовИДепозитов.Подразделение КАК Подразделение,
	|	ДоговорыКредитовИДепозитов.Контрагент КАК Получатель,
	|	ВЫБОР
	|		КОГДА ДоговорыКредитовИДепозитов.ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Наличная)
	|			ТОГДА ДоговорыКредитовИДепозитов.Касса
	|		КОГДА ДоговорыКредитовИДепозитов.ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Безналичная)
	|			ТОГДА ДоговорыКредитовИДепозитов.БанковскийСчет
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК БанковскийСчетКасса,
	|	ВЫБОР
	|		КОГДА ДоговорыКредитовИДепозитов.ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Наличная)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.Наличные)
	|		КОГДА ДоговорыКредитовИДепозитов.ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Безналичная)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.Безналичные)
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ТипДенежныхСредств,
	|	3 КАК СтатусПлатежа,
	|	4 КАК ПорядокПлатежа,
	|	ДоговорыКредитовИДепозитов.СтатьяДДСПоступленияВыдачи КАК СтатьяДвиженияДенежныхСредств,
	|	""Договор"" КАК Платеж,
	|	НЕОПРЕДЕЛЕНО КАК Приоритет,
	|	НЕОПРЕДЕЛЕНО КАК Заказ,
	|	ДоговорыКредитовИДепозитов.Партнер КАК Партнер,
	|	СУММА(ГрафикТраншейКредитовИДепозитов.Сумма * ВЫБОР
	|			КОГДА ДоговорыКредитовИДепозитов.ХарактерДоговора = ЗНАЧЕНИЕ(Перечисление.ХарактерДоговораКредитовИДепозитов.КредитИлиЗайм)
	|				ТОГДА 1
	|			ИНАЧЕ -1
	|		КОНЕЦ) КАК Сумма,
	|	СУММА(ГрафикТраншейКредитовИДепозитов.Сумма) КАК СуммаПлатежа,
	|	СУММА(ГрафикТраншейКредитовИДепозитов.Сумма) КАК ОсталосьОплатить
	|	
	|	ПОМЕСТИТЬ КредитыДепозитыГрафикПлатежей
	|	
	|ИЗ
	|	РегистрСведений.ГрафикТраншейКредитовИДепозитов КАК ГрафикТраншейКредитовИДепозитов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКредитовИДепозитов КАК ДоговорыКредитовИДепозитов
	|		ПО ГрафикТраншейКредитовИДепозитов.ВариантГрафика.Владелец = ДоговорыКредитовИДепозитов.Ссылка
	|ГДЕ
	|	ГрафикТраншейКредитовИДепозитов.Период МЕЖДУ &РабочаяДата И &ДатаОкончания
	|	И (ДоговорыКредитовИДепозитов.Организация = &Организация
	|			ИЛИ &Организация = НЕОПРЕДЕЛЕНО)
	|	И (ВЫБОР
	|				КОГДА ДоговорыКредитовИДепозитов.ВалютаВзаиморасчетов <> &ВалютаРегламентированногоУчета
	|						И ДоговорыКредитовИДепозитов.ПорядокОплаты = ЗНАЧЕНИЕ(Перечисление.ПорядокОплатыПоСоглашениям.РасчетыВВалютеОплатаВВалюте)
	|					ТОГДА ДоговорыКредитовИДепозитов.ВалютаВзаиморасчетов
	|				ИНАЧЕ &ВалютаРегламентированногоУчета
	|			КОНЕЦ = &Валюта
	|			ИЛИ &Валюта = НЕОПРЕДЕЛЕНО)
	|	И ДоговорыКредитовИДепозитов.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыДоговоровКонтрагентов.Действует)
	|	И ГрафикТраншейКредитовИДепозитов.ВариантГрафика.Используется
	|	И &ИспользоватьДоговорыКредитовИДепозитов
	|
	|СГРУППИРОВАТЬ ПО
	|	ГрафикТраншейКредитовИДепозитов.Период,
	|	ДоговорыКредитовИДепозитов.Организация,
	|	ДоговорыКредитовИДепозитов.Подразделение,
	|	ВЫБОР
	|		КОГДА ДоговорыКредитовИДепозитов.ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Наличная)
	|			ТОГДА ДоговорыКредитовИДепозитов.Касса
	|		КОГДА ДоговорыКредитовИДепозитов.ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Безналичная)
	|			ТОГДА ДоговорыКредитовИДепозитов.БанковскийСчет
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ДоговорыКредитовИДепозитов.ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Наличная)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.Наличные)
	|		КОГДА ДоговорыКредитовИДепозитов.ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Безналичная)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.Безналичные)
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ДоговорыКредитовИДепозитов.Партнер,
	|	ГрафикТраншейКредитовИДепозитов.Сумма,
	|	ДоговорыКредитовИДепозитов.СтатьяДДСПоступленияВыдачи,
	|	ВЫБОР
	|		КОГДА ДоговорыКредитовИДепозитов.ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Наличная)
	|				И ДоговорыКредитовИДепозитов.Касса <> ЗНАЧЕНИЕ(Справочник.Кассы.ПустаяСсылка)
	|			ТОГДА ДоговорыКредитовИДепозитов.Касса.ВалютаДенежныхСредств
	|		КОГДА ДоговорыКредитовИДепозитов.ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Безналичная)
	|				И ДоговорыКредитовИДепозитов.БанковскийСчет <> ЗНАЧЕНИЕ(Справочник.БанковскиеСчетаОрганизаций.ПустаяСсылка)
	|			ТОГДА ДоговорыКредитовИДепозитов.БанковскийСчет.ВалютаДенежныхСредств
	|		ИНАЧЕ ДоговорыКредитовИДепозитов.ВалютаВзаиморасчетов
	|	КОНЕЦ,
	|	ДоговорыКредитовИДепозитов.ВалютаВзаиморасчетов,
	|	ДоговорыКредитовИДепозитов.Контрагент,
	|	ДоговорыКредитовИДепозитов.Дата,
	|	ДоговорыКредитовИДепозитов.Ссылка,
	|	ГрафикТраншейКредитовИДепозитов.Период
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ГрафикОплатКредитовИДепозитов.Период,
	|	ГрафикОплатКредитовИДепозитов.Период,
	|	ДоговорыКредитовИДепозитов.Ссылка,
	|	ДоговорыКредитовИДепозитов.Дата,
	|	ВЫБОР
	|		КОГДА ДоговорыКредитовИДепозитов.ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Наличная)
	|				И ДоговорыКредитовИДепозитов.Касса <> ЗНАЧЕНИЕ(Справочник.Кассы.ПустаяСсылка)
	|			ТОГДА ДоговорыКредитовИДепозитов.Касса.ВалютаДенежныхСредств
	|		КОГДА ДоговорыКредитовИДепозитов.ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Безналичная)
	|				И ДоговорыКредитовИДепозитов.БанковскийСчет <> ЗНАЧЕНИЕ(Справочник.БанковскиеСчетаОрганизаций.ПустаяСсылка)
	|			ТОГДА ДоговорыКредитовИДепозитов.БанковскийСчет.ВалютаДенежныхСредств
	|		ИНАЧЕ ДоговорыКредитовИДепозитов.ВалютаВзаиморасчетов
	|	КОНЕЦ,
	|	ДоговорыКредитовИДепозитов.ВалютаВзаиморасчетов,
	|	ДоговорыКредитовИДепозитов.Организация,
	|	ДоговорыКредитовИДепозитов.Подразделение,
	|	ДоговорыКредитовИДепозитов.Контрагент,
	|	ВЫБОР
	|		КОГДА ДоговорыКредитовИДепозитов.ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Наличная)
	|			ТОГДА ДоговорыКредитовИДепозитов.Касса
	|		КОГДА ДоговорыКредитовИДепозитов.ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Безналичная)
	|			ТОГДА ДоговорыКредитовИДепозитов.БанковскийСчет
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ДоговорыКредитовИДепозитов.ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Наличная)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.Наличные)
	|		КОГДА ДоговорыКредитовИДепозитов.ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Безналичная)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.Безналичные)
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	3,
	|	4,
	|	ДоговорыКредитовИДепозитов.СтатьяДДСОсновногоДолга,
	|	ПРЕДСТАВЛЕНИЕ(ДоговорыКредитовИДепозитов.СтатьяДДСОсновногоДолга),
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	ДоговорыКредитовИДепозитов.Партнер,
	|	СУММА(ГрафикОплатКредитовИДепозитов.Сумма * ВЫБОР
	|			КОГДА ДоговорыКредитовИДепозитов.ХарактерДоговора = ЗНАЧЕНИЕ(Перечисление.ХарактерДоговораКредитовИДепозитов.КредитИлиЗайм)
	|				ТОГДА -1
	|			ИНАЧЕ 1
	|		КОНЕЦ),
	|	СУММА(ГрафикОплатКредитовИДепозитов.Сумма),
	|	СУММА(ГрафикОплатКредитовИДепозитов.Сумма)
	|ИЗ
	|	РегистрСведений.ГрафикОплатКредитовИДепозитов КАК ГрафикОплатКредитовИДепозитов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКредитовИДепозитов КАК ДоговорыКредитовИДепозитов
	|		ПО ГрафикОплатКредитовИДепозитов.ВариантГрафика.Владелец = ДоговорыКредитовИДепозитов.Ссылка
	|ГДЕ
	|	ГрафикОплатКредитовИДепозитов.Период МЕЖДУ &РабочаяДата И &ДатаОкончания
	|	И (ДоговорыКредитовИДепозитов.Организация = &Организация
	|			ИЛИ &Организация = НЕОПРЕДЕЛЕНО)
	|	И (ВЫБОР
	|				КОГДА ДоговорыКредитовИДепозитов.ВалютаВзаиморасчетов <> &ВалютаРегламентированногоУчета
	|						И ДоговорыКредитовИДепозитов.ПорядокОплаты = ЗНАЧЕНИЕ(Перечисление.ПорядокОплатыПоСоглашениям.РасчетыВВалютеОплатаВВалюте)
	|					ТОГДА ДоговорыКредитовИДепозитов.ВалютаВзаиморасчетов
	|				ИНАЧЕ &ВалютаРегламентированногоУчета
	|			КОНЕЦ = &Валюта
	|			ИЛИ &Валюта = НЕОПРЕДЕЛЕНО)
	|	И ДоговорыКредитовИДепозитов.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыДоговоровКонтрагентов.Действует)
	|	И ГрафикОплатКредитовИДепозитов.ВариантГрафика.Используется
	|	И ГрафикОплатКредитовИДепозитов.Сумма > 0
	|	И &ИспользоватьДоговорыКредитовИДепозитов
	|
	|СГРУППИРОВАТЬ ПО
	|	ГрафикОплатКредитовИДепозитов.Период,
	|	ДоговорыКредитовИДепозитов.Ссылка,
	|	ВЫБОР
	|		КОГДА ДоговорыКредитовИДепозитов.ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Наличная)
	|				И ДоговорыКредитовИДепозитов.Касса <> ЗНАЧЕНИЕ(Справочник.Кассы.ПустаяСсылка)
	|			ТОГДА ДоговорыКредитовИДепозитов.Касса.ВалютаДенежныхСредств
	|		КОГДА ДоговорыКредитовИДепозитов.ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Безналичная)
	|				И ДоговорыКредитовИДепозитов.БанковскийСчет <> ЗНАЧЕНИЕ(Справочник.БанковскиеСчетаОрганизаций.ПустаяСсылка)
	|			ТОГДА ДоговорыКредитовИДепозитов.БанковскийСчет.ВалютаДенежныхСредств
	|		ИНАЧЕ ДоговорыКредитовИДепозитов.ВалютаВзаиморасчетов
	|	КОНЕЦ,
	|	ДоговорыКредитовИДепозитов.ВалютаВзаиморасчетов,
	|	ДоговорыКредитовИДепозитов.Организация,
	|	ДоговорыКредитовИДепозитов.Подразделение,
	|	ДоговорыКредитовИДепозитов.Дата,
	|	ВЫБОР
	|		КОГДА ДоговорыКредитовИДепозитов.ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Наличная)
	|			ТОГДА ДоговорыКредитовИДепозитов.Касса
	|		КОГДА ДоговорыКредитовИДепозитов.ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Безналичная)
	|			ТОГДА ДоговорыКредитовИДепозитов.БанковскийСчет
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ДоговорыКредитовИДепозитов.ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Наличная)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.Наличные)
	|		КОГДА ДоговорыКредитовИДепозитов.ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Безналичная)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.Безналичные)
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ДоговорыКредитовИДепозитов.СтатьяДДСОсновногоДолга,
	|	ДоговорыКредитовИДепозитов.Партнер,
	|	ГрафикОплатКредитовИДепозитов.Сумма,
	|	ДоговорыКредитовИДепозитов.Контрагент,
	|	ГрафикОплатКредитовИДепозитов.Период
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ГрафикОплатКредитовИДепозитов.Период,
	|	ГрафикОплатКредитовИДепозитов.Период,
	|	ДоговорыКредитовИДепозитов.Ссылка,
	|	ДоговорыКредитовИДепозитов.Дата,
	|	ВЫБОР
	|		КОГДА ДоговорыКредитовИДепозитов.ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Наличная)
	|				И ДоговорыКредитовИДепозитов.Касса <> ЗНАЧЕНИЕ(Справочник.Кассы.ПустаяСсылка)
	|			ТОГДА ДоговорыКредитовИДепозитов.Касса.ВалютаДенежныхСредств
	|		КОГДА ДоговорыКредитовИДепозитов.ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Безналичная)
	|				И ДоговорыКредитовИДепозитов.БанковскийСчет <> ЗНАЧЕНИЕ(Справочник.БанковскиеСчетаОрганизаций.ПустаяСсылка)
	|			ТОГДА ДоговорыКредитовИДепозитов.БанковскийСчет.ВалютаДенежныхСредств
	|		ИНАЧЕ ДоговорыКредитовИДепозитов.ВалютаВзаиморасчетов
	|	КОНЕЦ,
	|	ДоговорыКредитовИДепозитов.ВалютаВзаиморасчетов,
	|	ДоговорыКредитовИДепозитов.Организация,
	|	ДоговорыКредитовИДепозитов.Подразделение,
	|	ДоговорыКредитовИДепозитов.Контрагент,
	|	ВЫБОР
	|		КОГДА ДоговорыКредитовИДепозитов.ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Наличная)
	|			ТОГДА ДоговорыКредитовИДепозитов.Касса
	|		КОГДА ДоговорыКредитовИДепозитов.ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Безналичная)
	|			ТОГДА ДоговорыКредитовИДепозитов.БанковскийСчет
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ДоговорыКредитовИДепозитов.ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Наличная)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.Наличные)
	|		КОГДА ДоговорыКредитовИДепозитов.ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Безналичная)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.Безналичные)
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	3,
	|	4,
	|	ДоговорыКредитовИДепозитов.СтатьяДДСПроцентов,
	|	ПРЕДСТАВЛЕНИЕ(ДоговорыКредитовИДепозитов.СтатьяДДСПроцентов),
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	ДоговорыКредитовИДепозитов.Партнер,
	|	СУММА(ГрафикОплатКредитовИДепозитов.Проценты * ВЫБОР
	|			КОГДА ДоговорыКредитовИДепозитов.ХарактерДоговора = ЗНАЧЕНИЕ(Перечисление.ХарактерДоговораКредитовИДепозитов.КредитИлиЗайм)
	|				ТОГДА -1
	|			ИНАЧЕ 1
	|		КОНЕЦ),
	|	СУММА(ГрафикОплатКредитовИДепозитов.Проценты),
	|	СУММА(ГрафикОплатКредитовИДепозитов.Проценты)
	|ИЗ
	|	РегистрСведений.ГрафикОплатКредитовИДепозитов КАК ГрафикОплатКредитовИДепозитов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКредитовИДепозитов КАК ДоговорыКредитовИДепозитов
	|		ПО ГрафикОплатКредитовИДепозитов.ВариантГрафика.Владелец = ДоговорыКредитовИДепозитов.Ссылка
	|ГДЕ
	|	ГрафикОплатКредитовИДепозитов.Период МЕЖДУ &РабочаяДата И &ДатаОкончания
	|	И (ДоговорыКредитовИДепозитов.Организация = &Организация
	|			ИЛИ &Организация = НЕОПРЕДЕЛЕНО)
	|	И (ВЫБОР
	|				КОГДА ДоговорыКредитовИДепозитов.ВалютаВзаиморасчетов <> &ВалютаРегламентированногоУчета
	|						И ДоговорыКредитовИДепозитов.ПорядокОплаты = ЗНАЧЕНИЕ(Перечисление.ПорядокОплатыПоСоглашениям.РасчетыВВалютеОплатаВВалюте)
	|					ТОГДА ДоговорыКредитовИДепозитов.ВалютаВзаиморасчетов
	|				ИНАЧЕ &ВалютаРегламентированногоУчета
	|			КОНЕЦ = &Валюта
	|			ИЛИ &Валюта = НЕОПРЕДЕЛЕНО)
	|	И ДоговорыКредитовИДепозитов.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыДоговоровКонтрагентов.Действует)
	|	И ГрафикОплатКредитовИДепозитов.ВариантГрафика.Используется
	|	И ГрафикОплатКредитовИДепозитов.Проценты > 0
	|	И &ИспользоватьДоговорыКредитовИДепозитов
	|
	|СГРУППИРОВАТЬ ПО
	|	ГрафикОплатКредитовИДепозитов.Период,
	|	ДоговорыКредитовИДепозитов.Ссылка,
	|	ВЫБОР
	|		КОГДА ДоговорыКредитовИДепозитов.ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Наличная)
	|				И ДоговорыКредитовИДепозитов.Касса <> ЗНАЧЕНИЕ(Справочник.Кассы.ПустаяСсылка)
	|			ТОГДА ДоговорыКредитовИДепозитов.Касса.ВалютаДенежныхСредств
	|		КОГДА ДоговорыКредитовИДепозитов.ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Безналичная)
	|				И ДоговорыКредитовИДепозитов.БанковскийСчет <> ЗНАЧЕНИЕ(Справочник.БанковскиеСчетаОрганизаций.ПустаяСсылка)
	|			ТОГДА ДоговорыКредитовИДепозитов.БанковскийСчет.ВалютаДенежныхСредств
	|		ИНАЧЕ ДоговорыКредитовИДепозитов.ВалютаВзаиморасчетов
	|	КОНЕЦ,
	|	ДоговорыКредитовИДепозитов.ВалютаВзаиморасчетов,
	|	ДоговорыКредитовИДепозитов.Организация,
	|	ДоговорыКредитовИДепозитов.Подразделение,
	|	ДоговорыКредитовИДепозитов.Дата,
	|	ВЫБОР
	|		КОГДА ДоговорыКредитовИДепозитов.ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Наличная)
	|			ТОГДА ДоговорыКредитовИДепозитов.Касса
	|		КОГДА ДоговорыКредитовИДепозитов.ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Безналичная)
	|			ТОГДА ДоговорыКредитовИДепозитов.БанковскийСчет
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ДоговорыКредитовИДепозитов.ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Наличная)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.Наличные)
	|		КОГДА ДоговорыКредитовИДепозитов.ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Безналичная)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.Безналичные)
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ДоговорыКредитовИДепозитов.Партнер,
	|	ГрафикОплатКредитовИДепозитов.Сумма,
	|	ДоговорыКредитовИДепозитов.СтатьяДДСПроцентов,
	|	ДоговорыКредитовИДепозитов.Контрагент,
	|	ГрафикОплатКредитовИДепозитов.Период
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ГрафикОплатКредитовИДепозитов.Период,
	|	ГрафикОплатКредитовИДепозитов.Период,
	|	ДоговорыКредитовИДепозитов.Ссылка,
	|	ДоговорыКредитовИДепозитов.Дата,
	|	ВЫБОР
	|		КОГДА ДоговорыКредитовИДепозитов.ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Наличная)
	|				И ДоговорыКредитовИДепозитов.Касса <> ЗНАЧЕНИЕ(Справочник.Кассы.ПустаяСсылка)
	|			ТОГДА ДоговорыКредитовИДепозитов.Касса.ВалютаДенежныхСредств
	|		КОГДА ДоговорыКредитовИДепозитов.ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Безналичная)
	|				И ДоговорыКредитовИДепозитов.БанковскийСчет <> ЗНАЧЕНИЕ(Справочник.БанковскиеСчетаОрганизаций.ПустаяСсылка)
	|			ТОГДА ДоговорыКредитовИДепозитов.БанковскийСчет.ВалютаДенежныхСредств
	|		ИНАЧЕ ДоговорыКредитовИДепозитов.ВалютаВзаиморасчетов
	|	КОНЕЦ,
	|	ДоговорыКредитовИДепозитов.ВалютаВзаиморасчетов,
	|	ДоговорыКредитовИДепозитов.Организация,
	|	ДоговорыКредитовИДепозитов.Подразделение,
	|	ДоговорыКредитовИДепозитов.Контрагент,
	|	ВЫБОР
	|		КОГДА ДоговорыКредитовИДепозитов.ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Наличная)
	|			ТОГДА ДоговорыКредитовИДепозитов.Касса
	|		КОГДА ДоговорыКредитовИДепозитов.ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Безналичная)
	|			ТОГДА ДоговорыКредитовИДепозитов.БанковскийСчет
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ДоговорыКредитовИДепозитов.ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Наличная)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.Наличные)
	|		КОГДА ДоговорыКредитовИДепозитов.ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Безналичная)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.Безналичные)
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	3,
	|	4,
	|	ДоговорыКредитовИДепозитов.СтатьяДДСКомиссии,
	|	ПРЕДСТАВЛЕНИЕ(ДоговорыКредитовИДепозитов.СтатьяДДСКомиссии),
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	ДоговорыКредитовИДепозитов.Партнер,
	|	СУММА(ГрафикОплатКредитовИДепозитов.Комиссия * ВЫБОР
	|			КОГДА ДоговорыКредитовИДепозитов.ХарактерДоговора = ЗНАЧЕНИЕ(Перечисление.ХарактерДоговораКредитовИДепозитов.КредитИлиЗайм)
	|				ТОГДА -1
	|			ИНАЧЕ 1
	|		КОНЕЦ),
	|	СУММА(ГрафикОплатКредитовИДепозитов.Комиссия),
	|	СУММА(ГрафикОплатКредитовИДепозитов.Комиссия)
	|ИЗ
	|	РегистрСведений.ГрафикОплатКредитовИДепозитов КАК ГрафикОплатКредитовИДепозитов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКредитовИДепозитов КАК ДоговорыКредитовИДепозитов
	|		ПО ГрафикОплатКредитовИДепозитов.ВариантГрафика.Владелец = ДоговорыКредитовИДепозитов.Ссылка
	|ГДЕ
	|	ГрафикОплатКредитовИДепозитов.Период МЕЖДУ &РабочаяДата И &ДатаОкончания
	|	И (ДоговорыКредитовИДепозитов.Организация = &Организация
	|			ИЛИ &Организация = НЕОПРЕДЕЛЕНО)
	|	И (ВЫБОР
	|				КОГДА ДоговорыКредитовИДепозитов.ВалютаВзаиморасчетов <> &ВалютаРегламентированногоУчета
	|						И ДоговорыКредитовИДепозитов.ПорядокОплаты = ЗНАЧЕНИЕ(Перечисление.ПорядокОплатыПоСоглашениям.РасчетыВВалютеОплатаВВалюте)
	|					ТОГДА ДоговорыКредитовИДепозитов.ВалютаВзаиморасчетов
	|				ИНАЧЕ &ВалютаРегламентированногоУчета
	|			КОНЕЦ = &Валюта
	|			ИЛИ &Валюта = НЕОПРЕДЕЛЕНО)
	|	И ДоговорыКредитовИДепозитов.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыДоговоровКонтрагентов.Действует)
	|	И ГрафикОплатКредитовИДепозитов.ВариантГрафика.Используется
	|	И ГрафикОплатКредитовИДепозитов.Комиссия > 0
	|	И &ИспользоватьДоговорыКредитовИДепозитов
	|
	|СГРУППИРОВАТЬ ПО
	|	ГрафикОплатКредитовИДепозитов.Период,
	|	ДоговорыКредитовИДепозитов.Ссылка,
	|	ВЫБОР
	|		КОГДА ДоговорыКредитовИДепозитов.ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Наличная)
	|				И ДоговорыКредитовИДепозитов.Касса <> ЗНАЧЕНИЕ(Справочник.Кассы.ПустаяСсылка)
	|			ТОГДА ДоговорыКредитовИДепозитов.Касса.ВалютаДенежныхСредств
	|		КОГДА ДоговорыКредитовИДепозитов.ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Безналичная)
	|				И ДоговорыКредитовИДепозитов.БанковскийСчет <> ЗНАЧЕНИЕ(Справочник.БанковскиеСчетаОрганизаций.ПустаяСсылка)
	|			ТОГДА ДоговорыКредитовИДепозитов.БанковскийСчет.ВалютаДенежныхСредств
	|		ИНАЧЕ ДоговорыКредитовИДепозитов.ВалютаВзаиморасчетов
	|	КОНЕЦ,
	|	ДоговорыКредитовИДепозитов.ВалютаВзаиморасчетов,
	|	ДоговорыКредитовИДепозитов.Организация,
	|	ДоговорыКредитовИДепозитов.Подразделение,
	|	ДоговорыКредитовИДепозитов.Дата,
	|	ВЫБОР
	|		КОГДА ДоговорыКредитовИДепозитов.ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Наличная)
	|			ТОГДА ДоговорыКредитовИДепозитов.Касса
	|		КОГДА ДоговорыКредитовИДепозитов.ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Безналичная)
	|			ТОГДА ДоговорыКредитовИДепозитов.БанковскийСчет
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ДоговорыКредитовИДепозитов.ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Наличная)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.Наличные)
	|		КОГДА ДоговорыКредитовИДепозитов.ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Безналичная)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.Безналичные)
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ДоговорыКредитовИДепозитов.Партнер,
	|	ГрафикОплатКредитовИДепозитов.Сумма,
	|	ДоговорыКредитовИДепозитов.СтатьяДДСКомиссии,
	|	ДоговорыКредитовИДепозитов.Контрагент,
	|	ГрафикОплатКредитовИДепозитов.Период"
	+"
	|
	|/////////////////////////////////////////////////////////////////////////////
	|";
	
	Возврат ТекстЗапроса
	
КонецФункции

Функция ТекстЗапросаПодготовкаГрафикаПлатежей()
	
	
	ТекстЗапроса = ";" +
	"
	|/////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ * ПОМЕСТИТЬ ГрафикПлатежей ИЗ ДенежныеСредстваКВыплатеГрафикПлатежей";
	Если Не ТолькоПодтвержденныеПлатежи Тогда
		ТекстЗапроса = ТекстЗапроса + "
		|ОБЪЕДИНИТЬ ВСЕ
		|ВЫБРАТЬ * ИЗ РасчетыГрафикПлатежей";
	КонецЕсли;
	ТекстЗапроса = ТекстЗапроса + "
	//++ НЕ УТ
	|ОБЪЕДИНИТЬ ВСЕ
	|ВЫБРАТЬ * ИЗ ВедомостиГрафикПлатежей
	//-- НЕ УТ
	|ОБЪЕДИНИТЬ ВСЕ
	|ВЫБРАТЬ * ИЗ ДенСредстваВПутиЭквайрингПрочиеПоступленияГрафикПлатежей
	|ОБЪЕДИНИТЬ ВСЕ
	|ВЫБРАТЬ * ИЗ КредитыДепозитыГрафикПлатежей
	|";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаПоГрафикуПлатежей()

	ТекстЗапроса = ";" +
	"
	|/////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	0 КАК НомерПлатежа,
	|	График.ПорядокПлатежа КАК ПорядокПлатежа,
	|	ВЫБОР КОГДА График.День < &РабочаяДата ТОГДА
	|		2  // ""Просроченный платеж""
	|	ИНАЧЕ 
	|		График.СтатусПлатежа
	|	КОНЕЦ КАК СтатусПлатежа,
	|	
	|	График.Документ КАК Документ,
	|	ТИПЗНАЧЕНИЯ(График.Документ) КАК ТипЗначения,
	|	График.Платеж КАК Платеж,
	|	График.Приоритет КАК Приоритет,
	|	ВЫБОР
	|		КОГДА График.Документ ССЫЛКА Документ.ЗаявкаНаРасходованиеДенежныхСредств
	|			ИЛИ График.Документ ССЫЛКА Документ.РаспоряжениеНаПеремещениеДенежныхСредств
	|			ТОГДА График.Документ.Статус
	|		ИНАЧЕ Неопределено
	|	КОНЕЦ КАК Статус,
	|
	|	ВЫБОР
	|		КОГДА График.Документ ССЫЛКА Документ.ЗаявкаНаРасходованиеДенежныхСредств
	|			ТОГДА График.Документ.СверхЛимита
	|		ИНАЧЕ Неопределено
	|	КОНЕЦ КАК СверхЛимита,
	|
	|	ВЫБОР КОГДА &ВыводитьЗаказы ТОГДА
	|		График.Заказ
	|	ИНАЧЕ
	|		Неопределено
	|	КОНЕЦ КАК Заказ,
	|
	|	График.Партнер КАК Партнер,
	|
	|	ВЫБОР КОГДА График.День < &РабочаяДата ТОГДА
	|		ДАТАВРЕМЯ(1,1,1)
	|	ИНАЧЕ
	|		График.ДатаДокумента
	|	КОНЕЦ КАК ДатаДокумента,
	|
	|	ВЫБОР КОГДА График.СтатусПлатежа = 5 ИЛИ График.СтатусПлатежа = 6 ТОГДА
	|		ДАТАВРЕМЯ(1,1,1)
	|	КОГДА График.День < &РабочаяДата ТОГДА
	|		ДАТАВРЕМЯ(1,1,1)
	|	ИНАЧЕ
	|		График.День
	|	КОНЕЦ КАК День,
	|
	|	График.ДатаПлатежа,
	|
	|	График.Валюта КАК Валюта,
	|	График.Организация КАК Организация,
	|	График.Подразделение КАК Подразделение,
	|	График.Получатель КАК Получатель,
	|	ТИПЗНАЧЕНИЯ(График.Получатель) КАК ТипПолучателя,
	|	График.БанковскийСчетКасса КАК БанковскийСчетКасса,
	|	График.ТипДенежныхСредств КАК ТипДенежныхСредств,
	|	График.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
	|
	|	ВЫБОР КОГДА График.Документ ССЫЛКА Документ.РаспоряжениеНаПеремещениеДенежныхСредств ТОГДА
	|		""Перевод""
	|	КОГДА График.Сумма > 0 ТОГДА
	|		""Приход""
	|	КОГДА График.Сумма < 0 ТОГДА
	|		""Расход""
	|	КОНЕЦ КАК ВидДвижения,
	|	
	|	СУММА(График.Сумма
	|		* ВЫБОР КОГДА График.Валюта <> График.ВалютаПлатежа ТОГДА ЕСТЬNULL(КурсыВалют.КоэффициентПересчета, 1) ИНАЧЕ 1 КОНЕЦ) КАК Сумма,
	|	СУММА(График.СуммаПлатежа
	|		* ВЫБОР КОГДА График.Валюта <> График.ВалютаПлатежа ТОГДА ЕСТЬNULL(КурсыВалют.КоэффициентПересчета, 1) ИНАЧЕ 1 КОНЕЦ) КАК СуммаПлатежа,
	|	СУММА(График.ОсталосьОплатить
	|		* ВЫБОР КОГДА График.Валюта <> График.ВалютаПлатежа ТОГДА ЕСТЬNULL(КурсыВалют.КоэффициентПересчета, 1) ИНАЧЕ 1 КОНЕЦ) КАК ОсталосьОплатить,
	|	0 КАК СуммаКонечныйОстаток,
	|	СУММА(График.Сумма * ЕСТЬNULL(КурсыВалютПересчета.КоэффициентПересчета, 1)) КАК СуммаВЕдинойВалюте,
	|	ЕСТЬNULL(КурсыВалютПересчета.КоэффициентПересчета, 1) КАК КоэффициентПересчета,
	|	0 КАК СуммаКонечныйОстатокВЕдинойВалюте
	|ИЗ
	|	ГрафикПлатежей КАК График
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		КурсыВалют КАК КурсыВалют
	|	ПО
	|		График.ВалютаПлатежа = КурсыВалют.Валюта
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		КурсыВалютПересчета КАК КурсыВалютПересчета
	|	ПО
	|		График.ВалютаПлатежа = КурсыВалютПересчета.Валюта
	|
	|ГДЕ
	|	(График.Валюта = &Валюта
	|		ИЛИ &Валюта = Неопределено)
	|	И График.ДатаПлатежа <= &ДатаОкончания
	|	И (График.Организация = &Организация
	|		ИЛИ &Организация = Неопределено)
	|	
	|СГРУППИРОВАТЬ ПО
	|	График.ПорядокПлатежа,
	|	ВЫБОР КОГДА График.День < &РабочаяДата ТОГДА
	|		2  // ""Просроченный платеж""
	|	ИНАЧЕ 
	|		График.СтатусПлатежа
	|	КОНЕЦ,
	|	
	|	График.Документ,
	|	График.Платеж,
	|	График.Приоритет,
	|	ВЫБОР
	|		КОГДА График.Документ ССЫЛКА Документ.ЗаявкаНаРасходованиеДенежныхСредств
	|			ИЛИ График.Документ ССЫЛКА Документ.РаспоряжениеНаПеремещениеДенежныхСредств
	|			ТОГДА График.Документ.Статус
	|		ИНАЧЕ Неопределено
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА График.Документ ССЫЛКА Документ.ЗаявкаНаРасходованиеДенежныхСредств
	|			ТОГДА График.Документ.СверхЛимита
	|		ИНАЧЕ Неопределено
	|	КОНЕЦ,
	|	ВЫБОР КОГДА &ВыводитьЗаказы ТОГДА
	|		График.Заказ
	|	ИНАЧЕ
	|		Неопределено
	|	КОНЕЦ,
	|	График.Партнер,
	|
	|	ВЫБОР КОГДА График.День < &РабочаяДата ТОГДА
	|		ДАТАВРЕМЯ(1,1,1)
	|	ИНАЧЕ
	|		График.ДатаДокумента
	|	КОНЕЦ,
	|
	|	ВЫБОР КОГДА График.СтатусПлатежа = 5 ИЛИ График.СтатусПлатежа = 6 ТОГДА
	|		ДАТАВРЕМЯ(1,1,1)
	|	КОГДА График.День < &РабочаяДата ТОГДА
	|		ДАТАВРЕМЯ(1,1,1)
	|	ИНАЧЕ
	|		График.День
	|	КОНЕЦ,
	|
	|	График.ДатаПлатежа,
	|
	|	График.Валюта,
	|	График.Организация,
	|	График.Подразделение,
	|	График.Получатель,
	|	График.БанковскийСчетКасса,
	|	График.ТипДенежныхСредств,
	|	График.СтатьяДвиженияДенежныхСредств,
	|	График.СтатьяДвиженияДенежныхСредств.РеквизитДопУпорядочивания,
	|	ВЫБОР КОГДА График.Документ ССЫЛКА Документ.РаспоряжениеНаПеремещениеДенежныхСредств ТОГДА
	|		""Перевод""
	|	КОГДА График.Сумма > 0 ТОГДА
	|		""Приход""
	|	КОГДА График.Сумма < 0 ТОГДА
	|		""Расход""
	|	КОНЕЦ,
	|	ЕСТЬNULL(КурсыВалютПересчета.КоэффициентПересчета, 1)
	|
	|УПОРЯДОЧИТЬ ПО
	|	СтатусПлатежа,
	|	ДатаПлатежа ВОЗР,
	|	График.СтатьяДвиженияДенежныхСредств.РеквизитДопУпорядочивания,
	|	ПорядокПлатежа ВОЗР,
	|	Приоритет ВОЗР,
	|	ДатаДокумента ВОЗР,
	|	Документ ВОЗР
	|";
	
	Возврат ТекстЗапроса;
	
КонецФункции

// Рассчитывает сумму оплаты по графику.
//  - заявки по кредитам могут быть, могут не быть
//  - платежи по кредитам могут идти произвольными датами
//  - график платежей есть всегда
// НЕ показывать график платежей если все оплачено по факту или есть заявка на всю сумму платежа по этому договору.
// Показывать график на оставшуюся сумму не покрытую фактической оплатой и заявками.
//
// Парамеры
//  ТаблицаПлатежей - ТаблицаЗначений - таблица плетежей платежного календаря
//
Процедура РасчитатьПлатежиПоКредитам(ТаблицаПлатежей)
	
	Если НЕ ПолучитьФункциональнуюОпцию("ИспользоватьДоговорыКредитовИДепозитов") Тогда
		Возврат;
	КонецЕсли;
	
	// удалим все платежи графика которые уже оплачены (оплата без заявок)
	Отбор = Новый Структура;
	ОтборОстатков = Новый Структура("Договор,Назначение");
	ОстаткиПоКредитамДепозитам = ОстаткиПоКредитамДепозитам();
	
	Отбор.Вставить("ТипЗначения",Тип("СправочникСсылка.ДоговорыКредитовИДепозитов"));
	ПлатежиПоГрафику = ТаблицаПлатежей.НайтиСтроки(Отбор);
	Для Каждого Платеж Из ПлатежиПоГрафику Цикл
		
		ОтборОстатков.Договор = Платеж.Документ;
		ОтборОстатков.Назначение = Платеж.СтатьяДвиженияДенежныхСредств;
		ОстаткиДоговора = ОстаткиПоКредитамДепозитам.НайтиСтроки(ОтборОстатков);
		Если ЗначениеЗаполнено(ОстаткиДоговора) Тогда
			ОстатокПлатежа = ОстаткиДоговора[0];
			Если Платеж.ДатаПлатежа > ДатаОстатковНачалоДня Тогда// платеж в будующем
				ОстатокПлатежа.СуммаПлан = ОстатокПлатежа.СуммаПлан + Платеж.СуммаПлатежа;
			КонецЕсли;
			
			СуммаДолга = Макс(ОстатокПлатежа.СуммаПлан - ОстатокПлатежа.СуммаФакт,0);
			Если СуммаДолга = 0 Тогда
				ТаблицаПлатежей.Удалить(Платеж);
			Иначе
				Платеж.ОсталосьОплатить = Мин(Платеж.СуммаПлатежа, СуммаДолга);
				Платеж.СуммаПлатежа = Платеж.ОсталосьОплатить;
				Платеж.Сумма = ?(Платеж.Сумма < 0, -Платеж.ОсталосьОплатить, Платеж.ОсталосьОплатить);
				Платеж.СуммаВЕдинойВалюте = Платеж.ОсталосьОплатить * Платеж.КоэффициентПересчета;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;// по графику
	
	// удалим все платежи графика по которым оформлены заявки
	Отбор = Новый Структура;
	Отбор.Вставить("ТипПолучателя",Тип("СправочникСсылка.ДоговорыКредитовИДепозитов"));
	ПлатежиПоЗаявкам = ТаблицаПлатежей.НайтиСтроки(Отбор);
	
	ОтборПлатежей = Новый Структура("Документ,СтатьяДвиженияДенежныхСредств");
	Для Каждого ПлатежПоЗаявке Из ПлатежиПоЗаявкам Цикл
		
		СуммаЗаявки = Макс(ПлатежПоЗаявке.Сумма,-ПлатежПоЗаявке.Сумма);
		
		ОтборПлатежей.Документ = ПлатежПоЗаявке.Получатель;
		ОтборПлатежей.СтатьяДвиженияДенежныхСредств = ПлатежПоЗаявке.СтатьяДвиженияДенежныхСредств;
		ПлатежиПоГрафику = ТаблицаПлатежей.НайтиСтроки(ОтборПлатежей);
		Для Каждого ПлатежПоГрафику Из ПлатежиПоГрафику Цикл
			Если ПлатежПоГрафику.ДатаПлатежа < ПлатежПоЗаявке.ДатаПлатежа Тогда
				Продолжить;
			КонецЕсли;
			ВзаиморасчетыСервер.СписатьСумму(ПлатежПоГрафику.СуммаПлатежа, СуммаЗаявки);
			ПлатежПоГрафику.ОсталосьОплатить = ПлатежПоГрафику.СуммаПлатежа;
			ПлатежПоГрафику.Сумма = ?(ПлатежПоГрафику.Сумма < 0, -ПлатежПоГрафику.ОсталосьОплатить, ПлатежПоГрафику.ОсталосьОплатить);
			ПлатежПоГрафику.СуммаВЕдинойВалюте = ПлатежПоГрафику.ОсталосьОплатить * ПлатежПоГрафику.КоэффициентПересчета;
			Если ПлатежПоГрафику.СуммаПлатежа = 0 Тогда
				ТаблицаПлатежей.Удалить(ПлатежПоГрафику);
			КонецЕсли;
			Если СуммаЗаявки = 0 Тогда
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		ПлатежПоЗаявке.Получатель = Неопределено;
		
	КонецЦикла;// по заявкам
	
КонецПроцедуры

Функция ПолучитьТаблицуПланируемыхПлатежей()
	
	ТекстЗапроса = ТекстЗапросаПоАналитикеУчетаПоПартнерам()
		+ ТекстЗапросаВременныеТаблицыПланируемыеИФактическиеПоступления()
		+ ТекстЗапросаВременнаяТаблицаКурсыВалют()
		+ ТекстЗапросаВременнаяТаблицаКурсыВалютПересчетаВЕдинуюВалюту();
		Если Не ТолькоПодтвержденныеПлатежи Тогда
			ТекстЗапроса = ТекстЗапроса
			+ ТекстЗапросаВременнаяТаблицаРасчетыСКлиентами()
			+ ТекстЗапросаВременнаяТаблицаРасчетыСПоставщиками()
			+ ТекстЗапросаВременнаяТаблицаВозвратыКлиентам()
			+ ТекстЗапросаВременнаяТаблицаВозвратыОтПоставщиков();
		КонецЕсли;
		ТекстЗапроса = ТекстЗапроса
		//++ НЕ УТ
		+ ТекстЗапросаВременнаяТаблицаНеоплаченныеВедомости()
		//-- НЕ УТ
		+ ТекстЗапросаВременнаяТаблицаВыплатыПоКредитамДепозитам()
		+ ТекстЗапросаПоДенежнымСредствамКВыплате();
		Если Не ТолькоПодтвержденныеПлатежи Тогда
			ТекстЗапроса = ТекстЗапроса
			+ ТекстЗапросаПоРасчетамСКлиентами()
			+ ТекстЗапросаПоСчетамНаОплату()
			+ ТекстЗапросаПоРасчетамСПоставщиками();
		КонецЕсли;
		ТекстЗапроса = ТекстЗапроса
		//++ НЕ УТ
		+ ТекстЗапросаПоВедомостямНаВыплатуЗарплаты()
		//-- НЕ УТ
		+ ТекстЗапросаПоДенежнымСредствамВПути()
		+ ТекстЗапросаРасчетыПоЭквайрингу()
		+ ТекстЗапросаПоПрочимПоступлениямДенежныхСредств()
		+ ТекстЗапросаПоКредитамДепозитам()
		+ ТекстЗапросаПодготовкаГрафикаПлатежей()
		+ ТекстЗапросаПоГрафикуПлатежей() // должен быть последним в пакете
		;
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Организация", ?(ЗначениеЗаполнено(Организация), Организация, Неопределено));
	Запрос.УстановитьПараметр("Валюта", ?(ЗначениеЗаполнено(Валюта), Валюта, Неопределено));
	Запрос.УстановитьПараметр("ЕдинаяВалюта", ?(ЗначениеЗаполнено(ЕдинаяВалюта), ЕдинаяВалюта, Неопределено));
	Запрос.УстановитьПараметр("ДатаНачала", ПериодПросроченныхПлатежей.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(ПериодБудущихПлатежей.ДатаОкончания));
	Запрос.УстановитьПараметр("ГраницаДатаОкончания", Новый  Граница(КонецДня(ПериодБудущихПлатежей.ДатаОкончания), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("ДатаОстатков", КонецДня(ДатаОстатковНачалоДня));
	Запрос.УстановитьПараметр("ГраницаДатаОстатков", Новый Граница(КонецДня(ДатаОстатковНачалоДня), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("РабочаяДата", ДатаОстатковНачалоДня);
	Запрос.УстановитьПараметр("ВыводитьЗаказы", ВыводитьЗаказы);
	Запрос.УстановитьПараметр("ВыводитьПартнеров", ВыводитьПартнеров);
	Запрос.УстановитьПараметр("ВалютаРегламентированногоУчета", Константы.ВалютаРегламентированногоУчета.Получить());
	Запрос.УстановитьПараметр("ИспользоватьДоговорыКредитовИДепозитов" ,ПолучитьФункциональнуюОпцию("ИспользоватьДоговорыКредитовИДепозитов"));
	
	Запрос.УстановитьПараметр("СтрокаЗаявкаНомер",                НСтр("ru='Заявка №'"));
	Запрос.УстановитьПараметр("СтрокаЗаказКлиента",               НСтр("ru='Заказ клиента'"));
	Запрос.УстановитьПараметр("СтрокаВедомостьЧерезБанк",         НСтр("ru='Ведомость на выплату зарплаты через банк'"));
	Запрос.УстановитьПараметр("СтрокаВедомостьЧерезКассу",        НСтр("ru='Ведомость на выплату зарплаты через кассу'"));
	Запрос.УстановитьПараметр("СтрокаВедомостьНаСчета",           НСтр("ru='Ведомость на выплату зарплаты перечислением на счета'"));
	Запрос.УстановитьПараметр("СтрокаВедомостьЧерезРаздатчика",   НСтр("ru='Ведомость на выплату зарплаты через раздатчика'"));
	Запрос.УстановитьПараметр("СтрокаКПоступлению",               НСтр("ru='К поступлению'"));
	Запрос.УстановитьПараметр("СтрокаКСписанию",                  НСтр("ru='К списанию'"));
	Запрос.УстановитьПараметр("СтрокаПланируемоеПоступление",     НСтр("ru='Планируемое поступление'"));
	
	ТаблицаПлатежей = Запрос.Выполнить().Выгрузить();
	ТаблицаПлатежей.Колонки.Добавить("Группа", Новый ОписаниеТипов("Строка"));
	ТаблицаПлатежей.Колонки.Добавить("ПредставлениеГруппы", Новый ОписаниеТипов("Строка"));
	ТаблицаПлатежей.Колонки.Добавить("ПредставлениеГруппыОстаток", Новый ОписаниеТипов("Строка"));
	ТаблицаПлатежей.Колонки.Добавить("ПредставлениеСуммыПлатежа", Новый ОписаниеТипов("Строка"));
	
	РасчитатьПлатежиПоКредитам(ТаблицаПлатежей);
	
	ЗапросПоОстаткам = ЗапросПоОстаткамДенежныхСредств();
	Выборка = ЗапросПоОстаткам.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СтрокаТаблицы = ТаблицаПлатежей.Вставить(0);
		ЗаполнитьЗначенияСвойств(СтрокаТаблицы, Выборка);
	КонецЦикла;
	
	Соответствие = Новый Соответствие;
	Соответствие.Вставить(1, НСтр("ru='Доступные остатки денежных средств'"));
	Соответствие.Вставить(2, НСтр("ru='Итого просроченных платежей'")); // Просроченные платежи
	Соответствие.Вставить(3, НСтр("ru='Итого платежей за день'"));    // Запланированные платежи
	
	СоответствиеОстаток = Новый Соответствие;
	СоответствиеОстаток.Вставить(1, НСтр("ru='Доступные остатки денежных средств'"));
	СоответствиеОстаток.Вставить(2, НСтр("ru='Остатки денежных средств с учетом просроченных платежей'")); // Просроченные платежи
	СоответствиеОстаток.Вставить(3, НСтр("ru='На %ДатаПлатежа% остатки денежных средств'"));               // Запланированные платежи
	
	ТекущийНомерПлатежа = 0;
	ТекущийДокумент = Неопределено;
	Для Каждого СтрокаТаблицы Из ТаблицаПлатежей Цикл
		
		Если Не ЗначениеЗаполнено(СтрокаТаблицы.Платеж) Тогда
			СтрокаТаблицы.Платеж = "";
		КонецЕсли;
		
		Если Строкатаблицы.СтатусПлатежа = 2 Тогда // Просроченный платеж
			СтрокаТаблицы.Платеж = СтрокаТаблицы.Платеж
			+ " (" + Формат(СтрокаТаблицы.ДатаПлатежа, "ДФ = дд.ММ.гг") + ")";
		КонецЕсли;
		
		Если СпособВыводаСтатейДДС = 1 // Если Статьи ДДС в строках, то для заявок и распоряжений в качестве документа выводится Статья ДДС
			И (СтрокаТаблицы.СтатусПлатежа = 2 Или СтрокаТаблицы.СтатусПлатежа = 3)
			И СтрокаТаблицы.ПорядокПлатежа <> 1 Тогда
			СтрокаТаблицы.Платеж = Строка(СтрокаТаблицы.СтатьяДвиженияДенежныхСредств);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаТаблицы.Получатель) Тогда
			Если СтрокаТаблицы.ПорядокПлатежа = 9
				И ВыводитьПартнеров = Истина 
				И ВыводитьЗаказы = Ложь Тогда
				СтрокаТаблицы.Платеж = Строка(СтрокаТаблицы.Получатель);
			Иначе
				СтрокаТаблицы.Платеж = СтрокаТаблицы.Платеж
					+ "," 
					+ Символы.ВК 
					+ Строка(СтрокаТаблицы.Получатель);
			КонецЕсли;
		КонецЕсли;
		
		Если СтрокаТаблицы.ТипЗначения = Тип("ДокументСсылка.ОжидаемоеПоступлениеДенежныхСредств") Тогда
			СтрокаТаблицы.Платеж = СтрокаТаблицы.Платеж
				+ "," 
				+ Символы.ВК 
				+ Строка(СтрокаТаблицы.Документ.НазначениеПлатежа);
		КонецЕсли;
			
		Если ЗначениеЗаполнено(СтрокаТаблицы.СуммаПлатежа) Тогда
			СтрокаТаблицы.ПредставлениеСуммыПлатежа = Формат(СтрокаТаблицы.СуммаПлатежа, "ЧЦ=15; ЧДЦ=2") + " " + Строка(СтрокаТаблицы.Валюта);
			Если ЗначениеЗаполнено(СтрокаТаблицы.ОсталосьОплатить)
				И СтрокаТаблицы.ПорядокПлатежа = 9 Тогда
				СтрокаТаблицы.ПредставлениеСуммыПлатежа = СтрокаТаблицы.ПредставлениеСуммыПлатежа
				+ Символы.ВК 
				+ "(" + Формат(СтрокаТаблицы.ОсталосьОплатить, "ЧЦ=15; ЧДЦ=2") + " " + Строка(СтрокаТаблицы.Валюта) + ")";
			КонецЕсли;
		КонецЕсли;
		
		СтрокаТаблицы.ПредставлениеГруппы = Соответствие[СтрокаТаблицы.СтатусПлатежа];
		СтрокаТаблицы.ПредставлениеГруппыОстаток = СоответствиеОстаток[СтрокаТаблицы.СтатусПлатежа];
		СтрокаТаблицы.Группа = Строка(СтрокаТаблицы.СтатусПлатежа);
			
		Если СтрокаТаблицы.СтатусПлатежа = 3 Тогда
			СтрокаТаблицы.Группа = СтрокаТаблицы.Группа
				+ Формат(СтрокаТаблицы.День, "ДФ=ггггММдд");
			СтрокаТаблицы.ПредставлениеГруппы = СтрЗаменить(СтрокаТаблицы.ПредставлениеГруппы,
				"%ДатаПлатежа%", Формат(СтрокаТаблицы.День, "ДФ='ддд дд.ММ'"));
			СтрокаТаблицы.ПредставлениеГруппыОстаток = СтрЗаменить(СтрокаТаблицы.ПредставлениеГруппыОстаток,
				"%ДатаПлатежа%", Формат(СтрокаТаблицы.День, "ДФ='ддд дд.ММ'"));
		Иначе
			СтрокаТаблицы.Группа = СтрокаТаблицы.Группа
				+ "00000000";
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ТаблицаПлатежей;

КонецФункции

Функция ПолучитьСписокХозОперацийПеремещения()
	
	СоответствиеИмениХозОперацииЗначению = Новый Соответствие;
	СоответствиеИмениХозОперацииПредставлению = Новый Соответствие;
	
	ИмяХозОперации = ОбщегоНазначения.ИмяЗначенияПеречисления(Перечисления.ХозяйственныеОперации.ПоступлениеДенежныхСредствИзБанка);
	СоответствиеИмениХозОперацииЗначению.Вставить(ИмяХозОперации, Перечисления.ХозяйственныеОперации.ПоступлениеДенежныхСредствИзБанка);
	СоответствиеИмениХозОперацииПредставлению.Вставить(ИмяХозОперации, НСтр("ru = 'Поступление из банка'"));
	ИмяХозОперации = ОбщегоНазначения.ИмяЗначенияПеречисления(Перечисления.ХозяйственныеОперации.СдачаДенежныхСредствВБанк);
	СоответствиеИмениХозОперацииЗначению.Вставить(ИмяХозОперации, Перечисления.ХозяйственныеОперации.СдачаДенежныхСредствВБанк);
	СоответствиеИмениХозОперацииПредставлению.Вставить(ИмяХозОперации, НСтр("ru = 'Сдача в банк'"));
	ИмяХозОперации = ОбщегоНазначения.ИмяЗначенияПеречисления(Перечисления.ХозяйственныеОперации.ВыдачаДенежныхСредствВДругуюКассу);
	СоответствиеИмениХозОперацииЗначению.Вставить(ИмяХозОперации, Перечисления.ХозяйственныеОперации.ВыдачаДенежныхСредствВДругуюКассу);
	СоответствиеИмениХозОперацииПредставлению.Вставить(ИмяХозОперации, НСтр("ru = 'Выдача в другую кассу'"));
	ИмяХозОперации = ОбщегоНазначения.ИмяЗначенияПеречисления(Перечисления.ХозяйственныеОперации.ПеречислениеДенежныхСредствНаДругойСчет);
	СоответствиеИмениХозОперацииЗначению.Вставить(ИмяХозОперации, Перечисления.ХозяйственныеОперации.ПеречислениеДенежныхСредствНаДругойСчет);
	СоответствиеИмениХозОперацииПредставлению.Вставить(ИмяХозОперации, НСтр("ru = 'Перечисление на другой счет'"));
	
	Возврат Новый Структура("СоответствиеИмениХозОперацииЗначению, СоответствиеИмениХозОперацииПредставлению",
		СоответствиеИмениХозОперацииЗначению,
		СоответствиеИмениХозОперацииПредставлению);
	
КонецФункции

//++ НЕ УТ

Функция ТекстЗапросаВременнаяТаблицаНеоплаченныеВедомости()
	
	ТекстЗапроса = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ДанныеДокумента.Ссылка КАК Ссылка
	|
	|ПОМЕСТИТЬ НеоплаченныеВедомости
	|ИЗ
	|	Документ.ВедомостьНаВыплатуЗарплатыВБанк КАК ДанныеДокумента
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.ВедомостьНаВыплатуЗарплатыВБанк.Зарплата КАК ТаблицаЗарплата
	|	ПО
	|		ДанныеДокумента.Ссылка = ТаблицаЗарплата.Ссылка
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Справочник.Сотрудники КАК Сотрудники
	|	ПО
	|		ТаблицаЗарплата.Сотрудник = Сотрудники.Ссылка
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		РегистрСведений.ОплатаВедомостейНаВыплатуЗарплаты КАК ОплатаВедомостей
	|	ПО
	|		ТаблицаЗарплата.Ссылка = ОплатаВедомостей.Ведомость
	|		И Сотрудники.ФизическоеЛицо = ОплатаВедомостей.ФизическоеЛицо
	|
	|ГДЕ
	|	ДанныеДокумента.Проведен
	|	И ОплатаВедомостей.Ведомость ЕСТЬ NULL
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДанныеДокумента.Ссылка КАК Ссылка
	|
	|ИЗ
	|	Документ.ВедомостьНаВыплатуЗарплатыВКассу КАК ДанныеДокумента
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.ВедомостьНаВыплатуЗарплатыВКассу.Зарплата КАК ТаблицаЗарплата
	|	ПО
	|		ДанныеДокумента.Ссылка = ТаблицаЗарплата.Ссылка
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Справочник.Сотрудники КАК Сотрудники
	|	ПО
	|		ТаблицаЗарплата.Сотрудник = Сотрудники.Ссылка
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		РегистрСведений.ОплатаВедомостейНаВыплатуЗарплаты КАК ОплатаВедомостей
	|	ПО
	|		ТаблицаЗарплата.Ссылка = ОплатаВедомостей.Ведомость
	|		И Сотрудники.ФизическоеЛицо = ОплатаВедомостей.ФизическоеЛицо
	|
	|ГДЕ
	|	ДанныеДокумента.Проведен
	|	И ОплатаВедомостей.Ведомость ЕСТЬ NULL
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДанныеДокумента.Ссылка КАК Ссылка
	|
	|ИЗ
	|	Документ.ВедомостьНаВыплатуЗарплатыПеречислением КАК ДанныеДокумента
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.ВедомостьНаВыплатуЗарплатыПеречислением.Зарплата КАК ТаблицаЗарплата
	|	ПО
	|		ДанныеДокумента.Ссылка = ТаблицаЗарплата.Ссылка
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Справочник.Сотрудники КАК Сотрудники
	|	ПО
	|		ТаблицаЗарплата.Сотрудник = Сотрудники.Ссылка
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		РегистрСведений.ОплатаВедомостейНаВыплатуЗарплаты КАК ОплатаВедомостей
	|	ПО
	|		ТаблицаЗарплата.Ссылка = ОплатаВедомостей.Ведомость
	|		И Сотрудники.ФизическоеЛицо = ОплатаВедомостей.ФизическоеЛицо
	|
	|ГДЕ
	|	ДанныеДокумента.Проведен
	|	И ОплатаВедомостей.Ведомость ЕСТЬ NULL
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДанныеДокумента.Ссылка КАК Ссылка
	|
	|ИЗ
	|	Документ.ВедомостьНаВыплатуЗарплатыРаздатчиком КАК ДанныеДокумента
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.ВедомостьНаВыплатуЗарплатыРаздатчиком.Зарплата КАК ТаблицаЗарплата
	|	ПО
	|		ДанныеДокумента.Ссылка = ТаблицаЗарплата.Ссылка
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Справочник.Сотрудники КАК Сотрудники
	|	ПО
	|		ТаблицаЗарплата.Сотрудник = Сотрудники.Ссылка
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		РегистрСведений.ОплатаВедомостейНаВыплатуЗарплаты КАК ОплатаВедомостей
	|	ПО
	|		ТаблицаЗарплата.Ссылка = ОплатаВедомостей.Ведомость
	|		И Сотрудники.ФизическоеЛицо = ОплатаВедомостей.ФизическоеЛицо
	|
	|ГДЕ
	|	ДанныеДокумента.Проведен
	|	И ОплатаВедомостей.Ведомость ЕСТЬ NULL
	|;
	|/////////////////////////////////////////////////////////////////////////////
	|";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаПоВедомостямНаВыплатуЗарплаты()

	ТекстЗапроса =
	";" +
	"
	|/////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КОНЕЦПЕРИОДА(ДанныеДокумента.ПериодРегистрации, МЕСЯЦ) КАК День,
	|	КОНЕЦПЕРИОДА(ДанныеДокумента.ПериодРегистрации, МЕСЯЦ) КАК ДатаПлатежа,
	|	ВЫБОР
	|		КОГДА &ВыводитьЗаказы
	|			ТОГДА ДанныеДокумента.Ссылка
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ВыплатаЗаработнойПлаты)
	|	КОНЕЦ КАК Документ,
	|	ДанныеДокумента.Дата КАК ДатаДокумента,
	|	&ВалютаРегламентированногоУчета КАК Валюта,
	|	&ВалютаРегламентированногоУчета КАК ВалютаПлатежа,
	|	ДанныеДокумента.Организация КАК Организация,
	|	ДанныеДокумента.Подразделение КАК Подразделение,
	|	Неопределено КАК Получатель,
	|	Неопределено КАК БанковскийСчетКасса,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.Безналичные) КАК ТипДенежныхСредств,
	|	3 КАК СтатусПлатежа,
	|	9 КАК ПорядокПлатежа,
	|	ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ВыплатаЗаработнойПлаты) КАК СтатьяДвиженияДенежныхСредств,
	|	&СтрокаВедомостьЧерезБанк КАК Платеж,
	|	Неопределено КАК Приоритет,
	|	Неопределено КАК Заказ,
	|	Неопределено КАК Партнер,
	|	- ДанныеДокумента.СуммаПоДокументу КАК Сумма,
	|	ДанныеДокумента.СуммаПоДокументу КАК СуммаПлатежа,
	|	ДанныеДокумента.СуммаПоДокументу КАК ОсталосьОплатить
	|	
	|	ПОМЕСТИТЬ ВедомостиГрафикПлатежей
	|
	|ИЗ
	|	Документ.ВедомостьНаВыплатуЗарплатыВБанк КАК ДанныеДокумента
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		Документ.ЗаявкаНаРасходованиеДенежныхСредств.ВедомостиНаВыплатуЗарплаты КАК Заявка
	|	ПО
	|		ДанныеДокумента.Ссылка = Заявка.Ведомость
	|		И Заявка.Ссылка.Проведен
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		НеоплаченныеВедомости КАК НеоплаченныеВедомости
	|	ПО
	|		ДанныеДокумента.Ссылка = НеоплаченныеВедомости.Ссылка
	|
	|ГДЕ
	|	Заявка.Ссылка ЕСТЬ NULL
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КОНЕЦПЕРИОДА(ДанныеДокумента.ПериодРегистрации, МЕСЯЦ) КАК День,
	|	КОНЕЦПЕРИОДА(ДанныеДокумента.ПериодРегистрации, МЕСЯЦ) КАК ДатаПлатежа,
	|	ВЫБОР
	|		КОГДА &ВыводитьЗаказы
	|			ТОГДА ДанныеДокумента.Ссылка
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ВыплатаЗаработнойПлаты)
	|	КОНЕЦ КАК Документ,
	|	ДанныеДокумента.Дата КАК ДатаДокумента,
	|	&ВалютаРегламентированногоУчета КАК Валюта,
	|	&ВалютаРегламентированногоУчета КАК ВалютаПлатежа,
	|	ДанныеДокумента.Организация КАК Организация,
	|	ДанныеДокумента.Подразделение КАК Подразделение,
	|	Неопределено КАК Получатель,
	|	ДанныеДокумента.Касса КАК БанковскийСчетКасса,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.Наличные) КАК ТипДенежныхСредств,
	|	3 КАК СтатусПлатежа,
	|	9 КАК ПорядокПлатежа,
	|	ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ВыплатаЗаработнойПлаты) КАК СтатьяДвиженияДенежныхСредств,
	|	&СтрокаВедомостьЧерезКассу КАК Платеж,
	|	Неопределено КАК Приоритет,
	|	Неопределено КАК Заказ,
	|	Неопределено КАК Партнер,
	|	- ДанныеДокумента.СуммаПоДокументу КАК Сумма,
	|	ДанныеДокумента.СуммаПоДокументу КАК СуммаПлатежа,
	|	ДанныеДокумента.СуммаПоДокументу КАК ОсталосьОплатить
	|ИЗ
	|	Документ.ВедомостьНаВыплатуЗарплатыВКассу КАК ДанныеДокумента
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		Документ.ЗаявкаНаРасходованиеДенежныхСредств.ВедомостиНаВыплатуЗарплаты КАК Заявка
	|	ПО
	|		ДанныеДокумента.Ссылка = Заявка.Ведомость
	|		И Заявка.Ссылка.Проведен
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		НеоплаченныеВедомости КАК НеоплаченныеВедомости
	|	ПО
	|		ДанныеДокумента.Ссылка = НеоплаченныеВедомости.Ссылка
	|
	|ГДЕ
	|	Заявка.Ссылка ЕСТЬ NULL
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КОНЕЦПЕРИОДА(ДанныеДокумента.ПериодРегистрации, МЕСЯЦ) КАК День,
	|	КОНЕЦПЕРИОДА(ДанныеДокумента.ПериодРегистрации, МЕСЯЦ) КАК ДатаПлатежа,
	|	ВЫБОР
	|		КОГДА &ВыводитьЗаказы
	|			ТОГДА ДанныеДокумента.Ссылка
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ВыплатаЗаработнойПлаты)
	|	КОНЕЦ КАК Документ,
	|	ДанныеДокумента.Дата КАК ДатаДокумента,
	|	&ВалютаРегламентированногоУчета КАК Валюта,
	|	&ВалютаРегламентированногоУчета КАК ВалютаПлатежа,
	|	ДанныеДокумента.Организация КАК Организация,
	|	ДанныеДокумента.Подразделение КАК Подразделение,
	|	Неопределено КАК Получатель,
	|	Неопределено КАК БанковскийСчетКасса,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.Безналичные) КАК ТипДенежныхСредств,
	|	3 КАК СтатусПлатежа,
	|	9 КАК ПорядокПлатежа,
	|	ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ВыплатаЗаработнойПлаты) КАК СтатьяДвиженияДенежныхСредств,
	|	&СтрокаВедомостьНаСчета КАК Платеж,
	|	Неопределено КАК Приоритет,
	|	Неопределено КАК Заказ,
	|	Неопределено КАК Партнер,
	|	- ДанныеДокумента.СуммаПоДокументу КАК Сумма,
	|	ДанныеДокумента.СуммаПоДокументу КАК СуммаПлатежа,
	|	ДанныеДокумента.СуммаПоДокументу КАК ОсталосьОплатить
	|ИЗ
	|	Документ.ВедомостьНаВыплатуЗарплатыПеречислением КАК ДанныеДокумента
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		Документ.ЗаявкаНаРасходованиеДенежныхСредств.ВедомостиНаВыплатуЗарплаты КАК Заявка
	|	ПО
	|		ДанныеДокумента.Ссылка = Заявка.Ведомость
	|		И Заявка.Ссылка.Проведен
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		НеоплаченныеВедомости КАК НеоплаченныеВедомости
	|	ПО
	|		ДанныеДокумента.Ссылка = НеоплаченныеВедомости.Ссылка
	|
	|ГДЕ
	|	Заявка.Ссылка ЕСТЬ NULL
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КОНЕЦПЕРИОДА(ДанныеДокумента.ПериодРегистрации, МЕСЯЦ) КАК День,
	|	КОНЕЦПЕРИОДА(ДанныеДокумента.ПериодРегистрации, МЕСЯЦ) КАК ДатаПлатежа,
	|	ВЫБОР
	|		КОГДА &ВыводитьЗаказы
	|			ТОГДА ДанныеДокумента.Ссылка
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ВыплатаЗаработнойПлаты)
	|	КОНЕЦ КАК Документ,
	|	ДанныеДокумента.Дата КАК ДатаДокумента,
	|	&ВалютаРегламентированногоУчета КАК Валюта,
	|	&ВалютаРегламентированногоУчета КАК ВалютаПлатежа,
	|	ДанныеДокумента.Организация КАК Организация,
	|	ДанныеДокумента.Подразделение КАК Подразделение,
	|	Неопределено КАК Получатель,
	|	Неопределено КАК БанковскийСчетКасса,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.Наличные) КАК ТипДенежныхСредств,
	|	3 КАК СтатусПлатежа,
	|	9 КАК ПорядокПлатежа,
	|	ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ВыплатаЗаработнойПлаты) КАК СтатьяДвиженияДенежныхСредств,
	|	&СтрокаВедомостьЧерезРаздатчика КАК Платеж,
	|	Неопределено КАК Приоритет,
	|	Неопределено КАК Заказ,
	|	Неопределено КАК Партнер,
	|	- ДанныеДокумента.СуммаПоДокументу КАК Сумма,
	|	ДанныеДокумента.СуммаПоДокументу КАК СуммаПлатежа,
	|	ДанныеДокумента.СуммаПоДокументу КАК ОсталосьОплатить
	|ИЗ
	|	Документ.ВедомостьНаВыплатуЗарплатыРаздатчиком КАК ДанныеДокумента
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		Документ.ЗаявкаНаРасходованиеДенежныхСредств.ВедомостиНаВыплатуЗарплаты КАК Заявка
	|	ПО
	|		ДанныеДокумента.Ссылка = Заявка.Ведомость
	|		И Заявка.Ссылка.Проведен
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		НеоплаченныеВедомости КАК НеоплаченныеВедомости
	|	ПО
	|		ДанныеДокумента.Ссылка = НеоплаченныеВедомости.Ссылка
	|
	|ГДЕ
	|	Заявка.Ссылка ЕСТЬ NULL
	|";
	
	Возврат ТекстЗапроса
	
КонецФункции

//-- НЕ УТ

#КонецОбласти

#КонецЕсли
