
Процедура ПриСозданииНаСервере_ФормаРабочееМесто(Форма, Отказ, СтандартнаяОбработка) Экспорт
	
	Список = Форма.СписокТаможенныеДекларацииЭкспорт; 
	Список.ПроизвольныйЗапрос = Истина;
	Список.ТекстЗапроса = 
	"ВЫБРАТЬ
	|	МАКСИМУМ(ТаможеннаяДекларацияЭкспортДокументыОснования.ДокументОснование.Контрагент) КАК Контрагент,
	|	МАКСИМУМ(ТаможеннаяДекларацияЭкспортДокументыОснования.ДокументОснование.Валюта) КАК Валюта,
	|	СУММА(ТаможеннаяДекларацияЭкспортДокументыОснования.ДокументОснование.СуммаДокумента) КАК СуммаДокумента,
	|	СУММА(СуммыРуб.Сумма) КАК Суммаруб,
	|	ТаможеннаяДекларацияЭкспортДокументыОснования.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ СуммыРТУ
	|ИЗ
	|	Документ.ТаможеннаяДекларацияЭкспорт.ДокументыОснования КАК ТаможеннаяДекларацияЭкспортДокументыОснования
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			СУММА(Хозрасчетный.Сумма) КАК Сумма,
	|			Хозрасчетный.Регистратор КАК Ссылка
	|		ИЗ
	|			РегистрБухгалтерии.Хозрасчетный КАК Хозрасчетный
	|		ГДЕ
	|			Хозрасчетный.СчетДт = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПокупателямиВал)
	|			И Хозрасчетный.СчетКт = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВыручкаНеЕНВД)
	|		
	|		СГРУППИРОВАТЬ ПО
	|			Хозрасчетный.Регистратор) КАК СуммыРуб
	|		ПО ТаможеннаяДекларацияЭкспортДокументыОснования.ДокументОснование = СуммыРуб.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаможеннаяДекларацияЭкспортДокументыОснования.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаможеннаяДекларацияЭкспорт.Ссылка КАК Ссылка,
	|	ТаможеннаяДекларацияЭкспорт.ПометкаУдаления КАК ПометкаУдаления,
	|	ТаможеннаяДекларацияЭкспорт.Номер КАК Номер,
	|	ТаможеннаяДекларацияЭкспорт.Дата КАК Дата,
	|	ТаможеннаяДекларацияЭкспорт.Проведен КАК Проведен,
	|	ТаможеннаяДекларацияЭкспорт.Организация КАК Организация,
	|	ТаможеннаяДекларацияЭкспорт.КодОперации КАК КодОперации,
	|	ТаможеннаяДекларацияЭкспорт.Примечание КАК Примечание,
	|	ТаможеннаяДекларацияЭкспорт.СборСопроводительныхДокументовЗавершен КАК СборСопроводительныхДокументовЗавершен,
	|	ТаможеннаяДекларацияЭкспорт.Комментарий КАК Комментарий,
	|	ТаможеннаяДекларацияЭкспорт.Автор КАК Автор,
	|	ТаможеннаяДекларацияЭкспорт.ДокументОснование КАК ДокументОснование,
	|	СуммыРТУ.Контрагент КАК Контрагент,
	|	СуммыРТУ.Валюта КАК Валюта,
	|	СуммыРТУ.СуммаДокумента КАК СуммаДокумента,
	|	СуммыРТУ.Суммаруб КАК СуммаРуб
	|ИЗ
	|	Документ.ТаможеннаяДекларацияЭкспорт КАК ТаможеннаяДекларацияЭкспорт
	|		ЛЕВОЕ СОЕДИНЕНИЕ СуммыРТУ КАК СуммыРТУ
	|		ПО ТаможеннаяДекларацияЭкспорт.Ссылка = СуммыРТУ.Ссылка";
	
	_ОбщегоНазначенияДоп.ДобавитьКолонкуЕстьФайлы(Форма, "СписокТаможенныеДекларацииЭкспорт", "ТаможеннаяДекларацияЭкспорт", Форма.Элементы.ТаможенныеДекларацииОрганизация, Форма.Элементы.ТаможенныеДекларации);
	
	Элемент = Форма.Элементы.Вставить("_Контрагент", Тип("ПолеФормы"), Форма.Элементы.ТаможенныеДекларации, );
    Элемент.Вид         = ВидПоляФормы.ПолеВвода;
	Элемент.ПутьКДанным = "СписокТаможенныеДекларацииЭкспорт.Контрагент";
	
	Элемент = Форма.Элементы.Вставить("_СуммаДокумента", Тип("ПолеФормы"), Форма.Элементы.ТаможенныеДекларации, );
    Элемент.Вид         = ВидПоляФормы.ПолеВвода;
	Элемент.ПутьКДанным = "СписокТаможенныеДекларацииЭкспорт.СуммаДокумента";
	
	Элемент = Форма.Элементы.Вставить("_Валюта", Тип("ПолеФормы"), Форма.Элементы.ТаможенныеДекларации, );
    Элемент.Вид         = ВидПоляФормы.ПолеВвода;
	Элемент.ПутьКДанным = "СписокТаможенныеДекларацииЭкспорт.Валюта";
	
	Элемент = Форма.Элементы.Вставить("_СуммаРуб", Тип("ПолеФормы"), Форма.Элементы.ТаможенныеДекларации, );
    Элемент.Вид         = ВидПоляФормы.ПолеВвода;
	Элемент.ПутьКДанным = "СписокТаможенныеДекларацииЭкспорт.СуммаРуб";
	
КонецПроцедуры

Процедура ПриСозданииНаСервере_ФормаДокумента(Форма, Отказ, СтандартнаяОбработка) Экспорт
	
	МассивОснований = Форма.Объект.ДокументыОснования.Выгрузить().ВыгрузитьКолонку("ДокументОснование");
	Если МассивОснований.Количество() > 0 Тогда
	
		СуммаРуб = _РеализацияТоваровУслуг.ПолучитьСуммуРубПоПроводкам(МассивОснований);
		
		ИтогоСумма = 0;
		СоответствиеСумм = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(МассивОснований, "СуммаДокумента");
		Для каждого КлючИЗначение из СоответствиеСумм Цикл
			ИтогоСумма = ИтогоСумма + КлючИЗначение.Значение;
		КонецЦикла;	
		
		Валюта = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(МассивОснований[0], "Валюта");
		
		Элемент = Форма.Элементы.Вставить("_Итоги", Тип("ДекорацияФормы"), Форма.Элементы.Левая, );
	   	Элемент.Вид         = ВидДекорацииФормы.Надпись;
		Элемент.Заголовок   = Формат(ИтогоСумма, "ЧДЦ=2") + " " + Строка(Валюта) + " ( " + Формат(СуммаРуб, "ЧДЦ=2") + " руб )";
		Элемент.ВертикальноеПоложениеВГруппе = ВертикальноеПоложениеЭлемента.Центр;
		Элемент.Шрифт       = Новый Шрифт(,, Истина);
	
	КонецЕсли;
	
КонецПроцедуры
