
&НаКлиенте
Процедура Загрузить(Команда)
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Номенклатура", Номенклатура);
	СтруктураПараметров.Вставить("МассивВидовЦен", ВидыЦен.ВыгрузитьЗначения());
	
	Форма = ПолучитьФорму("Обработка.ПрайсЛист.Форма.Форма", СтруктураПараметров);
	Форма.Открыть();
	
	СтрокаЦенаБазовая = Форма.ВыбранныеЦены[0];
	
	Для каждого Строка1 из Форма.ДеревоЦен.ПолучитьЭлементы() Цикл
		
		Для каждого Строка2 из Строка1.ПолучитьЭлементы() Цикл
			
			Строка2[СтрокаЦенаБазовая.ИмяКолонки] = НайтиЦену(Строка2.Характеристика);
			
		КонецЦикла;	
		
	КонецЦикла;	
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	Макет = ОбработкаОбъект.ПолучитьМакет("Демо");
	
	ТабДок.Вывести(Макет);
	
	Номенклатура = Справочники.Номенклатура.НайтиПоНаименованию("ФК (FW)");
	
	ВидыЦен.Добавить(Справочники.ВидыЦен.НайтиПоНаименованию("Цена продажи ФК базовая руб."));
	ВидыЦен.Добавить(Справочники.ВидыЦен.НайтиПоНаименованию("Цена продажи ФК 3% за руб."));
	ВидыЦен.Добавить(Справочники.ВидыЦен.НайтиПоНаименованию("Цена продажи ФК 5% за руб."));
	ВидыЦен.Добавить(Справочники.ВидыЦен.НайтиПоНаименованию("Цена продажи ФК 7% за руб."));
	
КонецПроцедуры

&НаСервере
Функция ПрочитатьЦеныСервер()
	
	Шинина = Мин(ТабДок.ШиринаСтраницы, 12);
	
	Сорта = Новый Массив;
	Для Колонка = 5 по Шинина Цикл
		Сорт = ТабДок.Область(3, Колонка, 3, Колонка).Текст;
		Сорта.Добавить(СокрЛП(Сорт));
	КонецЦикла;	
	
	ТаблицаЦен.Очистить();
	Для Строка = 1 По Мин(ТабДок.ВысотаТаблицы, 40) Цикл
		
		Область = ТабДок.Область(Строка, 1, Строка, 1);
		Если Область.ЦветТекста = WebЦвета.СветлоСерый Тогда
			Продолжить;
		КонецЕсли;	
		
		ТолщинаСтр = Область.Текст;
		Толщина = _ОбщегоНазначенияДоп.вЧисло(ТолщинаСтр);
		
		Если Толщина = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Для Колонка = 5 по Шинина Цикл
			
			ЦенаСтр = ТабДок.Область(Строка, Колонка, Строка, Колонка).Текст;
			Цена = Окр(_ОбщегоНазначенияДоп.вЧисло(ЦенаСтр), 2);
			Если Цена = 0 Тогда
				Продолжить;
			КонецЕсли;	
			
			НоваяСтрока = ТаблицаЦен.Добавить();
			НоваяСтрока.Толщина = Толщина;
			НоваяСтрока.Сорт = Сорта[Колонка - 5];
			НоваяСтрока.Цена = Цена;
			
		КонецЦикла;	
		
	КонецЦикла;	
	
КонецФункции	

&НаКлиенте
Процедура ПрочитатьЦены(Команда)
	
	ПрочитатьЦеныСервер();
	Элементы.ФормаЗагрузить.КнопкаПоУмолчанию = Истина;
	Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаЦены;
	
КонецПроцедуры

&НаСервере
Функция НайтиЦену(Характеристика)
	
	Толщина = _ХарактеристикиНоменклатуры.ПолучитьТолщину(Характеристика);
	Сорт    = _ОбщегоНазначенияДоп.ПолучитьДопРеквизит(Характеристика, "6 Сорт");
	
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("Толщина", Толщина);
	СтруктураОтбора.Вставить("Сорт",    Строка(Сорт));
	
	НайденныеСтроки = ТаблицаЦен.НайтиСтроки(СтруктураОтбора);
	Если НайденныеСтроки.Количество() > 0 Тогда
		Возврат НайденныеСтроки[0].Цена;
	Иначе
		Возврат 0;
	КонецЕсли;	
	
КонецФункции	


