
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Попытка
		СсылкаНаОбъект = Параметры.ОбъектыНазначения[0];
	Исключение
	КонецПопытки;	
	
КонецПроцедуры

&НаКлиенте
Процедура Версии(Команда)
	
	ОткрытьФорму("РегистрСведений.ВерсииОбъектов.Форма.ВыборХранимыхВерсий", Новый Структура("Ссылка", СсылкаНаОбъект));
		
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ЗначениеЗаполнено(СсылкаНаОбъект) Тогда
		ОткрытьФорму("РегистрСведений.ВерсииОбъектов.Форма.ВыборХранимыхВерсий", Новый Структура("Ссылка", СсылкаНаОбъект));
		Отказ = Истина;
	КонецЕсли;								
	
КонецПроцедуры
