&НаСервере
Функция ПечатьНаСервере()
	
	Массив = Новый Массив;
    Массив.Добавить(Ссылка);
	
	КоллекцияПечатныхФорм = УправлениеПечатью.ПодготовитьКоллекциюПечатныхФорм(ИмяПечФормы);
    ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
    ОбработкаОбъект.Печать(Массив,
                           КоллекцияПечатныхФорм,
                           Новый СписокЗначений,
                           Неопределено);
    КоллекцияПечатныхФормМассив = ОбщегоНазначения.ТаблицаЗначенийВМассив(КоллекцияПечатныхФорм);    
    Возврат КоллекцияПечатныхФормМассив;
                                        
КонецФункции

&НаКлиенте
Процедура Печать(Команда)
    
    //Этим способом все формы в одном табличном документе как в стандартном механизме печати,
    //При необходимости можно сделать чтобы было в разных
    КоллекцияПечатныхФормМассив = ПечатьНаСервере();
    УправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияПечатныхФормМассив);

КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
    ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	СведенияОбОбработке = ОбработкаОбъект.СведенияОВнешнейОбработке();
	
	Для каждого СтрокаТЗ из СведенияОбОбработке.Команды Цикл
		
		Элементы.ИмяПечФормы.СписокВыбора.Добавить(СтрокаТЗ.Идентификатор);
		
	КонецЦикла;	
	
КонецПроцедуры

