
&НаКлиенте
Процедура КорректировкаСебестоимостьБезКоличества(Команда)
	ДокументСсылка = КорректировкаСебестоимостьБезКоличестваНаСервере();
	ПоказатьОповещениеПользователя("Создан документ", ПолучитьНавигационнуюСсылку(ДокументСсылка), Строка(ДокументСсылка));
КонецПроцедуры

&НаСервере
Функция КорректировкаСебестоимостьБезКоличестваНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	&Дата КАК Период,
	|	Рег.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	Рег.РазделУчета КАК РазделУчета,
	|	Рег.ВидЗапасов КАК ВидЗапасов,
	|	Рег.Организация КАК Организация,
	|	Рег.СтоимостьОстаток КАК Стоимость,
	|	Рег.СтоимостьБезНДСОстаток КАК СтоимостьБезНДС,
	|	Рег.СуммаДопРасходовОстаток КАК СуммаДопРасходов,
	|	Рег.СуммаДопРасходовБезНДСОстаток КАК СуммаДопРасходовБезНДС,
	|	Рег.СтоимостьРеглОстаток КАК СтоимостьРегл,
	|	Рег.ПостояннаяРазницаОстаток КАК ПостояннаяРазница,
	|	Рег.ВременнаяРазницаОстаток КАК ВременнаяРазница
	|ИЗ
	|	РегистрНакопления.СебестоимостьТоваров.Остатки(&Период, Организация = &Организация) КАК Рег
	|ГДЕ
	|	Рег.КоличествоОстаток = 0";
	
	Запрос.Параметры.Вставить("Дата",        '2015-12-31 23:59:59');
	Запрос.Параметры.Вставить("Период",      '2016-01-01');
	Запрос.Параметры.Вставить("Организация", Объект.Организация);
	
	ТаблицаСебестоимость = Запрос.Выполнить().Выгрузить();
	Если ТаблицаСебестоимость.Количество() > 0 Тогда
		
		ДокументОбъект = НайтиДокументКорректировку("Сторно себестоимости без количества");
		Если Ложь Тогда
			ДокументОбъект = Документы.КорректировкаРегистров.СоздатьДокумент();
		КонецЕсли;	
		
		ДокументОбъект.ТаблицаРегистров.Очистить();
		
		НоваяСтрока = ДокументОбъект.ТаблицаРегистров.Добавить();
		НоваяСтрока.Имя = "СебестоимостьТоваров";
		
		ДокументОбъект.Движения.СебестоимостьТоваров.Загрузить(ТаблицаСебестоимость);
		ДокументОбъект.Записать();
	
		Возврат ДокументОбъект.Ссылка;
	
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

&НаСервереБезКонтекста
Функция НайтиДокументКорректировку(Комментарий)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КорректировкаРегистров.Ссылка
	|ИЗ
	|	Документ.КорректировкаРегистров КАК КорректировкаРегистров
	|ГДЕ
	|	НАЧАЛОПЕРИОДА(КорректировкаРегистров.Дата, ДЕНЬ) = &Дата
	|	И КорректировкаРегистров.Комментарий ПОДОБНО &Комментарий";
	
	Запрос.Параметры.Вставить("Дата",        '2015-12-31');
	Запрос.Параметры.Вставить("Комментарий", Комментарий);
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		
		ДокументОбъект = Документы.КорректировкаРегистров.СоздатьДокумент();
		ДокументОбъект.Дата        = КонецДня('2015-12-31');
		ДокументОбъект.Комментарий = Комментарий;
		
	Иначе
		
		ДокументОбъект = Результат.Выгрузить()[0][0].ПолучитьОбъект();
		ДокументОбъект.ПометкаУдаления = Ложь;
		
	КонецЕсли;	
	
	ДокументОбъект.Ответственный = Пользователи.ТекущийПользователь();
	
	Возврат ДокументОбъект;
	
КонецФункции	

&НаКлиенте
Процедура СписокКорректировок(Команда)
	
	ОткрытьФорму("Документ.КорректировкаРегистров.ФормаСписка");
	
КонецПроцедуры

&НаКлиенте
Процедура КорректировкаСуммыСебестоимости(Команда)
	ДокументСсылка = КорректировкаСуммыСебестоимостиНаСервере();
	ПоказатьОповещениеПользователя("Создан документ", ПолучитьНавигационнуюСсылку(ДокументСсылка), Строка(ДокументСсылка));
КонецПроцедуры

&НаСервере
Функция КорректировкаСуммыСебестоимостиНаСервере()
	
	Запрос = Новый ПостроительЗапроса;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Док.Номенклатура КАК Номенклатура,
	|	Док.Характеристика КАК Характеристика,
	|	СУММА(Док.Количество) КАК Количество,
	|	СУММА(Док.Сумма) КАК Сумма
	|ПОМЕСТИТЬ ДанныеДокумента
	|ИЗ
	|	Документ.ОприходованиеИзлишковТоваров.Товары КАК Док
	|ГДЕ
	|	Док.Ссылка = &Ссылка
	|{ГДЕ
	|	Док.Характеристика.*}
	|
	|СГРУППИРОВАТЬ ПО
	|	Док.Номенклатура,
	|	Док.Характеристика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Док.Номенклатура КАК Номенклатура,
	|	Док.Характеристика КАК Характеристика,
	|	Док.Количество,
	|	Док.Сумма,
	|	Рег.КоличествоОстаток,
	|	Рег.СтоимостьОстаток,
	|	Рег.СтоимостьБезНДСОстаток,
	|	Рег.СуммаДопРасходовОстаток,
	|	Рег.СуммаДопРасходовБезНДСОстаток,
	|	Рег.СтоимостьРеглОстаток,
	|	Рег.ПостояннаяРазницаОстаток,
	|	Рег.ВременнаяРазницаОстаток,
	|	Рег.АналитикаУчетаНоменклатуры,
	|	Рег.РазделУчета,
	|	Рег.ВидЗапасов
	|ИЗ
	|	ДанныеДокумента КАК Док
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.СебестоимостьТоваров.Остатки(
	|				&Период,
	|				Организация = &Организация
	|					И АналитикаУчетаНоменклатуры.Склад = &Склад) КАК Рег
	|		ПО Док.Номенклатура = Рег.АналитикаУчетаНоменклатуры.Номенклатура
	|			И Док.Характеристика = Рег.АналитикаУчетаНоменклатуры.Характеристика
	|
	|УПОРЯДОЧИТЬ ПО
	|	Номенклатура,
	|	Характеристика";
	
	Запрос.Параметры.Вставить("Период",      '2016-01-01');
	Запрос.Параметры.Вставить("Организация", Объект.Организация);
	Запрос.Параметры.Вставить("Ссылка",      Объект.Оприходование);
	Запрос.Параметры.Вставить("Склад",       Объект.Склад);
	
	Если ЗначениеЗаполнено(Объект.Характеристика)
		И Объект.ОтборПоХарактеристике Тогда
		
		ЭлементОтбора = Запрос.Отбор.Добавить("Характеристика");
		ЭлементОтбора.Установить(Объект.Характеристика, Истина);
		
	КонецЕсли;	
	
	Запрос.Выполнить();
	ТаблицаДокумента = Запрос.Результат.Выгрузить();
	
	Для каждого СтрокаТЗ из ТаблицаДокумента Цикл
		
		ДокументОбъект =  НайтиДокументКорректировку("Корректировка остатков себестоимости: " + Строка(СтрокаТЗ.Номенклатура) + " " + Строка(СтрокаТЗ.Характеристика));
		ДокументОбъект.ПометкаУдаления = Ложь;
		
		ДокументОбъект.ТаблицаРегистров.Очистить();
		НоваяСтрока = ДокументОбъект.ТаблицаРегистров.Добавить();
		НоваяСтрока.Имя = "СебестоимостьТоваров";
		
		НоваяСтрока = ДокументОбъект.ТаблицаРегистров.Добавить();
		НоваяСтрока.Имя = "ПартииРасходовНаСебестоимостьТоваров";
		
		НоваяСтрока = ДокументОбъект.ТаблицаРегистров.Добавить();
		НоваяСтрока.Имя = "ПартииЗатратНаВыпуск";
		
		ДокументОбъект.Движения.СебестоимостьТоваров.Записывать = Истина;
		ДокументОбъект.Движения.ПартииРасходовНаСебестоимостьТоваров.Записывать = Истина;
		ДокументОбъект.Движения.ПартииЗатратНаВыпуск.Записывать = Истина;
	
	
		Запись = ДокументОбъект.Движения.СебестоимостьТоваров.Добавить();
		Запись.ВидДвижения = ВидДвиженияНакопления.Приход;
		Запись.Период      = '2015-12-31 23:59:59';
		Запись.Организация = Объект.Организация;
		Запись.АналитикаУчетаНоменклатуры = СтрокаТЗ.АналитикаУчетаНоменклатуры;
		Запись.РазделУчета = СтрокаТЗ.РазделУчета;
		Запись.ВидЗапасов  = СтрокаТЗ.ВидЗапасов;
		
		Запись.Стоимость       = -СтрокаТЗ.СтоимостьОстаток;
		Запись.СтоимостьРегл   = -СтрокаТЗ.СтоимостьРеглОстаток;
		Запись.СтоимостьБезНДС = -СтрокаТЗ.СтоимостьБезНДСОстаток;
		
		// Доп суммы просто сторнируем
		// также нужно отсторнировать регистр ПартииРасходовНаСебестоимостьТоваров
		Запись.СуммаДопРасходовБезНДС = -СтрокаТЗ.СуммаДопРасходовБезНДСОстаток;
		Запись.СуммаДопРасходов       = -СтрокаТЗ.СуммаДопРасходовОстаток;
		Запись.ПостояннаяРазница      = -СтрокаТЗ.ПостояннаяРазницаОстаток;
		Запись.ВременнаяРазница       = -СтрокаТЗ.ВременнаяРазницаОстаток;
		
		
		Запись = ДокументОбъект.Движения.СебестоимостьТоваров.Добавить();
		Запись.ВидДвижения = ВидДвиженияНакопления.Приход;
		Запись.Период      = '2015-12-31 23:59:59';
		Запись.Организация = Объект.Организация;
		Запись.АналитикаУчетаНоменклатуры = СтрокаТЗ.АналитикаУчетаНоменклатуры;
		Запись.РазделУчета = СтрокаТЗ.РазделУчета;
		Запись.ВидЗапасов  = СтрокаТЗ.ВидЗапасов;
		
		// Все суммы равны новой сумме
		Структура = ТаблицаПартийЗатрат(СтрокаТЗ.АналитикаУчетаНоменклатуры);
		СуммаДолжнаБыть = СтрокаТЗ.Сумма;
		
		Запись.Стоимость       = СуммаДолжнаБыть + Структура.ОстаткиСНДС.Итог("НДСРегл");
		Запись.СтоимостьРегл   = СуммаДолжнаБыть;
		Запись.СтоимостьБезНДС = СуммаДолжнаБыть;
		
		// Сторнируем доп расходы
		ТаблицаПартийДопРасходов = ТаблицаПартийДопРасходов(СтрокаТЗ.АналитикаУчетаНоменклатуры);
		Для каждого Строка1 из ТаблицаПартийДопРасходов Цикл
			
			ЗаписьДР = ДокументОбъект.Движения.ПартииРасходовНаСебестоимостьТоваров.Добавить();
			ЗаписьДР.ВидДвижения = ВидДвиженияНакопления.Расход;
			ЗаписьДР.Период      = '2015-12-31 23:59:59';
			ЗаполнитьЗначенияСвойств(ЗаписьДР, Строка1);
			
		КонецЦикла;	
		
		// Сторнируем затрыты на выпкуск без НДС
		Для каждого Строка2 из Структура.ОстаткиБезНДС Цикл
			
			ЗаписьЗатраты = ДокументОбъект.Движения.ПартииЗатратНаВыпуск.Добавить();
			ЗаписьЗатраты.ВидДвижения = ВидДвиженияНакопления.Расход;
			ЗаписьЗатраты.Период      = '2015-12-31 23:59:59';
			ЗаполнитьЗначенияСвойств(ЗаписьЗатраты, Строка2);
			
		КонецЦикла;	
		
		// Скорректируем суммы
		СуммаЕсть = Структура.ОстаткиСНДС.Итог("СтоимостьРегл");
		
		ОстатокСуммыДолжнаБыть = СуммаДолжнаБыть;
		ОстатокСуммыЕсть       = СуммаЕсть;
		
		Для каждого Строка3 из Структура.ОстаткиСНДС Цикл
			
			СуммаДолжнаБытьПоСтроке = Окр(ОстатокСуммыДолжнаБыть * Строка3.СтоимостьРегл / ОстатокСуммыЕсть, 2);
				
			ОстатокСуммыДолжнаБыть = ОстатокСуммыДолжнаБыть - СуммаДолжнаБытьПоСтроке;
			ОстатокСуммыЕсть       = ОстатокСуммыЕсть - Строка3.СтоимостьРегл;
			
			// Минус
			ЗаписьЗатраты = ДокументОбъект.Движения.ПартииЗатратНаВыпуск.Добавить();
			ЗаписьЗатраты.ВидДвижения = ВидДвиженияНакопления.Приход;
			ЗаписьЗатраты.Период      = '2015-12-31 23:59:59';
			ЗаполнитьЗначенияСвойств(ЗаписьЗатраты, Строка3);
			
			ЗаписьЗатраты.Количество = -Строка3.Количество;
			ЗаписьЗатраты.НДСРегл    = -Строка3.НДСРегл;
			
			ЗаписьЗатраты.СтоимостьРегл   = -Строка3.СтоимостьРегл;
			ЗаписьЗатраты.СтоимостьБезНДС = -Строка3.СтоимостьБезНДС;
			ЗаписьЗатраты.Стоимость       = -Строка3.Стоимость;
			
			ЗаписьЗатраты.ПостояннаяРазница = -Строка3.ПостояннаяРазница;
			ЗаписьЗатраты.ВременнаяРазница  = -Строка3.ВременнаяРазница;
			
			// Плюс
			ЗаписьЗатраты = ДокументОбъект.Движения.ПартииЗатратНаВыпуск.Добавить();
			ЗаписьЗатраты.ВидДвижения = ВидДвиженияНакопления.Приход;
			ЗаписьЗатраты.Период      = '2015-12-31 23:59:59';
			ЗаполнитьЗначенияСвойств(ЗаписьЗатраты, Строка3);
			
			ЗаписьЗатраты.Количество = Строка3.Количество;
			ЗаписьЗатраты.НДСРегл    = Строка3.НДСРегл;
			
			ЗаписьЗатраты.СтоимостьРегл   = СуммаДолжнаБытьПоСтроке;
			ЗаписьЗатраты.СтоимостьБезНДС = СуммаДолжнаБытьПоСтроке;
			ЗаписьЗатраты.Стоимость       = СуммаДолжнаБытьПоСтроке + ЗаписьЗатраты.НДСРегл;
			
			ЗаписьЗатраты.ПостояннаяРазница = 0;
			ЗаписьЗатраты.ВременнаяРазница  = 0;
			
		КонецЦикла;	
		
		//Структура = ТаблицаПартийЗатрат(Запись.АналитикаУчетаНоменклатуры);
		//Структура.ОстаткиСНДС.Итог("СтоимостьРегл");
		//Структура.ОстаткиБезНДС.Итог("СтоимостьРегл");
		//
		//Возврат ДокументОбъект.Ссылка;
		
		ДокументОбъект.Записать();

	КонецЦикла;	
	
	Возврат ДокументОбъект.Ссылка;
	
КонецФункции

&НаСервере
Функция ТаблицаПартийЗатрат(АналитикаУчетаПродукции)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Рег.Организация,
	|	Рег.АналитикаУчетаПродукции,
	|	Рег.АналитикаУчетаНоменклатуры,
	|	Рег.ВидЗапасов,
	|	Рег.ДокументВыпуска,
	|	Рег.ДокументПоступления,
	|	Рег.АналитикаУчетаПартий,
	|	Рег.КоличествоОстаток КАК Количество,
	|	Рег.СтоимостьОстаток КАК Стоимость,
	|	Рег.СтоимостьБезНДСОстаток КАК СтоимостьБезНДС,
	|	Рег.СтоимостьРеглОстаток КАК СтоимостьРегл,
	|	Рег.НДСРеглОстаток КАК НДСРегл,
	|	Рег.ПостояннаяРазницаОстаток КАК ПостояннаяРазница,
	|	Рег.ВременнаяРазницаОстаток КАК ВременнаяРазница
	|ИЗ
	|	РегистрНакопления.ПартииЗатратНаВыпуск.Остатки(
	|			&Период,
	|			Организация = &Организация
	|				И АналитикаУчетаПродукции = &АналитикаУчетаПродукции) КАК Рег
	|ГДЕ
	|	Рег.НДСРеглОстаток <= 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	СтоимостьРегл
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Рег.Организация,
	|	Рег.АналитикаУчетаПродукции,
	|	Рег.АналитикаУчетаНоменклатуры,
	|	Рег.ВидЗапасов,
	|	Рег.ДокументВыпуска,
	|	Рег.ДокументПоступления,
	|	Рег.АналитикаУчетаПартий,
	|	Рег.КоличествоОстаток КАК Количество,
	|	Рег.СтоимостьОстаток КАК Стоимость,
	|	Рег.СтоимостьБезНДСОстаток КАК СтоимостьБезНДС,
	|	Рег.СтоимостьРеглОстаток КАК СтоимостьРегл,
	|	Рег.НДСРеглОстаток КАК НДСРегл,
	|	Рег.ПостояннаяРазницаОстаток КАК ПостояннаяРазница,
	|	Рег.ВременнаяРазницаОстаток КАК ВременнаяРазница
	|ИЗ
	|	РегистрНакопления.ПартииЗатратНаВыпуск.Остатки(
	|			&Период,
	|			Организация = &Организация
	|				И АналитикаУчетаПродукции = &АналитикаУчетаПродукции) КАК Рег
	|ГДЕ
	|	Рег.НДСРеглОстаток > 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	СтоимостьРегл";
	
	Запрос.Параметры.Вставить("Период",      '2016-01-01');
	Запрос.Параметры.Вставить("Организация", Объект.Организация);
	Запрос.Параметры.Вставить("АналитикаУчетаПродукции", АналитикаУчетаПродукции);
	
	Результат = Запрос.ВыполнитьПакет();
	
	Структура = Новый Структура;
	Структура.Вставить("ОстаткиБезНДС",   Результат[0].Выгрузить()); 
	Структура.Вставить("ОстаткиСНДС", Результат[1].Выгрузить()); 
	
	Возврат Структура;
	
КонецФункции

&НаСервере
Функция ТаблицаПартийДопРасходов(АналитикаУчетаНоменклатуры)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Рег.Организация,
	|	Рег.АналитикаУчетаНоменклатуры,
	|	Рег.ДокументПоступления,
	|	Рег.ВидЗапасов,
	|	Рег.АналитикаУчетаПартий,
	|	Рег.ДокументПоступленияРасходов,
	|	Рег.СтатьяРасходов,
	|	Рег.СтоимостьОстаток КАК Стоимость,
	|	Рег.СтоимостьБезНДСОстаток КАК СтоимостьБезНДС,
	|	Рег.СтоимостьРеглОстаток КАК СтоимостьРегл,
	|	Рег.НДСРеглОстаток КАК НДСРегл,
	|	Рег.ПостояннаяРазницаОстаток КАК ПостояннаяРазница,
	|	Рег.ВременнаяРазницаОстаток КАК ВременнаяРазница
	|ИЗ
	|	РегистрНакопления.ПартииРасходовНаСебестоимостьТоваров.Остатки(
	|			&Период,
	|			Организация = &Организация
	|				И АналитикаУчетаНоменклатуры = &АналитикаУчетаНоменклатуры) КАК Рег";
	
	Запрос.Параметры.Вставить("Период",      '2016-01-01');
	Запрос.Параметры.Вставить("Организация", Объект.Организация);
	Запрос.Параметры.Вставить("АналитикаУчетаНоменклатуры", АналитикаУчетаНоменклатуры);
	
	Результат = Запрос.Выполнить();
	
	Возврат Результат.Выгрузить();
	
КонецФункции

&НаКлиенте
Процедура ПроверкаОстатков(Команда)
	ПроверкаОстатковНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПроверкаОстатковНаСервере()
	
	Запрос = Новый ПостроительЗапроса;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Док.Номенклатура КАК Номенклатура,
	|	Док.Характеристика КАК Характеристика,
	|	СУММА(Док.Количество) КАК Количество,
	|	СУММА(Док.Сумма) КАК Сумма
	|ПОМЕСТИТЬ ДанныеДокумента
	|ИЗ
	|	Документ.ОприходованиеИзлишковТоваров.Товары КАК Док
	|ГДЕ
	|	Док.Ссылка = &Ссылка
	|{ГДЕ
	|	Док.Характеристика.*}
	|
	|СГРУППИРОВАТЬ ПО
	|	Док.Номенклатура,
	|	Док.Характеристика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Док.Номенклатура КАК Номенклатура,
	|	Док.Характеристика КАК Характеристика,
	|	Док.Количество,
	|	Док.Сумма,
	|	РегСебестоимость.КоличествоОстаток КАК РегСебестоимостьКоличество,
	|	РегСебестоимость.СтоимостьРеглОстаток КАК РегСебестоимостьСумма,
	|	РегЗатраты.Сумма КАК РегЗатратыСумма
	|ИЗ
	|	ДанныеДокумента КАК Док
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.СебестоимостьТоваров.Остатки(
	|				&Период,
	|				Организация = &Организация
	|					И (АналитикаУчетаНоменклатуры.Номенклатура, АналитикаУчетаНоменклатуры.Характеристика) В
	|						(ВЫБРАТЬ
	|							Док.Номенклатура,
	|							Док.Характеристика
	|						ИЗ
	|							ДанныеДокумента КАК Док)
	|					И АналитикаУчетаНоменклатуры.Склад = &Склад) КАК РегСебестоимость
	|		ПО Док.Номенклатура = РегСебестоимость.АналитикаУчетаНоменклатуры.Номенклатура
	|			И Док.Характеристика = РегСебестоимость.АналитикаУчетаНоменклатуры.Характеристика
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			Рег.АналитикаУчетаПродукции.Номенклатура КАК Номенклатура,
	|			Рег.АналитикаУчетаПродукции.Характеристика КАК Характеристика,
	|			СУММА(Рег.СтоимостьРеглОстаток) КАК Сумма
	|		ИЗ
	|			РегистрНакопления.ПартииЗатратНаВыпуск.Остатки(
	|					&Период,
	|					Организация = &Организация
	|						И (АналитикаУчетаПродукции.Номенклатура, АналитикаУчетаПродукции.Характеристика) В
	|							(ВЫБРАТЬ
	|								Док.Номенклатура,
	|								Док.Характеристика
	|							ИЗ
	|								ДанныеДокумента КАК Док)
	|						И АналитикаУчетаПродукции.Склад = &Склад) КАК Рег
	|		
	|		СГРУППИРОВАТЬ ПО
	|			Рег.АналитикаУчетаПродукции.Номенклатура,
	|			Рег.АналитикаУчетаПродукции.Характеристика) КАК РегЗатраты
	|		ПО Док.Номенклатура = РегЗатраты.Номенклатура
	|			И Док.Характеристика = РегЗатраты.Характеристика
	|
	|УПОРЯДОЧИТЬ ПО
	|	Номенклатура,
	|	Характеристика";
	
	Запрос.Параметры.Вставить("Период",      '2016-01-01');
	Запрос.Параметры.Вставить("Организация", Объект.Организация);
	Запрос.Параметры.Вставить("Склад",       Объект.Склад);
	Запрос.Параметры.Вставить("Ссылка",      Объект.Оприходование);
	
	Если ЗначениеЗаполнено(Объект.Характеристика)
		И Объект.ОтборПоХарактеристике Тогда
		
		ЭлементОтбора = Запрос.Отбор.Добавить("Характеристика");
		ЭлементОтбора.Установить(Объект.Характеристика, Истина);
		
	КонецЕсли;	
	
	Запрос.Выполнить();
	ТаблицаОстатков.Загрузить(Запрос.Результат.Выгрузить());
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьДокументы(Команда)
	
	ПоказатьВопрос(Новый ОписаниеОповещения("УдалитьДокументыОтвет", ЭтотОбъект), "Удалить документы?", РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьДокументыОтвет(Ответ, ДопПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		УдалитьДокументыСервер();
		Состояние("Документы удалены");
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура УдалитьДокументыСервер()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КорректировкаРегистров.Ссылка
	|ИЗ
	|	Документ.КорректировкаРегистров КАК КорректировкаРегистров
	|ГДЕ
	|	НАЧАЛОПЕРИОДА(КорректировкаРегистров.Дата, ДЕНЬ) = &Дата
	|	И КорректировкаРегистров.Комментарий ПОДОБНО &Комментарий";
	
	Запрос.Параметры.Вставить("Дата",        '2015-12-31');
	Запрос.Параметры.Вставить("Комментарий", "Корректировка остатков себестоимости:%");
	
	ТаблицаДокументов = Запрос.Выполнить().Выгрузить();
	Для каждого СтрокаТЗ из ТаблицаДокументов Цикл
		
		ДокументОбъект = СтрокаТЗ.Ссылка.ПолучитьОбъект();
		ДокументОбъект.Удалить();
		
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура КорректироватьПроводки(Команда)
	ДокументСсылка = КорректироватьПроводкиНаСервере();
	ПоказатьОповещениеПользователя("Создан документ", ПолучитьНавигационнуюСсылку(ДокументСсылка), Строка(ДокументСсылка));
КонецПроцедуры

&НаСервере
Функция КорректироватьПроводкиНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Выборка.Номенклатура,
	|	Рег.Субконто2 КАК Склад,
	|	Выборка.Сумма,
	|	Рег.СуммаОстаток,
	|	Рег.СуммаНУОстаток,
	|	Рег.СуммаПРОстаток,
	|	Рег.СуммаВРОстаток
	|ИЗ
	|	(ВЫБРАТЬ
	|		Док.Номенклатура КАК Номенклатура,
	|		СУММА(Док.Сумма) КАК Сумма
	|	ИЗ
	|		Документ.ОприходованиеИзлишковТоваров.Товары КАК Док
	|	ГДЕ
	|		Док.Ссылка = &Ссылка
	|	
	|	СГРУППИРОВАТЬ ПО
	|		Док.Номенклатура) КАК Выборка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Хозрасчетный.Остатки(&Период, Счет = &Счет, , Организация = &Организация) КАК Рег
	|		ПО Выборка.Номенклатура = Рег.Субконто1";
	
	Запрос.Параметры.Вставить("Период",      '2016-01-01');
	Запрос.Параметры.Вставить("Организация", Объект.Организация);
	Запрос.Параметры.Вставить("Счет",        ПланыСчетов.Хозрасчетный.НайтиПоКоду("43"));
	Запрос.Параметры.Вставить("Ссылка",      Объект.Оприходование);
	
	ТаблицаБух = Запрос.Выполнить().Выгрузить();
	
	Содержание = "Корректировка остатков 43";
	
	ЗапросД = Новый Запрос; 
	ЗапросД.Текст =
	"ВЫБРАТЬ
	|	Док.Ссылка
	|ИЗ
	|	Документ.ОперацияБух КАК Док
	|ГДЕ
	|	НАЧАЛОПЕРИОДА(Док.Дата, ДЕНЬ) = &Дата
	|	И Док.Содержание ПОДОБНО &Содержание
	|	И Док.Организация = &Организация";
	
	ЗапросД.Параметры.Вставить("Дата",        '2015-12-31');
	ЗапросД.Параметры.Вставить("Содержание",  Содержание);
	ЗапросД.Параметры.Вставить("Организация", Объект.Организация);
	
	Результат = ЗапросД.Выполнить();
	Если НЕ Результат.Пустой() Тогда
		
		ДокументОбъект = Результат.Выгрузить()[0][0].ПолучитьОбъект();
		ДокументОбъект.ПометкаУдаления = Ложь;
		
	Иначе
		
		ДокументОбъект = Документы.ОперацияБух.СоздатьДокумент();
		ДокументОбъект.Дата        = КонецДня('2015-12-31');
		ДокументОбъект.Содержание  = Содержание;
		ДокументОбъект.Организация = Объект.Организация;
		
	КонецЕсли;	
	
	ДокументОбъект.Движения.Хозрасчетный.Записывать = Истина;
	ДокументОбъект.Ответственный = Пользователи.ТекущийПользователь();
	
	Для каждого СтрокаТЗ из ТаблицаБух Цикл
		
		Запись = ДокументОбъект.Движения.Хозрасчетный.Добавить();
		Запись.Период      = КонецДня('2015-12-31');
		Запись.Организация = Объект.Организация;
		
		Запись.СчетДт = ПланыСчетов.Хозрасчетный.НайтиПоКоду("43");
		БухгалтерскийУчет.УстановитьСубконто(Запись.СчетДт, Запись.СубконтоДт, "Номенклатура", СтрокаТЗ.Номенклатура);
		БухгалтерскийУчет.УстановитьСубконто(Запись.СчетДт, Запись.СубконтоДт, "Склады",       СтрокаТЗ.Склад);
		
		Запись.СчетКт = ПланыСчетов.Хозрасчетный.Вспомогательный;
		
		Запись.Сумма     = -СтрокаТЗ.СуммаОстаток;
		Запись.СуммаНУДт = -СтрокаТЗ.СуммаНУОстаток;
		Запись.СуммаПРДт = -СтрокаТЗ.СуммаПРОстаток;
		Запись.СуммаВРДт = -СтрокаТЗ.СуммаВрОстаток;
		
		
		Запись = ДокументОбъект.Движения.Хозрасчетный.Добавить();
		Запись.Период      = КонецДня('2015-12-31');
		Запись.Организация = Объект.Организация;
		
		Запись.СчетДт = ПланыСчетов.Хозрасчетный.НайтиПоКоду("43");
		БухгалтерскийУчет.УстановитьСубконто(Запись.СчетДт, Запись.СубконтоДт, "Номенклатура", СтрокаТЗ.Номенклатура);
		БухгалтерскийУчет.УстановитьСубконто(Запись.СчетДт, Запись.СубконтоДт, "Склады",       СтрокаТЗ.Склад);
		
		Запись.СчетКт = ПланыСчетов.Хозрасчетный.Вспомогательный;
		
		Запись.Сумма     = СтрокаТЗ.Сумма;
		Запись.СуммаНУДт = СтрокаТЗ.Сумма;
		Запись.СуммаПРДт = 0;
		Запись.СуммаВРДт = 0;
		
	КонецЦикла;	
	
	ДокументОбъект.Записать();
	Возврат ДокументОбъект.Ссылка;
	
КонецФункции
