
&НаКлиенте
Процедура Сформировать(Команда)
	СформироватьНаСервере(Объект.Заказ);
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СформироватьНаСервере(ДокументСсылка)
	
	ДополнительныеСвойства = Новый Структура;
	ДополнительныеСвойства.Вставить("ТаблицыДляДвижений", Новый Структура);
	
	Документы.ЗаказНаПроизводство.ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства);
	
	Таблица = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаДвижениеТоваров;
	
	НаборЗаписей = РегистрыНакопления.ДвижениеТоваров.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Регистратор.Установить(ДокументСсылка);
	НаборЗаписей.Загрузить(Таблица);
	
	НаборЗаписей.Записать();
	
КонецПроцедуры
