
&НаКлиенте
Процедура Рассчитать(Команда)
	РассчитатьНаСервере();
КонецПроцедуры

&НаСервере
Процедура РассчитатьНаСервере()
	
	МассивСотрудников = Новый Массив;
	МассивСотрудников.Добавить(Сотрудник);
	
	ОстаткиОтпусков.РасчетЗаработанныхОтпусков(МассивСотрудников);
	
КонецПроцедуры

&НаКлиенте
Процедура Список(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Отбор", Новый Структура("Сотрудник", Сотрудник));
	
	ОткрытьФорму("РегистрСведений.ЗаработанныеПраваНаОтпуска.ФормаСписка", ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура Состояния(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Отбор", Новый Структура("Сотрудник", Сотрудник));
	
	ОткрытьФорму("РегистрСведений.СостоянияСотрудников.ФормаСписка", ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура Тест(Команда)
	ТестНаСервере();
КонецПроцедуры

&НаСервере
Процедура ТестНаСервере()
	
	МассивСотрудников = Новый Массив;
	МассивСотрудников.Добавить(Сотрудник);
	
	ОтборПоПериодам = Перечисления.СостоянияСотрудника.СостоянияПрерывающиеПравоНаОтпуск();
	ПериодыПрерывающиеПравоНаОтпуск = СостоянияСотрудников.СостоянияСотрудников(МассивСотрудников, ОтборПоПериодам);

КонецПроцедуры

&НаСервере
Процедура ДобавитьНаСервере()
	
	Запись = РегистрыСведений.СостоянияСотрудников.СоздатьМенеджерЗаписи();
	Запись.Сотрудник = Сотрудник;
	Запись.Период = '2013-10-07';
	Запись.ДействуетДо = '2014-10-26';
	Запись.Состояние = Перечисления.СостоянияСотрудника.ОтпускПоУходуЗаРебенком;
	Запись.Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура Добавить(Команда)
	ДобавитьНаСервере();
КонецПроцедуры
