
&НаКлиенте
Процедура НайтиОпции(Команда)
	НайтиОпцииНаСервере();
КонецПроцедуры

&НаСервере
Процедура НайтиОпцииНаСервере()
	
	ИскомыйОбъект = Метаданные.Справочники.РесурсныеСпецификации.Реквизиты.ВыпускПроизвольнымиПорциями;
	//ИскомыйОбъект = Метаданные.Документы.ВыпускПродукции.Реквизиты.Склад;
	
	Для каждого ОбъектМетаданных из Метаданные.ФункциональныеОпции Цикл
		
		Если Ложь Тогда
			ОбъектМетаданных = Метаданные.ФункциональныеОпции.БазоваяВерсия;
		КонецЕсли;
		
		Для каждого Элемент Из ОбъектМетаданных.Состав Цикл
			Если Элемент.Объект.Имя = ИскомыйОбъект.Имя Тогда
				Сообщить(ОбъектМетаданных.Имя);
				Сообщить(ПолучитьФункциональнуюОпцию(ОбъектМетаданных.Имя));
			КонецЕсли;	
		КонецЦикла;	
		
	КонецЦикла;
	
КонецПроцедуры
