НаСервере
Процедура НайтиОпцииНаСервере()
	
	ИскомыйОбъект = Метаданные.Справочники.ШтатноеРасписание.Реквизиты.ОсобыеУсловияТрудаПФР;
	//ИскомыйОбъект = Метаданные.Документы.ВыпускПродукции.Реквизиты.Склад;
	
	Для каждого ОбъектМетаданных из Метаданные.ФункциональныеОпции Цикл
		
		Сообщить("ФО:    " + ОбъектМетаданных);
		Если Ложь Тогда
			ОбъектМетаданных = Метаданные.ФункциональныеОпции.БазоваяВерсия;
		КонецЕсли;
		
		Для каждого Элемент Из ОбъектМетаданных.Состав Цикл
			Если Элемент.Объект = ИскомыйОбъект Тогда
				Сообщить(ОбъектМетаданных.Имя);
				Сообщить(ПолучитьФункциональнуюОпцию(ОбъектМетаданных.Имя));
			КонецЕсли;	
		Сообщить("    " + Элемент.Объект);
		КонецЦикла;	
	КонецЦикла;
	
КонецПроцедуры
